[
  {
    "title": "twittatorship.com",
    "meaning": "A dictatorship that is attempted through late night Twitter decrees, that have no legal leverage .",
    "example": "Trump seems to think he can run the country by Twittatorship.",
    "id": "20weswgz0v",
    "available": "is taken"
  },
  {
    "title": "pissgate.com",
    "meaning": "The scandal in which there may or may not be a tape of the President getting pissed on by Russian prostitutes",
    "example": "I cant believe the President is caught up in this pissgate",
    "id": "k6qot87lm2",
    "available": "is taken"
  },
  {
    "title": "pullatrump.com",
    "meaning": "To blatantly keep asserting a lie, despite the overwhelming and obvious facts to the contrary.",
    "example": "Real Estate Salesman tried to pull a Trump, as he stood next to me on the empty lot, he kept insisting that the building located on the lot was currently renting for 100k a month.",
    "id": "36y3cnow01",
    "available": "is for sale"
  },
  {
    "title": "burner.com",
    "meaning": "A throwaway prepaid cellphone, typically used by dealers. Used until the minutes are up, then thrown away so they cannot be tapped.",
    "example": "'There is burners all over the street.'",
    "id": "v02rujqn61",
    "available": "is taken"
  },
  {
    "title": "zuckerversary.com",
    "meaning": "When you celebrate a year of friendship on Facebook.",
    "example": "Jim: Hey Steve, we've been friends for six years on Facebook. Happy zuckerversary!",
    "id": "76zwfoj36d",
    "available": "is available"
  },
  {
    "title": "saunabomb.com",
    "meaning": "Running into a sauna naked and pooping on the heat source",
    "example": "I was having a relaxing schvitz when Trump totally sauna bombed and blamed it on Obama.",
    "id": "w679i17p0k",
    "available": "is available"
  },
  {
    "title": "mooch.com",
    "meaning": "Someone who wants something for free .. someone who takes and takes but doesn't give back.",
    "example": "Matt is the biggest MOOCH ive ever seen",
    "id": "kmgghw8lmx",
    "available": "is taken"
  },
  {
    "title": "cannabusiness.com",
    "meaning": "The fine art of selling weed.",
    "example": "\"hey Aaron\"\r\r\"ey\"\r\r\"soo i uhh... heard you were in the business.\"\r\r\"what?\"\r\r\"the cannabusiness?\"",
    "id": "904ga8wj03",
    "available": "is taken"
  },
  {
    "title": "talkingbrown.com",
    "meaning": "talking shit, bullshitting, lying",
    "example": "Will you ever stop talking brown Martina",
    "id": "409dbpxq6o",
    "available": "is available"
  },
  {
    "title": "sleepmode.com",
    "meaning": "To temporarily shut off the thinking part of your brain and focus only at the task at hand, such as eating, playing video games, watching television, or exercising.",
    "example": "Husband: \"..........\" (Eats dinner while running sleep mode)Wife: \"Whatcha thinking about?\"Husband: \"..........Nothing.\" (Continues eating as he enters sleep mode again)",
    "id": "y6r4s15km1",
    "available": "is taken"
  },
  {
    "title": "magicstairs.com",
    "meaning": "Another term for escalator.",
    "example": "The elevator is too slow; I'll take the magic stairs.",
    "id": "z65dtyeg0o",
    "available": "is taken"
  },
  {
    "title": "shelffriend.com",
    "meaning": "When you become an option. You are not first pick of friends. When your friend starts dating someone and you are put up on a shelf until they have no other people to hang with.",
    "example": "I don't need you anymore, I'm dating somebody. So I'll put you up on the shelf until I have a need for you. You are my shelf friend.",
    "id": "q6d9c8rd0l",
    "available": "is for sale"
  },
  {
    "title": "verbalhandcuffs.com",
    "meaning": "When someone won't stop talking (usually about a subject you have no interest in). The talker has verbally forced you to stand there there and listen, even though you have given many clues that you have checked out. Examples: vacant stares, looking at your watch, checking your phone, answering in short one word phrases.",
    "example": "Girl 1 :So then I realized my cat really likes Meow Mix more than Frisky's but only if I mix it with Fancy Feast.Girl 2: (Stares blankly)Girl 1: Unless of course it's Chicken Livers from 9 Lives, Snowball loves that. It's her favorite.Girl 2: Uh-huh.Girl 1: Of course on her birthday I give her the good stuff, real tuna!Girl 2: (Thinks fuck me, verbal handcuffs)",
    "id": "90kquej802",
    "available": "is taken"
  },
  {
    "title": "gladimirputin.com",
    "meaning": "1. When Vladimir Putin smiles in a meme-worthy manner. (Name)2. Feeling glad or smug. (Slang)Antonym: Sadimir Putin",
    "example": "Gladimir Putin memes were all over my feed after the election.When Dick found out his girlfriend wasn't pregnant, he was super Gladimir Putin.",
    "id": "y6n4fgz80v",
    "available": "is available"
  },
  {
    "title": "teethpaste.com",
    "meaning": "A special form of tooth paste designed to work on multiple teeth simultaneously.",
    "example": "This teeth paste is awesome! Gone are the days of tirelessly scrubbing one tooth at a time.",
    "id": "omexigx90e",
    "available": "is taken"
  },
  {
    "title": "milkshakeduck.com",
    "meaning": "Someone who gains sudden fame for something nice and positive, only to soon after be revealed as a deeply flawed character with terrible opinions and/or a shady past, often involving corrosive social/political ideologies, which quickly tarnishes their fame and the good will people momentarily had towards them.",
    "example": "\"The whole internet loves Milkshake Duck, a lovely duck that drinks milkshakes! *5 seconds later* We regret to inform you the duck is racist\" -@pixelatedboat via Twitter",
    "id": "zmjphgj8m3",
    "available": "is taken"
  },
  {
    "title": "whenihavetime.com",
    "meaning": "I'm never gonna do it",
    "example": "Person: can you do the dishes?\rPerson2: when I have time",
    "id": "4m3daqxe02",
    "available": "is taken"
  },
  {
    "title": "bonadude.com",
    "meaning": "A modern legal term, _Bona Dude_ means \"in good dude\" in a cross of Legal Latin and Modern English. The term stresses the entirely \"good dude\" nature of the person to whom it refers. A \"bona dude\" is sincere and earnest about being a good dude.First used by @SCOTUSblog on Twitter, 2017 June 26.",
    "example": "The Supreme Court of the United States lifts injunction against travel ban, except with respect to individuals with _bona dude_ relationship to the US.",
    "id": "90x9bqyl02",
    "available": "is taken"
  },
  {
    "title": "broflake.com",
    "meaning": "Member of the alt-right who proudly shouts their free-speech warrior credentials but lose their minds when a fellow member is critcized.",
    "example": "I see a mass of Dave Rubin's broflakes have had Contrapoint's video kicked off YouTube.",
    "id": "26lrs93q64",
    "available": "is taken"
  },
  {
    "title": "ticketstopolicemansball.com",
    "meaning": "Defination:To pay off a cop. a bribe, A \"Shakedown\",\r.a solicatation for a payoff by an official, agent, officer, pretend or real. c.t.",
    "example": "ex: \"Theres a $500.OO fine for That!\",\r\"Or, you could buy a coupl'a -tickets to Policeman's Ball\" , \"50 bucks each, 2-3 should do\"\r( No, there was no 'Real' Ball/Dance). c.t",
    "id": "q68dt58p0k",
    "available": "is available"
  },
  {
    "title": "fartoholic.com",
    "meaning": "Someone who is addicted to their own fart smell, and so farts as often as possible.",
    "example": "'Stan, you're a real fartoholic'\r'So?'\r'You stink.'",
    "id": "46pzcyd9m8",
    "available": "is available"
  },
  {
    "title": "sheshed.com",
    "meaning": "The female equivalent to a Man Cave.",
    "example": "Wife: Hey, your going to your Man Cave?\rHusband: Yep. Need some me time.\rWife: That's okay, I have my she shed.",
    "id": "8mvlulon6z",
    "available": "is taken"
  },
  {
    "title": "millyrock.com",
    "meaning": "A dance a turn up dance where you wave your hands & move your body",
    "example": "I Milly rock on Any Block",
    "id": "7moyf41n0e",
    "available": "is for sale"
  },
  {
    "title": "kushnereyes.com",
    "meaning": "Soulless eyes devoid of compassion, empathy, humor or basic human feeling, most often scanning the perimeter for prey.",
    "example": "That dead shark has some Kushner eyes",
    "id": "w619i1wr04",
    "available": "is available"
  },
  {
    "title": "kleptocracy.com",
    "meaning": "A system of government characterized by rampant corruption and misallocation of public funds.",
    "example": "That country is a kleptocracy in which nothing is accomplished without greasing the palms of government officials.",
    "id": "20wkehwgz0",
    "available": "is taken"
  },
  {
    "title": "fidgetspinner.com",
    "meaning": "A pacifier for the hands",
    "example": "\"Hey, look, he's feeling fidgety. Give him a fidget spinner before he crumples all the napkins!",
    "id": "k6qooa87lm",
    "available": "is taken"
  },
  {
    "title": "dadalicious.com",
    "meaning": "A \"dad\" or \"father\" that has managed to stay hot, hip, happenin' and relevent despite his children's claims that he has \"no game\".",
    "example": "Check out Neill's dad... he is still so cool! He is dadalicious!",
    "id": "36y53bnowm",
    "available": "is for sale"
  },
  {
    "title": "flirttoconvert.com",
    "meaning": "The act of flirting to convince an unsuspecting person to attend your church",
    "example": "Person 1: How did you get him to come to church?\rPerson 2: I just had to flirt to convert.",
    "id": "v021rsjqnm",
    "available": "is for sale"
  },
  {
    "title": "disingest.com",
    "meaning": "To shit.",
    "example": "BRB, I have to go disingest my burrito.",
    "id": "76zlwtoj3m",
    "available": "is for sale"
  },
  {
    "title": "trumpyears.com",
    "meaning": "An inverse analogue to \"dog-years,\" in which a dog is said to age seven years for every human year (which pre-Trump was the saddest of time warps known).Now, \"Trump-years\" defines the human experience of aging one full human year (with all the ignominies that accompany aging) for every one month that that man is in office.",
    "example": "\"My God, I've gone grey in just these three+ months, but of course, I am aging in Trump-years. By the time we get him out in 2020 I will be over one hundred Trump-years-old! \"",
    "id": "w67n9c17pm",
    "available": "is for sale"
  },
  {
    "title": "trumpaf.com",
    "meaning": "Basically, doing or saying any of the horrible things that Trump would do.",
    "example": "\"Let's have a party, but not invite any minorities.\"\r\"Dude, no. That's Trump AF! \"",
    "id": "kmgrguw8l6",
    "available": "is taken"
  },
  {
    "title": "parispullout.com",
    "meaning": "When you are having really great sex with the woman of your dreams, but decide at the last minute to pull out and go jerk off with your tiny little hands and shoot your dusty, clumpy load onto an American flag instead, to make sure no one else has as awesome and huge orgasm as you.",
    "example": "Everyone at the orgy was having a great time, till Donny decided to do a paris pullout.",
    "id": "9041gf8wj0",
    "available": "is available"
  },
  {
    "title": "dananananabatman.com",
    "meaning": "The theme song or opening of the old school version, of batman. it mainy appears when batman suddenly jumps out of no where and then the theme song plays. this song is a trademark of the popular series, ''Batman.''",
    "example": "Music: danananananananaaana\rPeople:BATMAN!\r(Batman Appears)\rdanananana batman",
    "id": "4098dipxqm",
    "available": "is available"
  },
  {
    "title": "gronking.com",
    "meaning": "Violently spiking an object (most common is a football) to the ground in celebration.",
    "example": "Gronking a department store mannequin leg.",
    "id": "y6rn4h15k0",
    "available": "is for sale"
  },
  {
    "title": "fartofdeception.com",
    "meaning": "This phrase describes the scenario of when you randomly smell something tasty cooking somewhere, and when you look around yourself to determine where the food is at you realise the only place for the smell to have come from was someones asshole.",
    "example": "Jenny and james ate curry for dinner and the next night are watching a movie.James asks jenny if she has got the leftovers in the microwave because its smells as good as yesterday.\rJenny says no with a dirty grin and james realises he was fooled by the fart of deception.",
    "id": "z65ldayegm",
    "available": "is available"
  },
  {
    "title": "meatumbrella.com",
    "meaning": "When you push all the meat onto the bottom of the chicken wing",
    "example": "Dude I am going to turn this wing into a meat umbrella so I don't get my hands dirty",
    "id": "q6dd9b8rd6",
    "available": "is available"
  },
  {
    "title": "babybirdhands.com",
    "meaning": "Handling someone/something with the upmost care. Being gentle.",
    "example": "Traveling with Rob is such a crapshoot that his delivery needs to be handled with Baby Bird Hands.",
    "id": "90kdqsej8m",
    "available": "is available"
  },
  {
    "title": "classwoody.com",
    "meaning": "A boner that you get in class when you are thinking of hot girls instead of listening to the teacher. These boners help to make class go faster but, can be dangerous if you are asked a question related to the subject and your boner is not hidden.",
    "example": "\"Hey bro did you hear what she said about the protons and electrons? \". \"Nah sorry man , too busy trying to hide my class woody.\"",
    "id": "y6no4tgz8m",
    "available": "is available"
  },
  {
    "title": "snled.com",
    "meaning": "SNL-ed\rwhen a political or otherwise famous person does/says something so goofy that it requires them to be spoofed on Saturday Night Live.\r",
    "example": "After that speech, he is sure to be SNL-ed.",
    "id": "ome7xcgx96",
    "available": "is taken"
  },
  {
    "title": "procaffination.com",
    "meaning": "The inability to make a decision until you've had a cup of coffee.",
    "example": "Make me a coffe I'm flawed by procaffination today.",
    "id": "zmj3pugj86",
    "available": "is taken"
  },
  {
    "title": "emptiful.com",
    "meaning": "(adjective)Fully, or completely empty.",
    "example": "Larry: \"Woah, this parking lot is emptiful!\"\rDave: \"I wish I brought my rollerblades!\"\"Bob drank all the beers and left the cooler emptiful.\"Pierce: \"Perhaps Diane's head is as emptiful as we thought after all.\"Farood: \"So, is your glass half full, or half empty?\"\rJonah: *drinks up*\r\"Well, now it's emptiful\".\rFarood: *poker face*",
    "id": "4m35dfqxe6",
    "available": "is taken"
  },
  {
    "title": "fye.com",
    "meaning": "another word for tight",
    "example": "\"That pizza looks Fye\"",
    "id": "90xv9iqyl6",
    "available": "is taken"
  },
  {
    "title": "donutations.com",
    "meaning": "The expectation of a donation of a donut. (Usually ends in heartbreak.)",
    "example": "She brought back home a cookie, and totally crushed my donutations.",
    "id": "26l3rh93q6",
    "available": "is taken"
  },
  {
    "title": "covfefe.com",
    "meaning": "(n.) When you want to say \"coverage\" but your hands are too small to hit all the letters on your keyboard.",
    "example": "Despite constant negative press covfefe.",
    "id": "q68lda58pm",
    "available": "is for sale"
  },
  {
    "title": "covfefe.com",
    "meaning": "Covfefe, Russian word that translates literally as 'I quit' or 'I leave' or 'I resign.'",
    "example": "\"Despite the constant negative press, covfefe.\"",
    "id": "46pezbyd9m",
    "available": "is for sale"
  },
  {
    "title": "chawedon.com",
    "meaning": "When you really go to town on something your eating",
    "example": "He really chawed on that steak bone",
    "id": "8mvolslon6",
    "available": "is available"
  },
  {
    "title": "hotdogholidays.com",
    "meaning": "Any holiday when you go to someones house you will be offered a hotdog\rie memorial day , 4 of july, labor day",
    "example": "Im going to miss the barbeques now that the hotdog holidays are over",
    "id": "7mogyt41n0",
    "available": "is taken"
  },
  {
    "title": "feelsometypeofway.com",
    "meaning": "A unknown or crazy feeling about a situation",
    "example": "When I went on that date, the guy reached over and kissed me without asking. Now that made me feel some type of way",
    "id": "w61x9c1wr0",
    "available": "is taken"
  },
  {
    "title": "backfired.com",
    "meaning": "Verb; An attempt to fix something in which the fixing actually makes the situation worse for you. Common on the internet when an arguement \"backfires\" and makes you look stupid.\r\r",
    "example": "nub 1:My mom is not FAT! See! *insert link*\r\rperson 2: Dude! She totally is, your arguement totally backfired on you. Lol, dumbass.",
    "id": "20wweuwgz0",
    "available": "is taken"
  },
  {
    "title": "warroom.com",
    "meaning": "When a group of people in a room get turnt on the same subject and it pisses everyone in the room off",
    "example": "Bruh last night I had a major war room in my hotel room",
    "id": "k6qkof87l6",
    "available": "is taken"
  },
  {
    "title": "breakgreen.com",
    "meaning": "To share cannabis with friends or strangers",
    "example": "I like to break green with friends and then explore a museum together.",
    "id": "36y33inow0",
    "available": "is taken"
  },
  {
    "title": "altlaws.com",
    "meaning": "Inlaws that are Trump supporters",
    "example": "I have to get ready for an interesting Easter dinner with the alt-laws",
    "id": "v02erhjqn0",
    "available": "is for sale"
  },
  {
    "title": "restingmurderface.com",
    "meaning": "When your natural resting expression appears so angry that people who do not know you, and even those who do at times, believe you may soon murder someone. Typically for men. Derivative of resting bitch face in women.",
    "example": "Girl 1: Why does Bryan look like he's going to kill that kid?Girl 2: Oh he's ok, he just has resting murder face. He isn't actually angry at all. He's probably pondering football schedules.",
    "id": "76zqwaoj36",
    "available": "is taken"
  },
  {
    "title": "facejerking.com",
    "meaning": "the act of being on facebook all of the time, and getting no satisfaction out of it.",
    "example": "my boyfriend spends all of his time looking a posts on facebook, he is just face jerking.",
    "id": "w67r9b17p0",
    "available": "is available"
  },
  {
    "title": "accidentalanal.com",
    "meaning": "When two or more men are engaged in some sort of testosterone-based activity (I.E. wrestling, football, rugby, etc...) and there is incidental penis to anus penetration. The term \"accidental anal\" refers to that occurrence.",
    "example": "\"Matt and Luke were playing a heated, but quality game of chess that ended in accidental anal.\"\"I just wanted to put a dollar in the homeless man's tin can, but accidental anal occurred, too. Now I need special medication from the clinic.\"\"The poker game ended much as it started, with accidental anal. I think we're all walking a little slower this morning.\"",
    "id": "kmg5gtw8l0",
    "available": "is for sale"
  },
  {
    "title": "sadsturbation.com",
    "meaning": "masturbating while sad.",
    "example": "\"My girlfriend broke up with me, so im left to sadsturbation.\"",
    "id": "9043gf8wjm",
    "available": "is available"
  },
  {
    "title": "trumpaggedon.com",
    "meaning": "A global arena of havoc, hysteria and fear created by a single individual and his or her cohorts who have the wealth, position and power to instill agendas based in greed through endless, unexpected atrocities and horrors upon the innocence of an unknowing and unprepared world.",
    "example": "“Within months of the regime’s rise to power and influence, world populations began to realize each day forward was leading all peoples and nations closer and closer to trumpaggedon.”",
    "id": "4091dapxq6",
    "available": "is taken"
  },
  {
    "title": "galories.com",
    "meaning": "Calories consumed during activities with your girl friends (girls night out, wine during a pedicure, eating McDonalds at 2 a.m. shitfaced) that generally are not part of your diet but you eat them anyway.Men: see Palories",
    "example": "Girl, I've gained so much weight even though I'm using Herbalife.Uh, it's all them galories you've been eating in addition to your diet.",
    "id": "y6ro4u15k6",
    "available": "is taken"
  },
  {
    "title": "trumpedup.com",
    "meaning": "A severe fuck up. Yuuge even.",
    "example": "Guy 1: Last night I got shitfaced, and when I woke up this morning, I was sleeping with my sister.\rGuy 2: That's trumped up. Your brother's going to be so pissed.",
    "id": "z65gdfyeg0",
    "available": "is for sale"
  },
  {
    "title": "craygrammar.com",
    "meaning": "What grammar?Cray grammar is the definition of \"fucking terrible\". Not even one sentence has proper grammar.\rI can't believe he hasn't learned..",
    "example": "\"I cant gone there if ive being there\"\r\"I DIDINT HAD DONE THAT\"\r\"OMFG U DONT UNDERTOOD ANY THING I SAY YOU AND YOU PRETENDING TO BEEN HAXED\"\r\"I believe you're gonna learn a new launuage now.\"\r\"Mnpn why the fuck would you add a such rule like that.\"\r\"hes always in the pain in the butt\"\r\"STOP BEING SUSPICOSUS\"\r\"IM DIEING WITH THIS HOORBILE PICTURE X_X\"\r\"Sersiouly when i block him he just goes to somebody else to let me unblock him\"\r\"i didin't feel let mikos being in here\"\r\"i already finshed quarantie'\"Oh my god.. Cray grammar!",
    "id": "q6d19t8rd6",
    "available": "is for sale"
  },
  {
    "title": "starwank.com",
    "meaning": "The act of pleasing oneself while focusing intently on the night sky.",
    "example": "Greg stepped out for a night walk, but was so taken by the splendour of the stars, that he engaged in a session of self pleasure and quiet reflection - a starwank.",
    "id": "90kyqhej8m",
    "available": "is taken"
  },
  {
    "title": "mommyfied.com",
    "meaning": "When you have spent so much time with your kids that you cant function as a normal adult anymore.",
    "example": "\"Did she just say she has to go tinkle?\" \"Yeah, she's mommyfied\"\"That poor girl is mommyfied\"",
    "id": "y6nw4agz86",
    "available": "is for sale"
  },
  {
    "title": "klazomaniac.com",
    "meaning": "This would be a person WHO CAN ONLY SPEAK BY SHOUTING. That's all we're going to say ABOUT THAT!",
    "example": "\"Can you please stop being such a klazomaniac and calm down\"",
    "id": "omekxbgx9m",
    "available": "is taken"
  },
  {
    "title": "partysludge.com",
    "meaning": "noun. The mixture of spilt booze, puke, dirt and sweat that accumulates on the floor during a party in any frat house or dank basement. Often destroys any white shoes, particularly white ones",
    "example": "\"Aw man, I have to get this party sludge off my nice new shoes in time for Easter.\"",
    "id": "zmj5ptgj80",
    "available": "is available"
  },
  {
    "title": "bedcrumbs.com",
    "meaning": "noun\rsmall fragments of miscellaneous particles found in between the sheets of an untidy bed.\rbed crumbs can be caused by a number of things, such as\r-eating in bed\r-NOT WIPING YOUR FEET BEFORE YOU CLIMB IN\r-dumping glitter on your sheets\r-letting homeless people sleep in your bed\r-being slutty\r(often found in the beds of sloppy people and college dormitories)",
    "example": "-When you're eating puff pastries in bed, and later that night, you're sleeping in a pile of irritating globs of food - bed crumbs!\r\r-When someone has been walking outside barefoot, then climbs underneath your covers, and shards of dirt, sand and dry leaves are transferred to your freshly made bed - bed crumbs!\r\rUse it in a sentence!\r-\"Don't put your feet on my bed, I don't want any bed crumbs.\"\r-\"Ew! Someone was eating applesauce in my bed, and now I have stinky bed crumbs!\"\r-\"You know it's time to wash your sheets when you start to get bed crumbs.\"",
    "id": "4m3xdtqxem",
    "available": "is taken"
  },
  {
    "title": "fbi.com",
    "meaning": "Female  Body Inspector",
    "example": "Bob looks at girls a lot, hes is a female body inspector",
    "id": "90xe9cqylm",
    "available": "is taken"
  },
  {
    "title": "learn.com",
    "meaning": "To persuade someone to your way of thinking via violent means.",
    "example": "\"I'll learn you good!\" (Followed by a slap)",
    "id": "26l2ra93q0",
    "available": "is taken"
  },
  {
    "title": "cockholster.com",
    "meaning": "the mouth of either a male or a female. used as a derogatoty meaning.",
    "example": "joe blow, shut your cock holster. ",
    "id": "q68rdf58pm",
    "available": "is taken"
  },
  {
    "title": "sugarnuts.com",
    "meaning": "A \"pet name\" of an adored or term of endearment for a significant other who has deliciously suckable, irresistible balls.",
    "example": "I use the name \"Sugar Nuts\" to refer to my Sweet-thang Aaron whose balls I could lick all day.",
    "id": "46pgziyd96",
    "available": "is taken"
  },
  {
    "title": "uggo.com",
    "meaning": "n. uh-goh, uh-gohs\r\rOne who is ugly; offensive to the eye; repulsive",
    "example": "I hate uggos.",
    "id": "8mvvlhlonm",
    "available": "is taken"
  },
  {
    "title": "accidentalblowjob.com",
    "meaning": "when you didn't really plan on giving a blowjob but you did anyways.",
    "example": "\"I just wanted to make out with him, but it turned into an accidental blowjob.\"",
    "id": "7mo7yh41n0",
    "available": "is available"
  },
  {
    "title": "adult.com",
    "meaning": "A person who has stopped growing at both ends and is now growing in the\rmiddle.",
    "id": "w61q9b1wrm",
    "available": "is taken"
  },
  {
    "title": "noshitsituation.com",
    "meaning": "When you can't poo.",
    "example": "Brad, \"Hey dude did you lay a big one in there?\"Chad, \"Nah brah, it was a no shit-situation.\"Brad, \"Damn.\"",
    "id": "20w3euwgz6",
    "available": "is available"
  },
  {
    "title": "beatoutapaycheck.com",
    "meaning": "To masturbate at work while on the clock.",
    "example": "I was horny at work today, so I hit the hot steaming port a pot for half an hour to beat out a paycheck.",
    "id": "k6q4ou87l0",
    "available": "is available"
  },
  {
    "title": "roomhobbit.com",
    "meaning": "In college, one who stays in their room for countless hours on end without ever coming out until they grow long hair and toenails.",
    "example": "John had to endure countless jibes and jeers after he finally decided to stop being a room hobbit and emerged from his room with a man mane that came out from his pants, extending down his leg trunks to his jagged, witch toenails.",
    "id": "36y23hnowm",
    "available": "is for sale"
  },
  {
    "title": "murica.com",
    "meaning": "Slang for America/United States. Interchangeable with Merica.",
    "example": "I sat from the comfort of my car and watched a guy ahead of me get jacked up by four officers and thrown on the ground. #'Murica #pewpewpew",
    "id": "v02rrujqn6",
    "available": "is taken"
  },
  {
    "title": "strokersguilt.com",
    "meaning": "That feeling of remorse/self loathing/shame after busting a huge nut to questionable pornographic material.",
    "example": "I suffered Stroker's Guilt after getting off to a midget clown gang bang.",
    "id": "76zzwfoj36",
    "available": "is taken"
  },
  {
    "title": "hotdogpic.com",
    "meaning": "Sexy ass pic you send in a text message.",
    "example": "Girrrrrl you look too fresh you need to send your man a hot dog pic.",
    "id": "w67x9i17p0",
    "available": "is taken"
  },
  {
    "title": "unfuckyourself.com",
    "meaning": "The opposite of fucking ones self. To unfuckyourself, you're fixing a fuck up or avoiding the fuck up altogether.",
    "example": "11 year old mother: What's a condom?\rFLuffee: It's what you could have used to unfuckyourself. Yes, Unfuckyourself is indeed a word.\"",
    "id": "kmg1gcw8lm",
    "available": "is for sale"
  },
  {
    "title": "memewhore.com",
    "meaning": "Someone who seriously overdoes it with the memes, and they're not even trying to troll. They're just annoying.",
    "example": "Fred: u mad? u mad? u mad?\rSally: shut up.\rFred: ahahaha so you are mad!\rSally: .....\rFred: fake and gay\rSally: you're such a memewhore.\rFred: u mad?",
    "id": "904lga8wjm",
    "available": "is for sale"
  },
  {
    "title": "chickensleeping.com",
    "meaning": "When you fall asleep in an upright position with your head dangling, most commonly in a car or airplane. The motion makes your head bob up and down like a chicken pecking. In rare cases, you could be fighting falling asleep in class and a moving vehicle is not necessary. Chances of chicken sleeping are increased by 70% after a wake and bake session or accounting class.",
    "example": "I was sitting behind her in class and thought she was paying attention. But then I walked by and saw that she was just chicken sleeping.",
    "id": "409jdbpxq6",
    "available": "is available"
  },
  {
    "title": "downinthetrumps.com",
    "meaning": "The feeling of depression and sense of impending doom that sweeps through a person when they think about how Donald Trump is fucking up the world.",
    "example": "Nick has been Down in the Trumps ever since he watched that documentary about Donald Trump on TV.",
    "id": "y6rv4s15km",
    "available": "is taken"
  },
  {
    "title": "earthbiscuit.com",
    "meaning": "A tree-hugging female hippie who doesn't shave and always looks like she's maybe been rolling around in the dirt.",
    "example": "Wow, that Alanis.  What an earth biscuit.",
    "id": "z65kdtyeg6",
    "available": "is for sale"
  },
  {
    "title": "gorsuch.com",
    "meaning": "The medical term for the area between the testicles and the rectum.",
    "example": "\"Due to a lack of viable healthcare options, and messed up laws, the itchy rash on my gorsuch has more rights than I do\"",
    "id": "q6dq9c8rdm",
    "available": "is taken"
  },
  {
    "title": "cheeched.com",
    "meaning": "When you get so glazed over from smoking the hwaddaow that you can't tell up from down.\r\rDerived from Cheech and Chong, who smoked a lot of reefer.",
    "example": "Back in the day when we were burnin' a quarter a day we got good and cheeched.",
    "id": "90k5qfej80",
    "available": "is for sale"
  },
  {
    "title": "neglext.com",
    "meaning": "Neglext:The act of abandoning someone in mid-conversation for a prolonged period of time(intentionally or unintentionally) via the sending of text messages electronically especially from one cell phone to another.",
    "example": "I'm so sorry, I passed out early last night and totally neglexted you!",
    "id": "y6nz4fgz86",
    "available": "is available"
  },
  {
    "title": "ghostbeer.com",
    "meaning": "When you inadvertently reach for a beer that does not exist.Usually seen when sitting in your favorite chair while watching your favorite sport or tv show.",
    "example": "\"Did you see that, I totally reached for my ghost beer\"\"man, I need another round...I can't stop ghost beering\"",
    "id": "ome5xhgx9m",
    "available": "is for sale"
  },
  {
    "title": "sugarorgasm.com",
    "meaning": "when you have an extreme sugar high. way beyond a sugar buzz, and in the morning you usually wake up with a sugar hangover and can't look at another sugary food, (candy) for three days without wanting to throw up.",
    "example": "bob: last night you had so much sugar, you were acting high.\rlilly: i was having a sugar orgasm",
    "id": "zmj1pcgj8m",
    "available": "is available"
  },
  {
    "title": "rabbitfuck.com",
    "meaning": "during intercourse, to hump as fast as you can, like it's a race to bust a nut.. as if you don't care about the other person, you're just here for you.",
    "example": "guy 1: \"HAHAH YOU HAD SEX WITH JESSICA? EWWW!\"\rguy 2: \"shut  up dude, rabbit fuck\"\rguy 1:  \"oh.\"",
    "id": "4m3ldaqxem",
    "available": "is available"
  },
  {
    "title": "ssdgm.com",
    "meaning": "Stay Sexy, Don’t Get Murdered",
    "example": "This creep followed me for four blocks. SSDGM, everyone!",
    "id": "90xy9bqyl6",
    "available": "is taken"
  },
  {
    "title": "catchthesethumbs.com",
    "meaning": "Fighting or serving/ about to serve your opponent an ass whoopin in video game.",
    "example": "Person 1: okay, play me on Mortal Kombat and I'll beat you. Person 2: Oh really! Boiii your gonna catch these thumbs!",
    "id": "26lyrs93qm",
    "available": "is taken"
  },
  {
    "title": "chop.com",
    "meaning": "The act of picking someone up.",
    "example": "i chopped this girl in the subway last weekend.",
    "id": "q681dh58p0",
    "available": "is for sale"
  },
  {
    "title": "reaccommodate.com",
    "meaning": "to beat up and violently drag paying passengers off an airplane in order to make room for airline crew on stand-by.",
    "example": "\"I apologize for having to re-accommodate these customers.\" (Oscar Munoz, CEO, United Airlines, April 10, 2017)",
    "id": "46p4zfyd96",
    "available": "is taken"
  },
  {
    "title": "voluntold.com",
    "meaning": "forciby volunteered.  A task that was once voluntary has now been ordered to you.",
    "example": "\"You slack ass ensigns. Since none of you are going to volunteer, consider yourselves all voluntold.  See you tomorrow morning at 0600.\"",
    "id": "8mvklulon0",
    "available": "is taken"
  },
  {
    "title": "romnesia.com",
    "meaning": "(1) To flip-flop.(2) To black out.",
    "example": "\"If you say you're for equal pay for equal work, but you keep refusing to say whether or not you'd sign a bill that protects equal pay for equal work -- you might have Romnesia.\"\"Man, I think I have Romnesia. I went out last night and when I woke up this morning, my dog was strapped to the roof of my car. No clue how it got up there.\"",
    "id": "7molyf41nm",
    "available": "is taken"
  },
  {
    "title": "trumpstamp.com",
    "meaning": "Someone who wears an obvious hairpiece.",
    "example": "Hey Jim, when did you gat that TrumpStamp there on your head?",
    "id": "w61l9i1wr0",
    "available": "is for sale"
  },
  {
    "title": "backseatbuyer.com",
    "meaning": "A person who gets excited over other people's future or current purchases. Usually an enthusiastic shopper for themselves as well.\rCan also be used as an adjective and verb.",
    "example": "\"I'm such a backseat buyer; I love helping my friends choose stuff as much as buying something for myself!\"\r\r\"Whenever I think about getting a new gadget, my father goes backseat buyer.\"\r\r\"If you don't stop backseat buying right now I'm going to smack you.\"",
    "id": "20w9euwgz6",
    "available": "is taken"
  },
  {
    "title": "phoqueue.com",
    "meaning": "(n.) fuh-kyoo The line, or queue, formed outside of a Vietnamese restaurant in anticipation of its noodle soup, also known as pho",
    "example": "Man #1: Dude, I am not going to stand in this pho queue !\rMan #2: Fuck you !\rMan #1: No. Dude, I said pho queue...",
    "id": "k6qyoa87l0",
    "available": "is taken"
  },
  {
    "title": "supposably.com",
    "meaning": "It actually is a word: capable of being conjectured or imagined.\r\rThis word was popularized in an episode of Friends in the second season.",
    "example": "Did they go to the zoo?\rSupposably...",
    "id": "36yo3bnow0",
    "available": "is taken"
  },
  {
    "title": "pissinthewind.com",
    "meaning": "Doing something that is a complete waste of effort and time for which you can expect no results and may even backfire on you.",
    "example": "Telling the president that invading other countries is unpopular with many voters is like pissing in the wind.",
    "id": "v022rfjqn0",
    "available": "is taken"
  },
  {
    "title": "streetcreep.com",
    "meaning": "1. A new perjorative term for Wall Street executives who raked in huge bonuses while plunging the world into economic chaos. \r\r2. A financial advisor who sells Wall Street products on commission.",
    "example": "Did you see the news? Those Street Creeps are taking a private jet to Aruba using our bailout money.",
    "id": "20w99awgz6",
    "available": "is taken"
  },
  {
    "title": "cleancoal.com",
    "meaning": "See Oxymoron",
    "example": "My uncle has black lung after working at Clean Coal power plant.",
    "id": "k6qy9c87l0",
    "available": "is for sale"
  },
  {
    "title": "cloudplans.com",
    "meaning": "When you and someone else make arrangements to hang out but the plans we're not officially made, therefore they can diminish like a cloud in the sky",
    "example": "\"So are you and __ hanging out later?\"\r\"I don't know, we made cloud plans\"",
    "id": "36yogunow0",
    "available": "is for sale"
  },
  {
    "title": "apriltool.com",
    "meaning": "Somebody that says really stupid April Fools Day jokes that piss everyone off.",
    "example": "\"I totally did your mom last night!!! APRIL FOOLS!!! BUT NOT REALLY!!!\"\r\"That guy is such an April Tool.\"",
    "id": "v022zujqn0",
    "available": "is taken"
  },
  {
    "title": "crankingthehog.com",
    "meaning": "Masturbation, usually in a more aggressive manner.",
    "example": "Hey man, I was cranking the hog last night and my roommate almost walked in.",
    "id": "76zwvioj36",
    "available": "is available"
  },
  {
    "title": "comfermative.com",
    "meaning": "When you confirm the affirmative.",
    "example": "On the news tonight it was comfermative that the weather was hot.",
    "id": "w671ya17p6",
    "available": "is for sale"
  },
  {
    "title": "downtight.com",
    "meaning": "Opposite of uptight; laid back; chill",
    "example": "I hate hanging with snobs. I'm to downtight.",
    "id": "kmg4lcw8lm",
    "available": "is taken"
  },
  {
    "title": "breitbastard.com",
    "meaning": "Unapologetic un-PC alpha male conservative fan of Breitbart news",
    "example": "I hate Sean. He voted for Trump. Fucking Breitbastard",
    "id": "9047oa8wj0",
    "available": "is available"
  },
  {
    "title": "selfiecide.com",
    "meaning": "When a person dies while trying to take a selfie from a dangerous position or area.",
    "example": "This man committed selfiecide while trying to take a selfie hanging off the side of a high-rise building, and fell to his death.",
    "id": "40994hpxq0",
    "available": "is for sale"
  },
  {
    "title": "jizzneyland.com",
    "meaning": "When a city or town specifically zones an area for \"adult\" businesses.",
    "example": "Troy, NY resident: Did you know that the City Council voted on the \"Jizzneyland\" zone last night? I'm not sure if 70 acres near a residential neighborhood is going to be enough.",
    "id": "y6r2ds15k0",
    "available": "is taken"
  },
  {
    "title": "trumpbasket.com",
    "meaning": "A toilet bowl.",
    "example": "-I drank way too much last night and ended up spending my night at the trump basket.\r-The trump basket is clogged; whoever used it last needs to plunge it.",
    "id": "z65jwfyeg0",
    "available": "is for sale"
  },
  {
    "title": "wealthcare.com",
    "meaning": "Excellent health care reserved exclusively for the wealthy.",
    "example": "America has a wealth care system.",
    "id": "q6dr3u8rd0",
    "available": "is taken"
  },
  {
    "title": "howstheweatherupthere.com",
    "meaning": "A dick thing you say to a tall person to piss them off.",
    "example": "Person 1 \"Hows the weather up there?\"\rPerson 2 \"Fuck you.\"",
    "id": "90k32tej86",
    "available": "is taken"
  },
  {
    "title": "ratfucker.com",
    "meaning": "The insane, narcissistic, outrageous asshat who ratfucked his way into the Whitehouse with Russian hacking, slanderous lies from FBI director James Comey, and the archaic, undemocratic, and fucked Electoral College. Ratfucker is now working tirelessly (minus weekly vacations to Florida) to finish dismantling american society, enact authoritarian rule, destroy the environment, and destabilized global relations. You’ve been ratfucked.",
    "example": "Ratfucker stays up long into the night composing insane and nonsensical tweets for the braindead lemmings who support him to read and praise.",
    "id": "y6n3qcgz8m",
    "available": "is for sale"
  },
  {
    "title": "fromthegiddyup.com",
    "meaning": "From the beginning.",
    "example": "You should have told me you don't like men from the giddy up and I wouldn't have wasted my time taking you out.",
    "id": "ome4ytgx96",
    "available": "is available"
  },
  {
    "title": "trumpcare.com",
    "meaning": "Government healthcare program thought up by a group of rich white men posing as politicians that will provide you with enough coverage for a band-aid. Unless of course you are one of the rich.",
    "example": "I went to the E.R. with a severed finger. Having Trumpcare , they reattached it with a band-aid...thankfully I can sew!",
    "id": "zmjwzagj80",
    "available": "is taken"
  },
  {
    "title": "presidentialcombover.com",
    "meaning": "When the president deals with a problem by sweeping it under the rug.",
    "example": "Trump is dealing with the problem of his ties to Russia by giving it a presidential comb over.",
    "id": "4m3z2bqxe6",
    "available": "is available"
  },
  {
    "title": "spankbankoverdraft.com",
    "meaning": "When you masterbate so much your spank bank is now into overdraft",
    "example": "Hey dude you making a withdrawal from the spank bank tonight ,bro I tug it so much I'm into spank bank overdraft",
    "id": "90xophqyl0",
    "available": "is available"
  },
  {
    "title": "shamrockd.com",
    "meaning": "(Noun) Getting drunk on St. Patrick's Day",
    "example": "Bro I got so Shamrock'd last night at this girls St. Patty's party.",
    "id": "26l1vc93qm",
    "available": "is taken"
  },
  {
    "title": "manonmansplaining.com",
    "meaning": "The act of explaining man on man sexual intercourse to another person.",
    "example": "Steve's manonmansplaining is making Kyle uncomfortable, and he's probably going to leave soon.",
    "id": "q68jof58p0",
    "available": "is available"
  },
  {
    "title": "luckysock.com",
    "meaning": "What most teenage boys use to masturbate",
    "example": "I just got done using my lucky sock, now ill use it again.",
    "id": "46plouyd90",
    "available": "is taken"
  },
  {
    "title": "chunion.com",
    "meaning": "A form of armpit odour that resembles a combination of cheese and onion. Usually experienced after hard work or a hot day.",
    "example": "\"Babe I was doing chinups at the gym and the guy next to me copped a face full of chunion\"",
    "id": "8mvnoclon0",
    "available": "is taken"
  },
  {
    "title": "cornpuck.com",
    "meaning": "A hard round constipating turd. Induced by too much starch and not enough fiber in the diet.",
    "example": "I'll be back. I may be a while. I gotta work out a corn puck. Good luck. I had one the other day. Tore my ass up working that thing out.",
    "id": "7moe7u41n6",
    "available": "is taken"
  },
  {
    "title": "strandupcomedy.com",
    "meaning": "The way one's hair can look first thing in the morning, sticking straight up in all directions.",
    "example": "When Bob woke up this morning, his hair looked like a strand-up comedy.",
    "id": "w61elf1wrm",
    "available": "is available"
  },
  {
    "title": "highwear.com",
    "meaning": "N. The sunglasses you put on when your eyes are displaying the effects of marijuana.",
    "example": "I see Adam's got his highwear on to go meet his girlfriend's parents.",
    "id": "20wn9iwgz0",
    "available": "is for sale"
  },
  {
    "title": "fakenews.com",
    "meaning": "A term formerly useful for describing websites consisting entirely of intentionally fabricated news stories, but now used to describe virtually anything that does not mesh with one's own views.",
    "example": "Actual real-world examples of how \"fake news\" has been used:\r\"Fake news that's being released by some foreign government\"\r\"Fake news was able to spread so easily from sources like InfoWars and Breitbart and TheBlaze\"\r\"the Rolling Stone, which did so much to damage the reputation of journalism with their fake news\"\r\"the New York Times IS fake news\"\r\"Kellyanne Conway is fake news\"\r\"fake news from the CIA\"\r\"the fake news phenomenon is spreading to children's toys\"\rSource: Vice article entitled \"Watch 'fake news' become a meaningless phrase",
    "id": "k6q99c87lm",
    "available": "is for sale"
  },
  {
    "title": "nmh.com",
    "meaning": "NMH stand for Nodding My Head as a direct opposite of the popular abbreviation SMH, Shaking My Head.\rNMH is often used to express approval or joy.",
    "example": "Chloe: hey! do you want to come over next weekend?\rEric: nmh! ofc!Eric: hey, you think this sweater looks okay?\rChloe: nmh",
    "id": "36yyginow6",
    "available": "is for sale"
  },
  {
    "title": "hatersteak.com",
    "meaning": "Something you feed haters, has to be juicy lies that will get them to bite",
    "example": "My haters where getting hungry so I fed them some hater steak!",
    "id": "v02xzajqn6",
    "available": "is for sale"
  },
  {
    "title": "realitychallenged.com",
    "meaning": "(adj.) being in a state in which one is utterly and completely unable to distinguish fact from fiction, and is thus obviously and undeniably full of shit.",
    "example": "Most politicians are reality challenged. So are a number of attorneys, as well as most people living in Hollywood.\r\rTo use it in a sentence: \"That guy is SO reality challenged... that he can't even tell shit from Shinola!\"\r",
    "id": "76z2vtoj36",
    "available": "is taken"
  },
  {
    "title": "donaldtrumptie.com",
    "meaning": "Donald Trump ties are cheap, poorly-made rags that are sold a discount and second-hand stores. People wearing these ties are those who wish they had more in their wallet than just lint. Generally, tie-wearers are wanna-bes who are looking for some attention and something to brag about. In reality, they are just embarassing themselves and all other other tie-wearers around the world.",
    "example": "Hey man! Check out my Donald Trump tie!\rFuck you, I wipe my ass with those Donald Trump ties.",
    "id": "w679yh17p0",
    "available": "is available"
  },
  {
    "title": "crumplesack.com",
    "meaning": "An individual who performs less than satisfactorily to the chagrin and sometimes amusement of his or her associates, crew, or squadron.",
    "example": "The preflight crew forgot to leave water bottles on the jet for us? What a bunch of crumplesacks!",
    "id": "kmgqlbw8l0",
    "available": "is for sale"
  },
  {
    "title": "daymare.com",
    "meaning": "A vivid, unpleasant mental image (as in a nightmare) conjured in broad daylight, such as an impending crash, or a thought of a loved one in distress, which can cause a strong emotional response such as fear or horror.",
    "example": "Scott still isn't home from the game, and I'm having such a daymare! I know he's stretched out on the pavement somewhere.",
    "id": "904dof8wj0",
    "available": "is for sale"
  },
  {
    "title": "bannonite.com",
    "meaning": "Noun. Disciples of the dark lord Steve Bannon.",
    "example": "And Lo, I stood upon the mound and witnessed below the Bannonites in worship of their deity. At his left stood a Lustful, Orange Demon inscribed upon its forehead the name, BIGLY.",
    "id": "409l4hpxq0",
    "available": "is taken"
  },
  {
    "title": "trashdove.com",
    "meaning": "One of the shittest and most annoying things on the internet. First seen in january, 2016. In february, 2017, it went viral, and began to invade all over the internet. You can see at least one comment with this bird in facebook pages. There are numerous pages and groups created about this. Also there are millions of protesters around the world.",
    "example": "Dumbass: *Puts trash dove sticker*\rMe: Goddamn it enough with this trash dove bullshit! Go fuck yourselves!",
    "id": "y6r9dt15k6",
    "available": "is taken"
  },
  {
    "title": "nametake.com",
    "meaning": "The reverse of namesake; a person you are named after.",
    "example": "The monk Martin Luther was the nametake of Dr. King.",
    "id": "z651wsyeg0",
    "available": "is taken"
  },
  {
    "title": "musicalmasturbation.com",
    "meaning": "A plague of many modern electric guitarists. Long and excessive solo on the guitar or other instrument, to show technical superiority rather than compositional and songwriting skills.",
    "example": "Dream Theater are kings of musical masturbation",
    "id": "q6dg3i8rd6",
    "available": "is available"
  },
  {
    "title": "bureauclast.com",
    "meaning": "(noun): Someone appointed to help destroy or dismantle the agency for which he or she ostensibly works.",
    "example": "All indications point to Scott Pruitt being a bureauclast hired specifically to dismember the Environmental Protection Agency.",
    "id": "90kl2tej86",
    "available": "is taken"
  },
  {
    "title": "dildocio.com",
    "meaning": "The talk, actions, or behavior of dildos",
    "example": "This feat of dildocio is worthy of The Donaldo.Oh, the dildacity!",
    "id": "y6nlqcgz8m",
    "available": "is for sale"
  },
  {
    "title": "ildonald.com",
    "meaning": "\"The Donald\" in Italian, to draw a parallel between him and Il Duce (Mussolini), the fascist leader of Italy.",
    "example": "Il Donald isn't making America great again, but he sure is making it into early-20th-century Europe.",
    "id": "ome3ysgx90",
    "available": "is available"
  },
  {
    "title": "tallgrey.com",
    "meaning": "Extraterrestrial. A weird person. Someone who is being awkward or weird.",
    "example": "Stop being such a tall grey.Try not to be a tall grey tonight and have fun.Eww he's being such a tall grey.",
    "id": "zmjoztgj86",
    "available": "is taken"
  },
  {
    "title": "fuckfacevonclownstick.com",
    "meaning": "Donald Trump's birth-name.",
    "example": "\"Hey dude, did you hear Donald Trump's birthname?\" \"No, what is it?\" \"Fuckface von Clownstick.\"",
    "id": "4m332cqxem",
    "available": "is taken"
  },
  {
    "title": "altreich.com",
    "meaning": "Alt-Reich: An Intentional play on the word \"Altreich\". which is an actual German word meaning Old Empire and can refer to Germany's pre-WWI territories or even it's territories as the Holy Roman Empire, i.e. the countries Hitler tried to take back.",
    "example": "The Alt-Right's current message and tone very much resembles Hitler's infamous 3rd Reich, and thus in slang terms could be called the \"Alt-Reich\".",
    "id": "90xnpfqylm",
    "available": "is for sale"
  },
  {
    "title": "trumped.com",
    "meaning": "To be fired.",
    "example": "Did you hear that Donald Trump got Trumped by NBC, Macy's, and other major corporations because Mr. Trump is a racist.",
    "id": "26llva93q6",
    "available": "is taken"
  },
  {
    "title": "trumpflakes.com",
    "meaning": "Trumpflakes are people that blindly defend Donald Trump, no matter insane or bat-shit crazy the case may be. They are basically flakes that defend Donald Trump by calling everyone 'snowflakes'.",
    "example": "In a press conference, Donald Trump said that there were maybe a million, million and a half people at his Inauguration (an obvious lie).Trumpflakes immediately defended their (mostly, kind of, a little) fearless leader.",
    "id": "q68xoi58pm",
    "available": "is taken"
  },
  {
    "title": "devosdit.com",
    "meaning": "When you completely blow a job interview and still wind up getting the job.",
    "example": "Hey man how did your job interview go? Dude I totally DeVos'd It but somehow they still offered me the job!",
    "id": "46p3ohyd90",
    "available": "is taken"
  },
  {
    "title": "treasonish.com",
    "meaning": "The unpunished crime of betraying one's country through espionage and alternative facts.",
    "example": "Will Donald Trump & Michael Flynn be rightfully tried for treason or was their collusion with Russia simply treasonish?",
    "id": "8mv2oslon0",
    "available": "is taken"
  },
  {
    "title": "nixondout.com",
    "meaning": "When a person or persons quits or leaves an organization or position before the said person is canned.",
    "example": "\"Hey Joe, wasn't Nixon impeached?\"\r\"No, he resigned before he could have been impeached\"\r\"Told ya he Nixon'd out of there!!\"",
    "id": "7mo87a41n6",
    "available": "is available"
  },
  {
    "title": "flynncinerate.com",
    "meaning": "To torch a good job by accidentally engaging in treasonous acts.",
    "example": "I accidentally tucked a list of all CIA operatives into the garter of a stripper at a Russian Embassy party last night and totally Flynncinerated my career.",
    "id": "w613ls1wr0",
    "available": "is available"
  },
  {
    "title": "trumpshake.com",
    "meaning": "When a handshake between two persons goes past the extra time—it can last up to twenty-odd seconds.",
    "example": "President Trump and Japanese Prime Minister Abe had a trumpshake at the White House—did the \"epic handshake\" set a new record in diplomatic circles?",
    "id": "20wz9bwgz0",
    "available": "is taken"
  },
  {
    "title": "flynndrunk.com",
    "meaning": "getting unbeleivably hammered. may involve loss of memory and balance.",
    "example": "oh fuck. i was soo flynn drunk last night",
    "id": "k6q89t87l6",
    "available": "is available"
  },
  {
    "title": "scrotus.com",
    "meaning": "Acronym for So-Called Ruler of the United States, as in POTUS, President of the United States.",
    "example": "SCROTUS today said, \"See you in court.\"",
    "id": "36yggcnow6",
    "available": "is taken"
  },
  {
    "title": "authoritarian.com",
    "meaning": "In a political context - In favor of large, intrusive government that violates or suppresses individual rights; characterized by a \"law and order\" approach; failing to support civil liberties and/or economic freedom in society; undemocraticIn a non-political context - Bossy, controlling, domineering",
    "example": "People with authoritarian views, agendas, or personalities rarely describe themselves as authoritarian, but can often be spotted when they try to rationalize some government control as being necessary \"for national security\", \"for public safety\", \"for the children\", or \"for your own good\".The longer Senator Bullwrap stayed in office, the more authoritarian he became.",
    "id": "v023zfjqn6",
    "available": "is taken"
  },
  {
    "title": "spicer.com",
    "meaning": "An outrageous lie.",
    "example": "That guy told a real Spicer!",
    "id": "76z4vuoj30",
    "available": "is taken"
  },
  {
    "title": "shitgibbon.com",
    "meaning": "A toad who thinks he is a prince, devoid of any self awareness as to what an asshole he looks like to everyone around him. Possibly a narcissist slash racist slash spoiled rich kid all grown up.",
    "example": "Man I'm so embarrassed by our shit gibbon of a president .",
    "id": "w67gyi17p6",
    "available": "is taken"
  },
  {
    "title": "easyd.com",
    "meaning": "Effortlessly obtained dick.",
    "example": "\"That guy Matt is so desperate to get with me, it's easy D.\"",
    "id": "kmgglhw8lm",
    "available": "is taken"
  },
  {
    "title": "potus.com",
    "meaning": "Piece Of Totally Useless Shit",
    "example": "Boy, The Donald really is a POTUS",
    "id": "9042oi8wj6",
    "available": "is for sale"
  },
  {
    "title": "bitchchin.com",
    "meaning": "A person's chin which lacks definition or strength of character.",
    "example": "Guy: Hey Donald Trump, all of your children have bitch chins\rDonald: Ya they do, and my son is a total pussy too",
    "id": "409y4bpxq6",
    "available": "is available"
  },
  {
    "title": "trumpian.com",
    "meaning": "adj: describes an action or person that is motivated by arrogance, self-agrandizement, and without concern for fact, consequence or responsibilty.",
    "example": "The CEO's trumpian policies have driven both his customer base and employees to their competition, SAD!The Teacher's punative actions towards the students she failed to adequatly teach are trumpian of a nature, PATHETIC!",
    "id": "y6rrda15k6",
    "available": "is taken"
  },
  {
    "title": "bowlinggreenmassacre.com",
    "meaning": "One of the worst terrorist attacks that never happened.",
    "example": "I will never forget where I wasn't during the Bowling Green Massacre.",
    "id": "z65zwsyeg6",
    "available": "is taken"
  },
  {
    "title": "lorddampnut.com",
    "meaning": "An anagram or \"alternative name\" for the worst president in the history of the USA. Coined by Colin Mochrie (of Whose Line is it Anyway fame) on 20 January 2017.",
    "example": "Did you read the latest tweet from Lord Dampnut?",
    "id": "q6d23s8rdm",
    "available": "is for sale"
  },
  {
    "title": "cashmeoutsidehowbowdah.com",
    "meaning": "On an episode of Dr. Phil, a \"difficult\" teenage daughter, addresses the crowd using the phrase, \"Cash me outside dah.\"Basically, it means, come talk to me outside so that we can sort out our issues and potentially get into a physical fight.",
    "example": "Person 1: \"Bitch, you're so ugly.\"Person 2: \"Me? Ugly? Cash me outside howbow dah?\"",
    "id": "90kn2iej80",
    "available": "is taken"
  },
  {
    "title": "yankshake.com",
    "meaning": "The seemingly friendly yank of someone's arm in an authoritative handshake truly designed to be vigorous, demeaning and disrespectful.",
    "example": "John Boehner YANKS President Barack Obama in a handshake pull after #SOTU youtu.be/hgZdNL2kEbU #yankshake",
    "id": "y6nnqhgz86",
    "available": "is taken"
  },
  {
    "title": "trumponomics.com",
    "meaning": "An economic system where corporations and billionaires get huge tax breaks and refunds the rest of us get chump change.",
    "example": "OG: Why is my big tax refund less than the cost of a meal as Micky D's?G: That's Trumponomics for ya.",
    "id": "omezyfgx9m",
    "available": "is for sale"
  },
  {
    "title": "trumpjumped.com",
    "meaning": "Cost of goods paid by consumers after tariff cost increases.",
    "example": "This bumper jack has been Trump Jumped from $49 bucks to almost $60.\rThis is an ass ripping $10 dollar trump jump.",
    "id": "zmjnzbgj80",
    "available": "is taken"
  },
  {
    "title": "twitler.com",
    "meaning": "A fascist twit who overuses their Twitter, and uses it for attention and to indoctrinate the foolish. Synomous with The Orange Snowflake, a.k.a Orange Mussolini, a.ka. Orange Faced Shit-gibbon, a.k.a Donald J. Trump.",
    "example": "\"I wish POTUS Trump would stop tweeting already, he's not a winner no matter how many times he says it, man's a real twitler.\"",
    "id": "4m3y2aqxe0",
    "available": "is taken"
  },
  {
    "title": "immigrant.com",
    "meaning": "What every inhabitant of the USA is, except the Native Americans. ",
    "example": "A: Dude, I fuckin hate them immigrants!\rB: Well whaddaya think your great great great grand father was?",
    "id": "90x7psqyl6",
    "available": "is taken"
  },
  {
    "title": "kakistocracy.com",
    "meaning": "n. Government by the least qualified or most unprincipled people.",
    "example": "Since it takes the worst type of person to become a successful politician, all democracies will eventually become kakistocracies.",
    "id": "26l8vs93q0",
    "available": "is for sale"
  },
  {
    "title": "donaldlump.com",
    "meaning": "basically donald trump, bc he's a big 'ol white lump of overcomb + cheeto dust skin",
    "example": "dang, did you see donald lump in the news today? he was looking extra orange and lumpy.",
    "id": "q684oc58p0",
    "available": "is for sale"
  },
  {
    "title": "trumpcare.com",
    "meaning": "a new healthcare insurance system where you automatically lose your health coverage if you are sick or poor.",
    "example": "I went to the emergency room after the accident, they said, \"we can't help you, you've got trumpcare.\"",
    "id": "46p1ouyd96",
    "available": "is taken"
  },
  {
    "title": "trumptreatment.com",
    "meaning": "When you go to a foreign country, order a presidential suite, and get videotaped watching two prostitutes pee on each other.",
    "example": "Guy 1: Dude when I went to Brazil, I totally got the Trump treatment!\rGuy 2: Classic Trump treatment!",
    "id": "8mvdohlonm",
    "available": "is for sale"
  },
  {
    "title": "tyrannosaurusrump.com",
    "meaning": "T.rump is a tyrant lizard with small hands and an even smaller brain",
    "example": "Fossil evidence suggests that Tyrannosaurus rump used its ridiculously tiny hands to grab pussies",
    "id": "7mo57c41n6",
    "available": "is for sale"
  },
  {
    "title": "alternativefacts.com",
    "meaning": "The worst of the four classifications of lies: lies, damned lies, statistics, alternative facts. Alternative facts are distinguished from the other damnable lies by the addition of gaslighting the listener.",
    "example": "After backing up her false statements with alternative facts, Kellyanne Conway threatened the \"dishonest\" media for suggesting that she might be lying.",
    "id": "w612lu1wrm",
    "available": "is for sale"
  },
  {
    "title": "hotdonald.com",
    "meaning": "A large, fresh dump.",
    "example": "Do you mind if I use your restroom? I'm about to have a Hot Donald.",
    "id": "20wo9awgz6",
    "available": "is available"
  },
  {
    "title": "trumpsrazor.com",
    "meaning": "\"The Stupidest explanation is always the right one\"",
    "example": "Guy1: \"Did you hear that Trump said Chinese Bee's cause Global Warming?\"Guy2: \"Chalk another one up to Trump's Razor\"",
    "id": "k6q19b87l0",
    "available": "is taken"
  },
  {
    "title": "smallhands.com",
    "meaning": "A male physical attribute with implications of having a small cock. ",
    "example": "\"Yo Rich, what up wit yo small hands?\" ",
    "id": "36yqganowm",
    "available": "is taken"
  },
  {
    "title": "bullmotherfuckingshit.com",
    "meaning": "The response for when someone is telling huge porkies.",
    "example": "Tony: I always clean up after myself.Sharon: Bull mother fucking shit.",
    "id": "v02zzbjqn0",
    "available": "is available"
  },
  {
    "title": "jokeinsurance.com",
    "meaning": "When two mates have a mutual understanding to laugh at each others jokes, no matter how lame or awkward said joke is, therefore lessening the social failure of the bad joke.",
    "example": "I was talking to some girls the other day when I cracked a 'your mother' joke. Luckily, I had joke insurance with Chris so I still ended up getting both their numbers. All Chris got was a weird look for his over-the-top laugh.",
    "id": "76zdvfoj30",
    "available": "is for sale"
  },
  {
    "title": "justplacingitoutthere.com",
    "meaning": "Similar to the phrase \"just putting that out there\", but it is usually said more as suggestion, particularly when the person saying it lacks confidence that his answer or solution is correct.",
    "example": "Just placing it out there, but we should go bowling tonight.Just placing it out there, but I think Rachel likes you.",
    "id": "w67qyt17pm",
    "available": "is available"
  },
  {
    "title": "goodgerman.com",
    "meaning": "A citizen of Nazi Germany who participated in or overlooked atrocities while denying personal moral responsibility by appeal to his submission to supposedly legitimate authority.",
    "example": "The American CIA agents who relied on the White House legal justification of torture were nothing more than Good Germans.",
    "id": "kmg8ltw8l0",
    "available": "is taken"
  },
  {
    "title": "orangeface.com",
    "meaning": "a nick name for Donald J Trump (during and after the 2016 Presidential election)",
    "example": "We have been keeping our mouths shut for the entire past year in front of our relatives and that is how the orange face got elected.",
    "id": "904gof8wj0",
    "available": "is taken"
  },
  {
    "title": "bananarepublican.com",
    "meaning": "The term \"banana republic\" refers to a country dominated by corporate interests, in which income disparity between rich and poor is extremely high, to the point that the middle class has just about disappeared, and aside from the fantastically wealthy few, practically everyone is dirt poor.A Banana Republican is a Republican who wants to lower taxes for the rich, leading to increased income disparity and bringing the USA closer to banana republic status.",
    "example": "The GOP is full of Banana Republicans these days.",
    "id": "40954upxqm",
    "available": "is for sale"
  },
  {
    "title": "restingdoucheface.com",
    "meaning": "similar to the resting bitch face. when a guy just looks like an asshole but hes actually a nice guy with a face of a complete doucher",
    "example": "Naw dude Aidan's chill, he just has a resting douche face.",
    "id": "y6rldt15k6",
    "available": "is available"
  },
  {
    "title": "watersports.com",
    "meaning": "In BDSM terminology, refers to sensual or erotic play involving bodily fluids, typically urine, saliva, and less commonly, blood.  Considered 'edge-play', because it is obviously somewhat unhygenic.",
    "example": "Most of the Mistresses that he found online were willing to do watersports, but not scat.",
    "id": "z654wbyeg0",
    "available": "is taken"
  },
  {
    "title": "goldenshower.com",
    "meaning": "n. The act of urinating on someone for sexual pleasure.",
    "example": "e.g. \"Last night, my girlfriend got a little kinky, and gave me a golden shower.\"",
    "id": "q6dp3b8rd6",
    "available": "is taken"
  },
  {
    "title": "etm.com",
    "meaning": "Latin abbreviation for the literal translation of \"and shit\", specifically, \"et merda\". Just like \"etc.\" (and so forth), \"i.e.\" (that is), and \"e.g.\" (for example), \"etm.\" can be used to abbreviate \"and shit\".",
    "example": "At the farmer's market I got tomatoes, cucumbers, radishes, etm.I was just taking care of bills etm. before he came over.",
    "id": "90ko2tej86",
    "available": "is taken"
  },
  {
    "title": "bootsontheground.com",
    "meaning": "Military phrase meaning troops in place. Slang usage is when you are referring to going somewhere or being somewhere or someplace.",
    "example": "We got boots on the ground at Fat Mo's but we are heading to Sam's for a cold beer and pizza.",
    "id": "y6nequgz86",
    "available": "is taken"
  },
  {
    "title": "youfuckonegoat.com",
    "meaning": "This expression dates as far back as man has been stuffing his junk into farm animals. You fuck one goat. Meaning there are some things we do that we must carry with us, no matter the good deeds you do or the people who love you, this can all be overshadowed by one horrific deed.",
    "example": "An old farmer walking through his field with his grandson.Old farmer- \"Billy, you see that fence there? Your father and I built that fence with our own two hands.Billy-''Yeah... That's great grandpa.Old farmer- \"And that barn Billy, do you see that barn? My father and I built that barn long ago together. And these fields Billy...Billy- uh huh, didnt you fuck some goats once though?Old farmer- \"it was one goat! Geez you fuck one goat...",
    "id": "ome8ysgx9m",
    "available": "is available"
  },
  {
    "title": "tweetplomacy.com",
    "meaning": "Noun. Using social media sites such as Twitter to manage foreign relations and conduct diplomatic discussions publicly.",
    "example": "The new President's tweetplomacy may be transparent domestically, but it could also ruffle feathers abroad.",
    "id": "zmjkzbgj80",
    "available": "is for sale"
  },
  {
    "title": "trumpit.com",
    "meaning": "Pull a fact out of your ass.",
    "example": "So, did you actually research those assumptions, or did you trump it?",
    "id": "4m372iqxe0",
    "available": "is taken"
  },
  {
    "title": "stealthcall.com",
    "meaning": "When you have to call someone back but don't want to talk to them, so you wait until you know they can't talk and leave a voice mail.",
    "example": "\"I don't want to tell Karen I can't make it tonight, so I'll Stealth-call her when she's on her flight and has her phone shut off.\"",
    "id": "90xwpaqylm",
    "available": "is for sale"
  },
  {
    "title": "gatemassage.com",
    "meaning": "A TSA pat-down with a \"happy landing.\"",
    "example": "I got a gate massage at the airport today. I feel great!",
    "id": "26lkvc93q0",
    "available": "is available"
  },
  {
    "title": "earslowered.com",
    "meaning": "A slang term for a hair cut.",
    "example": "I got my ears lowered over the weekend.",
    "id": "q685oi58p6",
    "available": "is available"
  },
  {
    "title": "voluntold.com",
    "meaning": "voluntold:  The exact opposite of volunteering.  Always used in reference to an unpleasant task to which you have been assigned by your boss.\r",
    "example": "Example 1:\r\rCo-worker 1:  I hear you got a transfer.\rCo-worker 2:  Yeah.  I didn't want to, but I was voluntold.\r\rExample 2:\r\rCo-worker 1:  You want to go fishing Saturday???\rCo-worker 2:  I can't, I got voluntold I have to work this weekend.\r ",
    "id": "46pwotyd9m",
    "available": "is taken"
  },
  {
    "title": "cellfish.com",
    "meaning": "An individual who talks on his or her cell phone even when doing so is rude or inconsiderate of other people.",
    "example": "\"Can't you stop talking on the phone while ordering your happy meal -- that's cellfish\"",
    "id": "8mvwoclon0",
    "available": "is taken"
  },
  {
    "title": "feelingbrexit.com",
    "meaning": "When you make a decision you instantly regret.",
    "example": "I voted for Trump because I thought he would be the greatest leader ever, I'm feeling brexit.",
    "id": "7mow7u41n6",
    "available": "is available"
  },
  {
    "title": "unpresidented.com",
    "meaning": "AdjectiveA self-coined malapropism and Freudian slip by the Short-fingered Vulgarian/President-elect as he attempted to conduct sensitive US-Chinese diplomacy with a very-classy, bigly-nuanced tweet.",
    "example": "\"China steals United States Navy research drone in international waters – rips it out of water and takes it to China in unpresidented act.\"\r-Donald (Drumpf) Trump\rPresident-elect of the US and Effing Moron",
    "id": "w61plc1wr6",
    "available": "is taken"
  },
  {
    "title": "rectoralcollege.com",
    "meaning": "Body of assholes who assemble every four years to confirm chief executive asshole.",
    "example": "The rectoral college was totally wiped out after a marathon session.",
    "id": "20wp9uwgzm",
    "available": "is for sale"
  },
  {
    "title": "youdonefuckedup.com",
    "meaning": "To mess up extremely past the point of no return.",
    "example": "Man: *doing his woman* Oh! Mary!\rWoman: MARY!? WHO'S MARY!\rMan: Shit.....\rWoman: Oh You done fucked up now!!",
    "id": "k6qw9h87l6",
    "available": "is for sale"
  },
  {
    "title": "sailboatfuel.com",
    "meaning": "If you own a sailboat, it's the wind in your sails.",
    "example": "Yea were gonna head out today, hurricane Wendy left us with plenty of sailboat fuel.",
    "id": "36ypginow6",
    "available": "is taken"
  },
  {
    "title": "doctorbating.com",
    "meaning": "When your experience level in masturbating has reached the pinnacle of the field and have been established as an expert in the field.",
    "example": "My girlfriend caught me doctorbating and was impressed with my level of skill achieved.",
    "id": "v02pzhjqnm",
    "available": "is for sale"
  },
  {
    "title": "trumpitantrum.com",
    "meaning": "Extreme over reaction to personal criticism.",
    "example": "Calm down, stop throwing a Trumpitantrum. All Becky said was your hair looked weird.",
    "id": "20wppawgzm",
    "available": "is available"
  },
  {
    "title": "beatittillitscold.com",
    "meaning": "When you masturbate so long in the shower that the water turns cold",
    "example": "- Did u finish yet?\r- Now I am, I like to beat it till it's cold",
    "id": "k6qwgt87l6",
    "available": "is available"
  },
  {
    "title": "trumpstump.com",
    "meaning": "A small penis surrounded by a ridiculous plumage of pubic hair.",
    "example": "Lady1: How was last night?\rLady2: Terrible, he had a Trump Stump",
    "id": "36yp1snow6",
    "available": "is taken"
  },
  {
    "title": "onedayflu.com",
    "meaning": "Excuse to miss school for an event.",
    "example": "Man mom i have the one day flu.",
    "id": "v02potjqnm",
    "available": "is taken"
  },
  {
    "title": "takeatrump.com",
    "meaning": "Taking an incredibly toxic dump.",
    "example": "Omg, where is the next bathroom? I have to take a Trump!",
    "id": "76zvkioj30",
    "available": "is for sale"
  },
  {
    "title": "trumpten.com",
    "meaning": "The weight gained when Donald Trump was elected President Of The United States",
    "example": "When we heard the election result, my mother gained the Trump Ten as a result of overeating.",
    "id": "w678zt17pm",
    "available": "is taken"
  },
  {
    "title": "are.com",
    "meaning": "For people who don't know the word \"our\"",
    "example": "My friend and I heard Sugar Ray on the way to a party.  It made are night.",
    "id": "kmgyxfw8lm",
    "available": "is taken"
  },
  {
    "title": "blessitup.com",
    "meaning": "A term used to tell someone to pray before an event.",
    "example": "bless it up so we can eat.",
    "id": "904pni8wj0",
    "available": "is taken"
  },
  {
    "title": "santorum.com",
    "meaning": "The sometimes frothy, usually slimy, amalgam of lubricant, stray fecal matter, and ejaculate that leaks out of the receiving partner's anus after a session of anal intercourse. Named, by popular demand and usage, after legislator Rick Santorum because of his homophobic political statements.",
    "example": "\"That move was about as slick as santorum!\"",
    "id": "409dxbpxq6",
    "available": "is taken"
  },
  {
    "title": "laughterwards.com",
    "meaning": "A TV show, Film or situation that was not really funny or marginally funny that for whatever reason is much funnier aftwrwards.",
    "example": "You have to watch Portlandia, but it's a laughterwards, so just give it a chance to kick in.",
    "id": "y6rwys15k0",
    "available": "is taken"
  },
  {
    "title": "blessyourheart.com",
    "meaning": "The most Southern 'fuck you' there is. Can be put at the end of a phrase to nullify any cruelty.",
    "example": "That girl is the most fowl mouthed, idiotic, bitch there is, bless her heart.Oh you need to actually look this up? Bless your heart.",
    "id": "z65pvbyeg0",
    "available": "is taken"
  },
  {
    "title": "trumparoma.com",
    "meaning": "The smell that occurs when a swamp is drained and replaced with raw sewage and other kinds of stinking waste.",
    "example": "There's been a hell of a trumparoma around here since they drained that swamp and filled it with sewage.",
    "id": "q6d4xu8rd6",
    "available": "is available"
  },
  {
    "title": "notlongoutofbed.com",
    "meaning": "An expression used in North England meaning \"I'm so tired I'm going to have to go to bed soon\"",
    "example": "I'm knackered I'm not long out of bed",
    "id": "90kg8hej8m",
    "available": "is available"
  },
  {
    "title": "nuclearcumsplosion.com",
    "meaning": "When you ejaculate so hard it destroys everything in a two mile radius.",
    "example": "\"Dude, I had such good sex last night I made a nuclear cumsplosion.\"",
    "id": "y6nr5sgz8m",
    "available": "is available"
  },
  {
    "title": "babyinthecloset.com",
    "meaning": "When a woman is pregnant and is keeping it a secret.",
    "example": "Don't tell anybody, but I swear Elena's got a baby in the closet.",
    "id": "ome9eagx90",
    "available": "is taken"
  },
  {
    "title": "trumpchristian.com",
    "meaning": "A self-declared follower of the Christian faith and its principles of unconditional love, helping the less fortunate and renunciation of violence and worldly goods, who also rabidly supports President-elect Donald Trump, an unabashed narcissist, racist, misogynist, xenophobe and pussy grabbing real estate con-man of shiny, gaudy buildings.",
    "example": "Billy Bob: I can't wait until Trump kicks all them Mexican and refugee families out of our country. It'd be great if he waterboarded them on the way out.\rTrump Christian: Amen on that brother.",
    "id": "zmj74igj8m",
    "available": "is for sale"
  },
  {
    "title": "whojavu.com",
    "meaning": "Whoja vu is to people as Deja vu is to events.\rThat eerie feeling you've met someone before, even though you just met them for the first time",
    "example": "\"I swear, I've met him somewhere before, but there's no way I could have. . . \"\r\"huh. well then you're just having Whoja vu. go with it.\"",
    "id": "4m381uqxe6",
    "available": "is taken"
  },
  {
    "title": "trumpophobia.com",
    "meaning": "The fear of Donald Trump",
    "example": "I have trumpophobia",
    "id": "90xjviqyl6",
    "available": "is for sale"
  },
  {
    "title": "pentagonorrhea.com",
    "meaning": "disease earned through the chain of command in the US military, specifically, from a superior to a subordinate or a hired author",
    "example": "She was 'doing his biography', little did she know, it was not only cash paying, but pentagonorrhea was a bonus",
    "id": "26le2a93q0",
    "available": "is for sale"
  },
  {
    "title": "wankshelter.com",
    "meaning": "A safe haven which could be limited to a closet, toilet, single room or a complete house were a male organism is able to produce semen by hand without being disturbed.",
    "example": "Kim: Have you seen Dennis?Johan: I haven't seen him in ages\rOlaf: Dennis has locked himself in his wank shelter.",
    "id": "q6821t58p6",
    "available": "is available"
  },
  {
    "title": "trumpybutt.com",
    "meaning": "(n) Used to reference a dog's butt hole immediately prior to the dog having a bowel movement. Right before a dog has a bowel movement, their butt hole starts to expand and pucker, causing an uncanny resemblance to Donald Trump's mouth. The Trumpy Butt is a signal to the owner or dog walker that the dog is about to go. The state following Trumpy Butt is often referred to as \"Brown Eye.\"",
    "example": "Rover's been looking for a poop spot forever, but now he has Trumpy Butt so I know he's about to go.",
    "id": "46p7dsyd96",
    "available": "is taken"
  },
  {
    "title": "iheardyouusingthemicrowave.com",
    "meaning": "This means that somebody was too loud during sex the night before.'Microwave' refers to the coitus that was had.",
    "example": "Justine: Good morning, guys! How did you sleep?\rCarla: Not very well.\rJustine: why?\rCarla: I heard you using the microwave last night..\rJustine: Oh dear..'You're just jealous because you heard HER using the microwave but you can't handle that heat!'",
    "id": "8mvjnslonm",
    "available": "is available"
  },
  {
    "title": "folx.com",
    "meaning": "Folks.\r\rAs in, a group multiple people.",
    "example": "The fine folx at the corner diner shorted me my change.",
    "id": "7moz8t41n6",
    "available": "is taken"
  },
  {
    "title": "trumpuniversity.com",
    "meaning": "A fake, unaccredited school using Donald Trump's name that offers classes in real estate, management, negotiation, entrepreneurship, and wealth creation. They are another example of a diploma mill, like Walden University or Trinity Southern University. Their main source of advertising is from spam, which also include offers for pet medications, diet pills, software, loans, photo contests, and mortgage applications. ",
    "example": "Hey, I bet that diploma from Trump University is so gonna help you land that position as head fry-chef that you've always wanted.",
    "id": "w6182t1wrm",
    "available": "is for sale"
  },
  {
    "title": "callingdingo.com",
    "meaning": "used as a slang term to describe something with a conflict of interest, much like it would be a conflict of interest to hire a dingo to babysit your infant while you leave the house. In this situation the dingo has a contrast of interest and will most likely NOT do a good job babysitting your infant.This term was first used on the popular HBO show, last week tonight with John Oliver.",
    "example": "John Oliver: \"The CEO of a Payday lending company actually has is in charge of regulating the Payday lending industry!I am calling dingo on that!... I am calling dingo!\"",
    "id": "20wlpbwgz6",
    "available": "is taken"
  },
  {
    "title": "posttruth.com",
    "meaning": "relating to or denoting circumstances in which objective facts are less important in shaping public opinion than emotional or personal beliefs.",
    "example": "Post-truth relies solely on personal beliefs and ignores any facts that may conflict with those personal beliefs.",
    "id": "k6qggt87l0",
    "available": "is taken"
  },
  {
    "title": "panicdrink.com",
    "meaning": "The default drink one orders when unfamiliar with the drink options, or not ready to order.",
    "example": "Bartender: What can I get you?\rMe: Uhhh uhhhhh, vodka soda!\rFriend: You know they have craft cocktails here, right?\rMe: I dont know. It's my panic drink.",
    "id": "36yj1inow6",
    "available": "is taken"
  },
  {
    "title": "playedmyself.com",
    "meaning": "Screw things up for yourself.  Let yourself down.  Betray yourself by acting in a way that's opposite to your own interests or (conscious) intentions.",
    "example": "The Amy Winehouse song \"Tears dry on their owm\":\r\r\"Yeah, I played myself again, should just be my own best friend, not fuck myself in the head with stupid men\"",
    "id": "v028oujqn0",
    "available": "is available"
  },
  {
    "title": "manmansplaining.com",
    "meaning": "When a man mansplains what \"mansplaining\" means.",
    "example": "And, I was, like, O.M.G., you're totally manmansplaining the meaning of mansplaining to me.",
    "id": "76zjkaoj30",
    "available": "is available"
  },
  {
    "title": "emperorshand.com",
    "meaning": "A person who performs \"special tasks\" for Emperor Palpatine of the Galactic Empire. Mara Jade was a known Hand.",
    "example": "\"Palpatine is an unmarried man, right?\"\r\"Yeah, I'd hate to be one of the Emperor's Hands on a lonely night.\"",
    "id": "w67yzs17p6",
    "available": "is taken"
  },
  {
    "title": "kleptocracy.com",
    "meaning": "A corrupt governmental body made up of thieves, also sullied by nepotism and croneyism.",
    "example": "The county government is a perfect example of a kleptocracy",
    "id": "kmgextw8l0",
    "available": "is taken"
  },
  {
    "title": "tronalddump.com",
    "meaning": "A giant, unavoidable bowel movement whose aftermath can clear an entire house and leaves its shocked victims in a mood as foul as its odor.",
    "example": "The police did not need to confront the crowd with riot gear because the assembly quickly and peacefully dispersed after a protester took a steaming tronald dump on the Donald Trump sign, making any further presence in the vicinity too nauseating.",
    "id": "9048na8wj6",
    "available": "is for sale"
  },
  {
    "title": "trumpalingus.com",
    "meaning": "The act of grabbing a girl by the vagina",
    "example": "\"She was so hot when she lifted her skirt I couldn't help but do Trumpalingus\"",
    "id": "409zxcpxqm",
    "available": "is available"
  },
  {
    "title": "selfown.com",
    "meaning": "From the slang own: to own self.",
    "example": "As soon as Bill pushed the button, a hundred-ton weight fell from the sky and hit him on the head. \"Ha! Bill got self-owned!\" said Joe.",
    "id": "y6r4ya15km",
    "available": "is taken"
  },
  {
    "title": "feeling.com",
    "meaning": "When everything that can go wrong , goes wrong.",
    "example": "Boss : Where is the financial report Lisa ?\rLisa : I'm feeling 2016 today.Leave me alone.Boss : I'm sorry. Take the rest of the day off if you want Lisa.",
    "id": "z658vtyeg6",
    "available": "is taken"
  },
  {
    "title": "posttrumpstressdisorder.com",
    "meaning": "A feeling typically associated with dread,night terrors and flashbacks from the presidential election results.",
    "example": "Me: I can't come into work today.\rBoss:Why?\rMe: I'm dealing with Post-Trump Stress Disorder.\rBoss: Understood",
    "id": "q6dexh8rdm",
    "available": "is taken"
  },
  {
    "title": "pullinganamerica.com",
    "meaning": "Doing something very stupid, like when America voted for Trump to be the president.",
    "example": "Dude you are pulling an America, why would going down that halfpipe on skis be a good idea?",
    "id": "90ke8aej80",
    "available": "is for sale"
  },
  {
    "title": "trumpence.com",
    "meaning": "The punishment or fate a society deserves to receive.",
    "example": "The American people received their trumpence when they decided hate and ignorance was more affective and important than love and understanding.",
    "id": "y6n25tgz86",
    "available": "is for sale"
  },
  {
    "title": "electionhangover.com",
    "meaning": "The feeling you have the day after an election, because you stayed up late trying to find out the results.",
    "example": "Trevor: I have so much work to do, but I have an election hangover and can't get anything done!",
    "id": "omewesgx9m",
    "available": "is for sale"
  },
  {
    "title": "beerboarding.com",
    "meaning": "A controversial process of extracting otherwise-secret information from a friend or co-worker by getting them drunk and thereby loosening their control on their tongue. ",
    "example": "The guys at work took me out drinking last night.  After quite a few beers and a lot of questions I finally let slip that I was going to be a father.  What can I say?  Beerboarding should be against the law. ",
    "id": "zmje4tgj80",
    "available": "is taken"
  },
  {
    "title": "phlochte.com",
    "meaning": "Term coined for the Bromance between Olympic swimmers Ryan Lochte and Michael Phelps. ",
    "example": "\"Olympic swimmers Ryan Lochte and Michael Phelps have their own bromance of sorts. Sports casters (Lochte and Phelps included) often refer to their friendship as a \"relationship.\" Lochte is said to be the only man Phelps will take his headphones in the ready room off for and many people around Phelps maintain that, \"Lochte is the best thing that's ever happened to Phelps\".8 They keep in touch with daily text messages and phone calls and were featured on the cover of Mens Journal together as a precursor to the 2008 Beijing Summer Games. 9 Though they share a strong rivalry in the pool, the two have become great friends outside of it. Phelps, in his latest book, refers to Lochte as \"Doggy\" and talks affectionately about his rival and teammate. Bloggers have coined the term \"Phlochte\" for their bromance.\"\r",
    "id": "4m3r1uqxem",
    "available": "is available"
  },
  {
    "title": "manther.com",
    "meaning": "A male cougar.  Single, usually divorced, and at a minimum 10 years older than a cougar.",
    "example": "He did not care if the youth laughed at his ragtop corvette that even at this age he could not afford, for he was manther.",
    "id": "90x8vbqylm",
    "available": "is taken"
  },
  {
    "title": "droplifting.com",
    "meaning": "Droplifting is the opposite of shoplifting; it involves leaving a product or item in a shop, rather than taking one.  It has been used by artists and musicians to promote their work for free, whilst some people use droplifting to make political or economic statements. (for example by altering shop's products and then returning them)",
    "example": "Person #1: Why is there a can of Sainsburys soup for sale in Tesco?\r\rPerson #2: It must have been droplifted.\r\rPerson #3: What's droplifting?",
    "id": "26lw2f93q0",
    "available": "is taken"
  },
  {
    "title": "hasbian.com",
    "meaning": "A former lesbian who is now in a heterosexual relationship.",
    "id": "q68z1f58p6",
    "available": "is for sale"
  },
  {
    "title": "militaryfactor.com",
    "meaning": "The factor by which a male's hottness increases when he's in his uniform.  On a scale of one to ten, a uniform usually increases a guy's number by 2.  Can also be applied to non-military men in some uniforms.",
    "example": "Person 1: Check that guy out.  He's a solid 7.\rPerson 2: Him?  He's in my Spanish class.  He's in AFROTC.  On Tuesdays when he's in his dress blues he's a 9, atleast.",
    "id": "46pvdbyd96",
    "available": "is for sale"
  },
  {
    "title": "roaching.com",
    "meaning": "A dog that lays on its back with all four legs in the air--like a dead cockroach--is commonly described as \"roaching.\"",
    "example": "Fido is roaching on the couch.",
    "id": "8mvpnulonm",
    "available": "is taken"
  },
  {
    "title": "coffeenap.com",
    "meaning": "A nap taken after someone has consumed any amount of caffeine    (i.e. coffee) resulting not in sleep, but blissful rest, while still mildly conscious.",
    "example": "Evelyn: Hey Kaitlyn, how was your coffee nap?\rKaitlyn: It was fantastic I listened to the whole LOVE album, while seeming to float on a cloud.\rEvelyn: Awesome! I just had a latte, about to have a coffee nap of my own!",
    "id": "7mov8t41n0",
    "available": "is taken"
  },
  {
    "title": ".com",
    "meaning": "y u mad",
    "example": "Pug: all you do is make infestors\rYou: ¯\\_(ツ)_/¯",
    "id": "w6142u1wr6",
    "available": "is taken"
  },
  {
    "title": "ghostpost.com",
    "meaning": "A comment on a Facebook item (e.g. status, note, etc) that was removed by the author due to A) misspelling, B) stupid remark, C) awkward input, or D) other.\r\rThe result is typically confusion and several wasted minutes on the part of the one who was commented on or anyone who posted previously.",
    "example": "Facebook: XYZ commented on your note.\rMe: ...where's the comment? Jeez, way to ghost post, XYZ.",
    "id": "20w1puwgzm",
    "available": "is taken"
  },
  {
    "title": "doitforthevine.com",
    "meaning": "when you want someone to do something, take your phone and say \"do it for the vine\" while recording him, then he'll do it because of the \"social\" pressure.",
    "example": "rebecca: \"hey dude, someone told me you know how to wiggle wiggle like anyone else\"\rmike: \"are you kidding? there is no way\rrebecca: \"do it\"\rmike: \"no\"\rrebecca: \"do it! do it! Do it for the vine!\"\rmike wiggleing... ;)",
    "id": "k6qqgi87l6",
    "available": "is taken"
  },
  {
    "title": "cinematard.com",
    "meaning": "One who is completely lacking movie knowledge.",
    "example": "Heather - \"Hey Greta, wanna see that new Tom Hanks movie, Mission Difficult II?\r\rGreta - \"Um you mean the new Tom CRUISE movie, Mission Impossible III? Girl, you are a real cinematard!\"\r\r",
    "id": "36y11inow6",
    "available": "is for sale"
  },
  {
    "title": "ifyouwill.com",
    "meaning": "1. An phrase overused by those trying to sound sophisticated and/or intelligent.2. A phrase used frequently by Tobias Bluth from Arrested Development.",
    "example": "Tobias: You could say I'm, if you will, 'buy curious'Man: I can \"sprinkle the pudding\" if you will.",
    "id": "v029oijqn6",
    "available": "is taken"
  },
  {
    "title": "precrestination.com",
    "meaning": "To thoroughly clean one's teeth before visiting the dentist for a teeth cleaning.",
    "example": "I ate a bag of Oreo's and then committed precrestination before going to my dentist appointment.",
    "id": "76z8ktoj36",
    "available": "is for sale"
  },
  {
    "title": "notetoself.com",
    "meaning": "1. an exclamation used when you want to punctuate/emphasize an obvious or insulting quip or action\r2. an exclamation highlighting something you did not know until then\r3. a personal reminder",
    "example": "1. \"note to self: Jarod is an idiot\"\r2. \"note to self: don't put wooden objects in the dishwasher\"\r3. \"note to self: pay rent\"",
    "id": "w672zu17pm",
    "available": "is taken"
  },
  {
    "title": "fourwheeling.com",
    "meaning": "When your head bobs around when you about to fall asleep when sitting upright.  It is given this name because it looks like you're driving offroad.  ",
    "example": "The security guard was fired for four-wheeling at his post.  ",
    "id": "kmglxcw8l6",
    "available": "is for sale"
  },
  {
    "title": "vulturecapitalist.com",
    "meaning": "A businessman who is looking to buy companies at giveaway prices, as opposed to venture capitalists.",
    "example": "\"It's well known that the business is having major problems paying its bills, so I guess it won't be long before the vulture capitalists start circling.\"",
    "id": "9045na8wj6",
    "available": "is taken"
  },
  {
    "title": "momcom.com",
    "meaning": "Romantic comedy or romcom specifically geared toward moms. Most mere mortals will not understand momcoms without a mom to translate the comedy for them. Momcommers will say things such as, \"You wouldn't get it, you're not a mom\" or \"I guess I just really got the comedy because I am a mom\"",
    "example": "Shirley went to the theater with her PTA friends to see Adam Sandlers new mom-com.",
    "id": "4097xspxq6",
    "available": "is taken"
  },
  {
    "title": "maintenancestrokes.com",
    "meaning": "What a man does to maintain his erection, usually while waiting for more porn to load or doing something else.",
    "example": "I was doing maintenance strokes with porn running in the background while browsing 4chan.",
    "id": "y6r8yh15k0",
    "available": "is available"
  },
  {
    "title": "accountabilabuddy.com",
    "meaning": "A friend, maybe a best friend, who you get into trouble with and who is somewhat responsible for your actions.",
    "example": "Dude, Kyle is totally my accountabilabuddy. Good lookin out Kyle.",
    "id": "z65dvfyeg0",
    "available": "is taken"
  },
  {
    "title": "doggo.com",
    "meaning": "A big ol pupper.",
    "example": "What the fuck is doggo?\rA big ol pupper.",
    "id": "q6dwxu8rdm",
    "available": "is for sale"
  },
  {
    "title": "wakemeupinsidesyndrome.com",
    "meaning": "The process by which a song's title is inferred through the lyrics, even though the actual title of the song is different.Named after the song \"Bring Me To Life\" by Evanescence, which many nimrods erroneously believe to be called \"Wake Me Up Inside.\" However, this phenomenon is not limited to this song only.",
    "example": "Person A: My favorite song is \"Wake Me Up Inside\" by Evanescence!\rPerson B: I believe the song is called \"Bring Me To Life\"\rPerson A: Shut the fuck up!\rPerson B: Just another case of \"Wake Me Up Inside\" syndrome...",
    "id": "90kv8hej8m",
    "available": "is available"
  },
  {
    "title": "trexsex.com",
    "meaning": "T-Rex sex is a loud, passionate and savage encounter.",
    "example": "The couple in the room above, had prolonged T-Rex sex, which broke the bed and brought security!",
    "id": "y6nv5agz80",
    "available": "is taken"
  },
  {
    "title": "scrollaxing.com",
    "meaning": "Verb: To scroll through all of your personal email and social media on your couch or bean bag at the end of a hard day. You find this to be an effective way to decompress or chill.",
    "example": "I'll be scrollaxing until 7:00, but I'll meet you at the bar at 7:30.\"What are your plans for tonight bro?\" \"It's really cold outide so I think I'm just going to stay in and do some scrollaxing on my iPad.\"",
    "id": "omevebgx96",
    "available": "is for sale"
  },
  {
    "title": "robocall.com",
    "meaning": "A prerecorded call that is sent to hundreds or thousands of telephone numbers. An automatic dialing computer goes through a targeted list of phone numbers.\r\rOr: an individual call received.",
    "example": "political consultant says... We need to record a celebrity robocall, provision it, and hit our base at least ten weeks before early voting.\r\rvoter says... Damn, I came home to seven robocalls on my answering machine. And nothing from Match.com.",
    "id": "zmjv4sgj8m",
    "available": "is taken"
  },
  {
    "title": "birther.com",
    "meaning": "A conspiracy theorist who believes that Barack Obama is ineligible for the Presidency of the United States, based on any number of claims related to his place of birth, birth certificate, favorite birthday, or whether or not he has heard the song Africa by Toto.",
    "example": "\"Did you know that Barack Obama's parents concealed the location of his birth because they knew he would grow up to be President?  What?  Of course it makes sense, I'm a birther!\"",
    "id": "4m3o1hqxem",
    "available": "is for sale"
  },
  {
    "title": "heneedsomemilk.com",
    "meaning": "Having a violent accident so bad, it's obvious from afar that all of your bones are broken",
    "example": "Once Kendall had hit the ground from his faulty parachute jump, it was obvious, he need some milk.",
    "id": "90xxvaqyl0",
    "available": "is for sale"
  },
  {
    "title": "inaccurism.com",
    "meaning": "1.\tAn unintentionally inaccurate statement or idea; possibly common and often used.\r2.\tA pervasive disorder, characterized by a tendency to make inaccurate statements.",
    "example": "1.\tIn political discussions, Frank angers his friends with his persistent inaccurisms.\r2.\tEmbarrassed by propagating the fake internet story, Lucy blamed it on her inaccurism.",
    "id": "26lj2s93qm",
    "available": "is for sale"
  },
  {
    "title": "stallsniffle.com",
    "meaning": "The noise someone makes when they want to let you know they are in a bathroom stall",
    "example": "Had to take a really wicked dump and got a stall sniffle when I hit the bathroom door. Almost shit in my pants running to another bathroom.",
    "id": "q68q1i58p6",
    "available": "is for sale"
  },
  {
    "title": "grabthembythepussy.com",
    "meaning": "Something that Donald Trump enjoys doing.",
    "example": "“I moved on her like a bitch, but I couldn’t get there. And she was married.”“I did try and fuck her. She was married.”“Just kiss. I don’t even wait. And when you’re a star, they let you do it. You can do anything.”“Grab them by the pussy. You can do anything.”",
    "id": "46pjdcyd96",
    "available": "is taken"
  },
  {
    "title": "nonpology.com",
    "meaning": "An insincere apology or expression of regret, often blaming the aggrieved party for being offended or bringing up an irrelevant topic to distract.",
    "example": "\"Did you hear Don Imus' nonpology the other day?  Like his racist remarks are actually the result of rap music.\"\r\r\"I really get tired of politicians' nonpologies.  All they're really saying is they're sorry they got caught.\"",
    "id": "8mvxnclon6",
    "available": "is taken"
  },
  {
    "title": "mirf.com",
    "meaning": "(merf) noun. acronym for Mom I'd Run From. The opposite of a MILF. A mom you definitely would not want to do.",
    "example": "\"I don't know where she gets her good looks, her mom is a \rMIRF!\"\r\r\"Your momma's so ugly she's not a MILF she's a MIRF!\"",
    "id": "7moj8f41n0",
    "available": "is taken"
  },
  {
    "title": "dictionaried.com",
    "meaning": "The act of looking up the definition of a word.",
    "example": "I know what that word means, I dictionaried it earlier.",
    "id": "w6112b1wr6",
    "available": "is taken"
  },
  {
    "title": "bromosexual.com",
    "meaning": "A unique and powerfull relationship amongst bros that words cannot define.",
    "example": "\"Hey are those guys gay.\" \"Nah man, they're just bromosexuals.\"\"I love you man. I don't know whats going on, I think I might be going bromo for you..\"",
    "id": "20wvpswgzm",
    "available": "is taken"
  },
  {
    "title": "financialerosion.com",
    "meaning": "The gradual conversion of your wealth and possessions to the government, through taxes, inflation and unjust laws.\r\r",
    "example": "Due to financial erosion, I opted to not maintain my property while I scrape up the cash to pay the property taxes.",
    "id": "k6qjga87l0",
    "available": "is for sale"
  },
  {
    "title": "trumpertantrum.com",
    "meaning": "Early morning tweeting that is vengeful, mean, or defamatory-- ideally laced with falsehood and innuendo.",
    "example": "The celebrity threw another Trumper Tantrum filled with misogynistic fat shaming and slut shaming. #trumpertantrum\rtrumpertantrum",
    "id": "36yl1fnow0",
    "available": "is taken"
  },
  {
    "title": "selectivedickism.com",
    "meaning": "When someone is only a dick to certain people",
    "example": "Logan: Brad why does it seem like you're only a dick to meBrad: Sorry Logan, I have Selective Dickism",
    "id": "v02oobjqn6",
    "available": "is for sale"
  },
  {
    "title": "comfortcartoon.com",
    "meaning": "Synonymous to comfort food, comfort cartoon provides feelings of nostalgia and sentimentality towards the viewers. The type of animation tends to be stylized and visually appealing: over or under saturation of colours, \"incorrect\" motion etc.\rThe storylines tend to be rich with lessons and underlying meanings (nutrients) or sometimes it's just for pure fun and joy (carbs).Popular examples would be: Classic Looney Tunes, B&W Mickey Mouse, retro Disney (70's or 80's classics).",
    "example": "I had a shitty day at work today, but I wanted to stick to my diet...so instead of gorging on burgers and ice cream, I watched comfort cartoons instead.",
    "id": "76zxksoj3m",
    "available": "is taken"
  },
  {
    "title": "takeatrump.com",
    "meaning": "the act of excreting racist, sexist, homophobic, theocratic, fascist rhetoric from one's oral sphincter; esp. in the presence of large groups of like-minded, gullible, and/or easily influenced/manipulated individuals",
    "example": "Can you believe so many people are watching this guy take a trump and applauding for it?",
    "id": "w67ozt17p0",
    "available": "is for sale"
  },
  {
    "title": "putmeinthecar.com",
    "meaning": "Asking your homie to hook you up with his girlfriends best friend.",
    "example": "\"Aye bruh what's up with Tina homegirl...\"PUT ME IN THE CAR\"",
    "id": "kmgdxhw8lm",
    "available": "is available"
  },
  {
    "title": "manterrupting.com",
    "meaning": "Manterrupting: a sexist display of male \"dominance\". A trait that has not yet been lost despite decades of evolution. When men interrupt women because they \"believe\" that what they have to say is somehow more important.",
    "example": "Boy: why aren't you joining in on the conversation any more? Talk wth us!Girl: I would love to, but anytime I try to say to chime in, but your buddies keep manterrupting me.",
    "id": "904onu8wjm",
    "available": "is for sale"
  },
  {
    "title": "redneckfirstclass.com",
    "meaning": "When you are flying in the coach section of an airplane and one or both of the other two seats are unoccupied giving you more room, to stretch, lean or lie down.",
    "example": "The middle seat was unoccupied on my recent flight home so I got to sit in Redneck First Class",
    "id": "409oxfpxq0",
    "available": "is taken"
  },
  {
    "title": "pencilyouintomyblackberry.com",
    "meaning": "1. Having no intention of following thru on a date or promise2. A sarcastic way of accepting a date.3. Accepting a date only to mock the requester.",
    "example": "Raul: Hi Jess, will you go to Hooters with me on Friday?\rJess: Sure, let me just pencil you into my Blackberry!\rRaul: Really?!\rJess: Ew, no!",
    "id": "y6r3yb15k6",
    "available": "is available"
  },
  {
    "title": "wakeandbake.com",
    "meaning": "Toking up right after you wake up.",
    "example": "Morning Drew, I got 10 dollars, feel like a wake n' bake?",
    "id": "z65ovhyegm",
    "available": "is for sale"
  },
  {
    "title": "steppinonmydick.com",
    "meaning": "when someone disrespects your manhood.",
    "example": "chick: you can't even pay for dinner or kill a spider, what's wrong with you\rguy: damn quit steppin on my dick!",
    "id": "q6d9xt8rd0",
    "available": "is available"
  },
  {
    "title": "nfi.com",
    "meaning": "No Fucking Idea",
    "example": "The manager has NFI of the work that goes on around here...",
    "id": "90kj8sej8m",
    "available": "is for sale"
  },
  {
    "title": "shopliftthepooty.com",
    "meaning": "When a man sleeps with a single mother with a small child.\r\rAlso, when a man expresses false adornment for a women's child in order to sleep with her.",
    "example": "Dude, look at John and Sara. He straight up shoplifted the pooty.",
    "id": "y6n85igz86",
    "available": "is available"
  },
  {
    "title": "englishmuffintop.com",
    "meaning": "A far more severe muffin top where several folds of fat spills over a women's pants creating various nooks and crannies.",
    "example": "There is enough butter in that girls English muffin top.",
    "id": "omerefgx90",
    "available": "is available"
  },
  {
    "title": "boyfriendbomb.com",
    "meaning": "When a female you are interested in casually reveals that she has a boyfriend (intentionally or otherwise).",
    "example": "I was about to ask her out but then she dropped the boyfriend bomb.",
    "id": "zmjj4ugj8m",
    "available": "is taken"
  },
  {
    "title": "seeyoulatermasturbator.com",
    "meaning": "A variation of see you later alligator",
    "example": "Beef: \"See you later masturbator\"\rJack: \"In a while, pedophile\"",
    "id": "4m3j1fqxe0",
    "available": "is taken"
  },
  {
    "title": "fappable.com",
    "meaning": "Something that is sexually desirable, or deemed high enough quality that it can be used for masturbation purposes.",
    "example": "Man, that picture is really fappable.",
    "id": "90x5vhqylm",
    "available": "is taken"
  },
  {
    "title": "jabberwoke.com",
    "meaning": "to lecture about social injustice, while doing little to create change.",
    "example": "I friend likes to jabber woke at our cafe, then go home to his hobby  ranch.",
    "id": "26l52a93q0",
    "available": "is taken"
  },
  {
    "title": "speciesdysphoria.com",
    "meaning": "a feeling that one is in the body of the wrong species",
    "example": "Alyssa: I told the shrink that I feel like a wild animal trapped in a human body, and she said it sounds like classic species dysphoria.\rJacques: I know I was meant to be a dolphin. Why did I end up a sexy human instead?? Species dysphoria sucks.\rJerry: If only I'd been born a bird, I wouldn't have to spend so much money on flying, parachuting, hang-gliding, sky-diving and base-jumping. Damned species dysphoria.",
    "id": "q68g1f58p0",
    "available": "is available"
  },
  {
    "title": "wikiot.com",
    "meaning": "An fool who believes all information found on Wikipedia is accurate and true.  ",
    "example": "Michael Scott, from NBC's \"The Office\", upon claiming \"Wikipedia is the best thing ever. Anyone in the world can write anything they want about any subject, so you know you are getting the best possible information.\" solidified himself among the ranks of wikiots.  ",
    "id": "46pydiyd96",
    "available": "is for sale"
  },
  {
    "title": "sike.com",
    "meaning": "The immediately preceding statement is false and was told to mislead.",
    "example": "I really miss that show Blossom ... SIKE!",
    "id": "8mvqnflon0",
    "available": "is for sale"
  },
  {
    "title": "pornament.com",
    "meaning": "noun:  a pornographic Christmas ornament.",
    "example": "Somehow, Rodney's Christmas tree, decked out in garish purple lights and Mrs. Santa pornaments, failed to convey the solemnity and dignity of this holiest of days.",
    "id": "7mon8c41n6",
    "available": "is for sale"
  },
  {
    "title": "shamecation.com",
    "meaning": "A form of punishment wherein an employee fucks up beyond the reprimand of a warning and is put on a disciplinary leave of absence with or without pay.",
    "example": "\"Where's Jimmy this week?\" \"Oh he opened the store 2 hours late so boss put him on a Shamecation.\"",
    "id": "w61j2c1wr6",
    "available": "is taken"
  },
  {
    "title": "cornart.com",
    "meaning": "A euphemistic reference to taking a massive dump. Typically the corn filled variety. But eloquently expresses any act of defecation.",
    "example": "Well I hope everyone enjoyed that Thanksgiving meal. Now if you'll excuse me, it's time for me to work on my corn art. I've got a masterpiece on the way.",
    "id": "20wrpiwgz6",
    "available": "is taken"
  },
  {
    "title": "mistext.com",
    "meaning": "A text message containing information (usually unflattering or damaging) about a third party which is sent to the individual it concerns rather than the person for whom the communication is intended.\r",
    "example": "Text written for secret lover is inadvertently sent to partner, making it a mistext:\r\r\"On my way home, partner name suspicious, don't call.\"\r\r",
    "id": "k6q2gc87l6",
    "available": "is for sale"
  },
  {
    "title": "hippiechristmas.com",
    "meaning": "the morning after hippies or member of the 60's counter culture have made tie dyed t shirts, candles, or prayer flags",
    "example": "Our neighbors were sharing another hippie christmas on their drive way with 20 of their closest friends unwrapping tie dyed tshirts and prayer flags to dry in the sun.",
    "id": "36yd1bnow6",
    "available": "is taken"
  },
  {
    "title": "toothsweater.com",
    "meaning": "When you go for a day or so without brushing your teeth, and the texture in your mouth feels like your teeth are wearing fuzzy little sweaters.",
    "example": "\"Does anyone have gum? I forgot to brush my teeth this morning, and it feels disgusting.\"\r\"Oh, you've got tooth sweaters?\"",
    "id": "v02johjqnm",
    "available": "is taken"
  },
  {
    "title": "peasantvision.com",
    "meaning": "Television channels you get without a cable or satellite TV subscription.",
    "example": "I can't afford digital cable, but I still get some good shows with the rabbit ears on peasantvision.",
    "id": "20wrrswgz6",
    "available": "is taken"
  },
  {
    "title": "porchdog.com",
    "meaning": "A person who frequently attacks others in speech or writing, but who poses no intellectual threat whatsoever.  The motivation of this type of person can usually be accurately construed as a desire to be obnoxious and offensive.\r\rOrigin: The phrase \"porch dog\" is used to refer to dogs that sit on front porches and bark (vigorously and fruitlessly) at passersby, but who pose no physical threat.",
    "example": "Yeah, that guy has a scathing response to just about everyone who posts in this forum.  He's a real porch dog.",
    "id": "k6q25t87l6",
    "available": "is for sale"
  },
  {
    "title": "mittromneymoney.com",
    "meaning": "One that has money beyond that of a normal baller yet pays less taxes than a street pharmaceutical rep or an illegal immigrant.",
    "example": "Look dat new lex he be drivin. He must got dat Mitt Romney Money.",
    "id": "36yd9cnow6",
    "available": "is available"
  },
  {
    "title": "giftcardmillionaire.com",
    "meaning": "A person who holds a significant amount of money tied up in Gift Cards, Store Credit, Groupons and other forms of vouchers.",
    "example": "Financial Advisor: Do you know your networth?\rGift Card Millionaire: Do you include Gift Cards? Because that would significantly affect the day I can retire.",
    "id": "v02jdtjqnm",
    "available": "is available"
  },
  {
    "title": "orophilia.com",
    "meaning": "oral sex.",
    "example": "They are vigorously involved in orophilia.",
    "id": "76zkysoj36",
    "available": "is taken"
  },
  {
    "title": "ybd.com",
    "meaning": "your baby daddy",
    "example": "I am like totally going to be Haile's ybd",
    "id": "w677du17p6",
    "available": "is taken"
  },
  {
    "title": "dicksoutforharambe.com",
    "meaning": "The act of pulling your dick out of your pants as a sign of respect for our nigga Harambe",
    "example": "Show some respect you insensitive fuck; dicks out for Harambe.",
    "id": "kmg7zfw8lm",
    "available": "is taken"
  },
  {
    "title": "bardcore.com",
    "meaning": "a spin-off of the word hardcore, used, when referring to Pornography, to refer to a movie that was made with a Shakespearean play as the original plot.",
    "example": "Dude, I just saw my first bardcore movie, \"A Midsummer's Night Cream!\"",
    "id": "904y4c8wj0",
    "available": "is for sale"
  },
  {
    "title": "jesusjeans.com",
    "meaning": "ripped or \"holy\" jeans. They're so holy, they're jesus jeans!",
    "example": "Dude! LOOK AT MY NEW JESUS JEANS!",
    "id": "4094rupxq6",
    "available": "is taken"
  },
  {
    "title": "familiated.com",
    "meaning": "To be humiliated in front of ones family.",
    "example": "Its not a good feeling to be familiated.",
    "id": "y6rzec15k0",
    "available": "is taken"
  },
  {
    "title": "lowpropo.com",
    "meaning": "Undercover police officers. (low profile police)",
    "example": "\"those low pro po's swear we cant spot them in crown vics with no plates and a searchlight.\"",
    "id": "z6525tyeg6",
    "available": "is taken"
  },
  {
    "title": "hateuscausetheyanus.com",
    "meaning": "A way of saying the phrase, \"Hate us cause they ain't us\" with a little more elegance.",
    "example": "Webster: \"Boy I'll tell ya Garth, them jocks are always ragging on us for our programming skills.\"\rGarth: \"Hate us cause they anus!\"",
    "id": "q6dylh8rd6",
    "available": "is available"
  },
  {
    "title": "middledistancerelationship.com",
    "meaning": "A middle-distance relationship, or \"MDR\", is when two people find themselves living with *JUST* enough distance between them that they can’t see each other as often as they'd like — shorter than the distance between Taylor Swift and Adele's vocal ranges but longer than the time it takes to master the catchy lyrics to Tay Tay’s latest chart-topper. Commonly used for a relationship with a significant other, friend, or friend's pet that lives more than 30 minutes, one bridge or a very large hill away.",
    "example": "Person 1: How often do you see your BFF?\rPerson 2: Um, like once a month TOPS. She lives all the way in Oakland.\rPerson 1: Ew. I hate crossing the bridge.\rPerson 2: I know, but I love her. She makes having a middle-distance relationship totes worth",
    "id": "90kz1iej80",
    "available": "is available"
  },
  {
    "title": "fevertexting.com",
    "meaning": "A panicky, flirtatious text thread usually leading to sexting. Commonly typed in a nervous fashion out of fear of getting caught.",
    "example": "Look at Jimmy over there fever texting with his side chick.",
    "id": "y6n4otgz80",
    "available": "is taken"
  },
  {
    "title": "fullsmash.com",
    "meaning": "a massive night out with the lads with no defined finishing time, unlimited larger consumption and scant regard for any tasks or responsibilities that need to be adhered to the next day. Generally the premise of the out of town worker",
    "example": "-you out on Thursday?\r-too right, full smash!\r-but what about all that cable we've got to install on Friday?\r-i couldn't give a f**k!",
    "id": "omedkigx96",
    "available": "is taken"
  },
  {
    "title": "otherthanthathowwastheplaymrslincoln.com",
    "meaning": "A sarcastic phrase meant to downplay the complaint or misfortune of another person, similar to playing the world's tiniest violin with one's fingers.It is a reference to the assassination of President Lincoln. Can be substituted with any phrase referring to a tragic event, such as, \"Other than that, how was the flight, Sullie?\"",
    "example": "\"I just found out I have to work this weekend.\"\r\"Other than that, how was the play, Mrs. Lincoln?\"",
    "id": "zmj21hgj80",
    "available": "is available"
  },
  {
    "title": "gasends.com",
    "meaning": "Bay area term meaning to put money down on someone else's gas. Someone's portion of gas money.",
    "example": "\"If you take me there I will give you gas ends.\"\"Do you have gas ends for the trip?\"\r\"I have ends on gas!\"",
    "id": "4m3nzhqxe6",
    "available": "is available"
  },
  {
    "title": "depressiveaggressive.com",
    "meaning": "When a person in casual conversation drops extremely depressing information in an order to derail the conversation to a more depressing state.",
    "example": "Person 1:\"Hey this restaurant is really great!\"Person 2: \"Yeah, but that time I was here my ex punched me in the face.\"Person 1: \"...fuck...way too be depressive aggressive.\"",
    "id": "90xzntqylm",
    "available": "is taken"
  },
  {
    "title": "trumpbrag.com",
    "meaning": "When someone brags about something but are clearly lying about it or give an example of how bad you are at the thing you're bragging about.",
    "example": "Did you hear that Trump Brag: \"I went to an ivy league school, I'm very highly educated. I know words I have the best words.\"",
    "id": "26l78a93qm",
    "available": "is taken"
  },
  {
    "title": "breaktheinternet.com",
    "meaning": "What happens when you type \"Google\" into Google.",
    "example": "I am head of IT and I have it on good authority: if you type \"Google\" into Google you can break the internet. So please, no-one try it, even for a joke.",
    "id": "q6875b58p0",
    "available": "is taken"
  },
  {
    "title": "openbeta.com",
    "meaning": "Open Beta is the stage of devolopment where you have to Pre-Purchase the game to have the privelege to test it for any final bugs.",
    "example": "\"Pre-Purchase for OPEN BETA EARLY ACESS\" - Overwatch, Blizzard",
    "id": "46prwcyd90",
    "available": "is taken"
  },
  {
    "title": "texasdriver.com",
    "meaning": "a driver that is all over your rear bumper if you drive the speed limit.",
    "example": "Damn I'm driving the speed limit and that texas driver behind me is all over my rear bumper!",
    "id": "8mvyjalonm",
    "available": "is taken"
  },
  {
    "title": "paratext.com",
    "meaning": "When you send or receive a text that is so long that you need to scroll down.",
    "example": "Jane: \"So... Did you hear from that sexy fireman from the bar?\"\rJill: \"Yeah, but no dice. He paratexted me. What a weirdo.\"",
    "id": "7mo9vt41nm",
    "available": "is taken"
  },
  {
    "title": "whereisthiscomingfrom.com",
    "meaning": "An excuse used by shitty people to deny ownership or knowledge of their bad qualities. Can also be used to devalue and avoid change or responsibility over what the other person said to them. In either case, the speaker feigns surprise at these \"new\" and \"unexpected\" things they are being told.Translates directly into \"you've taken all my shit before, why the sudden backbone?\" and/or \"I've known this for awhile, but why bring it up now?\"",
    "example": "Ellie: You lie to my face and behind my back, we only hang out when you need something, you ditch me the second you get a boyfriend and come running back the second he leaves you, and you give me your clothes that are too tight and then tell people you gave them to me because they were too big. You're a bad friend, and I'm so done with you.\rChristie: Whoah, where is this coming from?Dan: We've been friends for a long time and obviously you know I like you because I go above and beyond the call of duty of friendship, so now that you're single, maybe we can go on a date?\rJamie: A date? Like romantic? But you're my friend. Where is this coming from?",
    "id": "w61d1i1wr6",
    "available": "is available"
  },
  {
    "title": "morethanoney.com",
    "meaning": "When a women texts you using more than one \"y\" it means they like or have a crush on you.",
    "example": "Girl: Heyyyy\rBoy: Hi\rGirl: I like you.\rBoy: I know... You used more than one \"y\".",
    "id": "20w2rhwgz0",
    "available": "is available"
  },
  {
    "title": "letmygirlshang.com",
    "meaning": "The act of taking your bra off after a long day and letting them be free.",
    "example": "I can't wait to get home from work and let my girls hang",
    "id": "k6q55a87l6",
    "available": "is available"
  },
  {
    "title": "jagoff.com",
    "meaning": "A rude assholelike person. originated in pittsburgh",
    "example": "\"Yinz were acting like jagoffs the other night, all drunk on Ahrns n'at\" ",
    "id": "36y79hnow6",
    "available": "is taken"
  },
  {
    "title": "pokemongoo.com",
    "meaning": "When a person ejalculates while playing the game \"Pokemon go.\" This usually occurs near spawn points of legendary/rare Pokemon.",
    "example": "Kevin is that Mewtew??Kevin: *pokemon goos self*",
    "id": "v02kdhjqn0",
    "available": "is taken"
  },
  {
    "title": "flatearther.com",
    "meaning": "a person who does not accept or is out of touch with the realities/ beliefs of modern times;one who blatantly dismisses/ disagrees with common knowledge or scientific findings.",
    "example": "Joe doesn't even believe the planet is round, or that we landed on the moon... he's a flat earther.",
    "id": "76zgytoj30",
    "available": "is taken"
  },
  {
    "title": "basicwhitegirl.com",
    "meaning": "A female who conforms to her surroundings and claims she is unique. She often drinks Starbucks, wears Ugg boots in August, and posts selfies on social networking sites every. single. day. Also uses hashtags that don't have anything to do with the picture itself.",
    "example": "Girl 1: Hey, let's go to Starbucks and wear leggings with Uggs!\rGirl 2: OMG YES. We are so basic!\rGirl 1: Take a picture! Hashtag yay us, basic white girls, Starbucks, bye, like, what",
    "id": "w67zdf17pm",
    "available": "is taken"
  },
  {
    "title": "pokpace.com",
    "meaning": "The zombie like foot speed of Pokémon GO player's.",
    "example": "You can tell they're all playing Pokémon GO based on their trademark Poképace.If it usually takes 15 minutes to walk there, it'll take Ramon 30 to 45 based on his Poképace.",
    "id": "kmgnzsw8l0",
    "available": "is available"
  },
  {
    "title": "groupchatphobia.com",
    "meaning": "The phobia of texting in group chats.",
    "example": "Nick has group chat phobia, so he texts people individually.",
    "id": "904q4h8wj6",
    "available": "is available"
  },
  {
    "title": "introsexual.com",
    "meaning": "The act of loving oneself; being sexually attracted to yourself.",
    "example": "Kanye is introsexual",
    "id": "409gripxq6",
    "available": "is taken"
  },
  {
    "title": "trumpsterfire.com",
    "meaning": "When a rabid racist rant is fueled by a shitstorm of word salad.",
    "example": "\"That speech smells like Trumpster Fire!\"",
    "id": "y6rdeh15km",
    "available": "is taken"
  },
  {
    "title": "drakeeffect.com",
    "meaning": "The feelings that get stirred up whenever a Drake R&B song comes on, where you start missing people that you don't even know.",
    "example": "Guy 1: Have you heard that one song by Drake?\rGuy 2: Nah, what is it?\rGuy 1: *plays it*\rGuy 2: OMGAHHHH, STEPHANIEEEEE\rGuy 1: ...We don't even know a Stephanie.\rGuy 2: I CAN'T HELP IT, IT'S THE DRAKE EFFECT.",
    "id": "z65y5cyeg0",
    "available": "is available"
  },
  {
    "title": "trumpence.com",
    "meaning": "chump change",
    "example": "After all, it is only worth trumpence.",
    "id": "q6d5lb8rdm",
    "available": "is for sale"
  },
  {
    "title": "tbhh.com",
    "meaning": "To be hella honest",
    "example": "Tbhh I hate you",
    "id": "90kx1hej86",
    "available": "is for sale"
  },
  {
    "title": "sleepon.com",
    "meaning": "To ignore, overlook, or to forget something. Used as a verb, to sleep on something. Overlooking something that is deemed good or tight.",
    "example": "\"Yall can sleep on the Steelers. They finna take it all this year.\"",
    "id": "y6nxoagz8m",
    "available": "is for sale"
  },
  {
    "title": "brathirty.com",
    "meaning": "The time during the day at which it is no longer physically possible to wear a bra. Can also be written as bra:thirty, bra 30 or bra:30. Bras are removed for the remainder of the day at bra thirty.",
    "example": "I got home after a long day at work and what do you know? It's bra thirty! Sweatshirt and yoga pants for the rest of the evening!",
    "id": "omexkbgx90",
    "available": "is taken"
  },
  {
    "title": "pokemonparanoia.com",
    "meaning": "The suspicion that anyone on their phone outdoors is playing PoGo.",
    "example": "\"Hey, you playing Pokemon?\"\r\"Not me...\"\r--Pokemon paranoia claims another victim",
    "id": "zmjx1sgj86",
    "available": "is taken"
  },
  {
    "title": "fuckitmountain.com",
    "meaning": "It's after you realized you have taken so much shit from people because you are nice. And every time you do something bs the pile gets bigger and bigger until you have reached the tipping point where you are like fuck this shit I'm out. Then whatever comes your way, you don't care.",
    "example": "Fuck this, I'm pretty sure I'm on fuck it mountain right now. Go ahead, it symbolizes life right now.",
    "id": "4m3wzuqxe6",
    "available": "is taken"
  },
  {
    "title": "platonickiss.com",
    "meaning": "A platonic kiss is a kiss between two people when one or more of the engaged parties is in a relationship and is trying to remain guilt-free whilst kissing other girls/guys.",
    "example": "No babe, it was totally just a platonic kiss, I swear, she doesn't mean anything!",
    "id": "90x4ncqyl6",
    "available": "is taken"
  },
  {
    "title": "phonykickingit.com",
    "meaning": "When you don't like somebody but you hang out with them",
    "example": "I don't get how she was just talking about her but they coolIt's called phony kicking it. It's stupid but everyone's doing it",
    "id": "26lx8u93q6",
    "available": "is available"
  },
  {
    "title": "fuckinghellmate.com",
    "meaning": "Used frequently by the people native to the United Kingdom, this is an exclamation that shows feelings of frustration or anger.",
    "example": "\"Fucking hell mate, we have been trying for 2 hours and you still can't get this dildo in my ass.\"",
    "id": "q68w5h58p6",
    "available": "is available"
  },
  {
    "title": "facebookonality.com",
    "meaning": "The individual's Facebook personality as it is perceived by others from their post, likes, comments, emoji's, and other Facebook activity.",
    "example": "Person 1: \" It is obvious it's 'Shark Week' for Susan! \"\rPerson 2: \" How can you tell?\"\rPerson 1: \" Her Facebookonality has come off a little bitchy lately. Plus she posted that she was listening to Alanis Morissette\"Person 2: \" Oh yeah... its 'Shark Week ' for sure! \"",
    "id": "46pqwiyd9m",
    "available": "is taken"
  },
  {
    "title": "deadass.com",
    "meaning": "To be completely and honestly serious.\rA reply used by people who have been questioned on the truth of their comment.\rTo be truthful and not lie.\rA truncation of the phrase \"dead ass serious\".",
    "example": "Guy 1: Yo, swear I saw George (W.) Bush jump that fence for a corndog...\r\rGuy 2: What? nah uh, you're lying..\r\rGuy 1: No, for real! I'm dead ass.",
    "id": "8mv7jhlonm",
    "available": "is taken"
  },
  {
    "title": "mannod.com",
    "meaning": "A nod of the head similiar to the nod of acknoweldgement but can be used between any two men, not just friends. It is an unspoken greeting in which only another man nod is an appropriate response. Signifies acceptence of presence. Verbally may be interpretted as a grunt. Universal language with no ehtnic restrictions.",
    "example": "Bob was walking down a street in a rough neighborhood as he approached a scary looking bigger man. Thankfully the the bigger man gave Bob a man nod, which Bob returned and continued on his way.\r\r",
    "id": "7moqva41n6",
    "available": "is for sale"
  },
  {
    "title": "trumperbate.com",
    "meaning": "The act of delusionally self-rewarding oneself for the occurrance of a terrible event by publicly masturbating while simultaneously spamming Twitter.",
    "example": "Verb: Donald Trump unpresidentially trumperbated all over himself and the Twitter world when he \"appreciated\" the congratulations for the massacre in Orlando.\rNoun: Hey, did you see Trump's big trumperbate last night? He must have bust all over his small hands.",
    "id": "w61w1t1wrm",
    "available": "is taken"
  },
  {
    "title": "curve.com",
    "meaning": "one ya self, leave, bounce, or just plain and simple telling someone to get out of your face and go somewhere.",
    "example": "i'm tired of ya cats talkin junk, ya need to curve.",
    "id": "20wgruwgzm",
    "available": "is taken"
  },
  {
    "title": "asicalao.com",
    "meaning": "puerto rican slang for flawless, clean immaculate,",
    "example": "yo ese toyota esta asicalao.\r\ryo that toyotas flawless",
    "id": "k6qx5t87lm",
    "available": "is taken"
  },
  {
    "title": "canucklehead.com",
    "meaning": "A Canadian of limited intelligence.",
    "example": "That Canucklehead lit a cigarette while at the gas pump.",
    "id": "36y99bnow0",
    "available": "is taken"
  },
  {
    "title": "assholechair.com",
    "meaning": "The chairs located throughout a store where the unfortunate male who gets roped into shopping with a female companion ends up sitting. The hapless male usually ends up waiting for hours, and often while an important sporting event is on.",
    "example": "Yvonne: I'll be in the bra section.\rRachel: I'll be in the shoe department.\rL: I'll be in the asshole chair, twiddling my thumbs and plotting how to get in your respective pants.",
    "id": "v02wdijqn0",
    "available": "is available"
  },
  {
    "title": "snapchatstreak.com",
    "meaning": "If you snap chat your friend day after day and you get a number at the side of there name then that means you are on a snapchat streak. The number means the amount of days",
    "example": "'Someone do a snapchat streak with me?'",
    "id": "76zrytoj3m",
    "available": "is available"
  },
  {
    "title": "nowwatchthisdrive.com",
    "meaning": "Words uttered by President George W. Bush to the media (on a golf course) after announcing his serious stance on global terrorism. Brought to light from Michael Moore's Fahrenheit 9/11.\r\rQuickly becoming an Internet meme for either Bush's hypocrisy or a segue into a non-sequitor.",
    "example": "\"I call upon all nations to do everything they can to stop these terrorist killers. Thank you. Now watch this drive.\" (Swings)\r\r- G.W. Bush",
    "id": "w67wda17pm",
    "available": "is available"
  },
  {
    "title": "behavingbritish.com",
    "meaning": "The act of doing something you know you'll regret immediately after.",
    "example": "\"I always knew it was a terrible idea to vote 'leave', I guess I was just behaving British.\"",
    "id": "kmgxzhw8l6",
    "available": "is for sale"
  },
  {
    "title": "nsfk.com",
    "meaning": "Not\rSafe\rFor\rKidsA family friendly edition of NSFW(Not safe for work)",
    "example": "\"Son - What were you and mommy talking about\"\"Dad - Now son mommy and I were talking about something that is NSFK\"",
    "id": "904w4s8wj6",
    "available": "is taken"
  },
  {
    "title": "villagebicycle.com",
    "meaning": "Someone who is easy to ingage sexual activity on a regular basis and has no problem doing it with with various different individuals.",
    "example": "Niamh is such a village bicycle.\rYeah totally everyone gets a ride!",
    "id": "409qrbpxqm",
    "available": "is for sale"
  },
  {
    "title": "yuj.com",
    "meaning": "Short form for \"usual\".",
    "example": "What are you doing tonight? The yujé.",
    "id": "y6rxes15k6",
    "available": "is taken"
  },
  {
    "title": "crotchspiders.com",
    "meaning": "The pubic hair that sneaks out of a bikini bottom.",
    "example": "Man look at the crotch spiders on her. Impressive.",
    "id": "z65w5tyeg6",
    "available": "is taken"
  },
  {
    "title": "spange.com",
    "meaning": "To collect spare change, either from couches, passerbys on the street or any numerous other ways and means",
    "example": "Jimmy doesn't have enough money for the show, he will have to spange.",
    "id": "q6djli8rd6",
    "available": "is taken"
  },
  {
    "title": "outercourse.com",
    "meaning": "Pretty much the opposite of intercourse, except with clothes on. It consists of male/female couple rubbing up against each other for sexual pleasure.",
    "example": "Damn I literally just had an orgasm for the outercourse.I know! It was great.",
    "id": "90kw1uej80",
    "available": "is taken"
  },
  {
    "title": "homito.com",
    "meaning": "it's like homie ;\rfemale verion would be homita ;\ra good friend you're close to.",
    "example": "\"Eyy homito, que te pasa ?\"",
    "id": "y6npoagz80",
    "available": "is taken"
  },
  {
    "title": "iwtoywim.com",
    "meaning": "Stands for \"I will think of you when I masturbate\", A creepy message to put in the back of your classmates yearbooks.",
    "example": "\"Julie, HAGS! See you next year! IWTOYWIM!\"",
    "id": "omeqkigx9m",
    "available": "is taken"
  },
  {
    "title": "sexualequinox.com",
    "meaning": "It's the point in your life at which your age matches your number of sexual partners",
    "example": "Dude I just had an amazing weekend.Why? What happened?I hit my sexual equinox.Bro, that's amazing, especially at 45.",
    "id": "zmjp1sgj8m",
    "available": "is taken"
  },
  {
    "title": "pollotarian.com",
    "meaning": "A pollotarian (aka a pollovegetarian or a pollo-vegetarian) is someone who will not eat the flesh of any red meat mammals, but does include chicken, turkey and other poultry. They may or may not also exclude fish, seafood or products like eggs and dairy from their diet. Reasons for exclusion vary from taste preference to ethical issues.\rAlso seen as Pescetarianism, Semi-vegetarianism, Flexitarianism, Lacto-ovo vegetarianism \r",
    "example": "Many pollotarians buy there poultry from cage free farms.",
    "id": "4m3qzaqxe6",
    "available": "is taken"
  },
  {
    "title": "oldslippers.com",
    "meaning": "The genitals of a past significant other that after consideration and comparison are the ones you love the most",
    "example": "\"My girpelfriend said she missed my old slippers\"",
    "id": "90xgncqyl6",
    "available": "is taken"
  },
  {
    "title": "yopro.com",
    "meaning": "Short for \"young professional,\" especially presumptuous, self-interested types.",
    "example": "That bar is overrun by yopros in suits going on and on about their boring office jobs. Why are they acting twice their age?",
    "id": "26lo8h93q6",
    "available": "is taken"
  },
  {
    "title": "shavocado.com",
    "meaning": "A shaved scrotum of an adult male.",
    "example": "You can tell Johnny was quite proud of his shavocado as he entered the locker room showers.",
    "id": "q68y5f58p0",
    "available": "is taken"
  },
  {
    "title": "turkeytap.com",
    "meaning": "When someone (usually male) taps another male on the nutsack firmly enough to elicit a short burst of testicular pain.  ",
    "example": "\"Man, I actually prefer getting snapped in the ass with a wet towel in the locker room now that the football team started turkey tapping me after P.E.\"",
    "id": "46ppwiyd96",
    "available": "is taken"
  },
  {
    "title": "deleteyouraccount.com",
    "meaning": "The ultimate RT Twitter insult.Implies something just tweeted was so foolish, moronic, and pointless the person who wrote it should just close their account and walk away in shame.",
    "example": "Jeb Bush: (picture of a gun, titled) America\rEdward Snowden: delete your account",
    "id": "8mvzjulon0",
    "available": "is taken"
  },
  {
    "title": "breastie.com",
    "meaning": "A best friend of yours that has the same breast size as you",
    "example": "Kim: Hey look, it's my breastie Emma. Let's go say hi!Mark: Breastie?Kim: yeah, she's my bestie and has the the same breast size as me.Mark: let's forget we ever had this conversationKim: Agreed",
    "id": "7mopva41n0",
    "available": "is for sale"
  },
  {
    "title": "iafwu.com",
    "meaning": "i aint fucking with you",
    "example": "you're so annoying Jared, iafwu",
    "id": "w6151s1wrm",
    "available": "is taken"
  },
  {
    "title": "hypeartist.com",
    "meaning": "Someone who get's an audience riled up and hype, but they don't have much substance. Like a DJ or a lesser known opening artist before a performance.",
    "example": "Nigeria is a hype artist, but she doesn't ever know what she's talking about.",
    "id": "20w7rhwgzm",
    "available": "is taken"
  },
  {
    "title": "beforeface.com",
    "meaning": "The face you make right before you bust",
    "example": "Bruh my beforeface was crazy when we were doing it in that missionary position",
    "id": "k6qp5t87l0",
    "available": "is taken"
  },
  {
    "title": "comforttub.com",
    "meaning": "1 : For most girls, this is either a tub of any type of food (most of the time, ice cream) while she cries her heart out while watching romantic movies.\r2 : A bath tub with scattered rose petals and an aromatic smell, scented candles lit everywhere, so the broken-hearted girl can take a comforting wash.",
    "example": "Girl 1: Boo.. he broke my heart, boo!\rGirl 2: Bring out the \"Comfort Tub\"!",
    "id": "36y49tnow6",
    "available": "is for sale"
  },
  {
    "title": "healthyrelationshipweight.com",
    "meaning": "When she eating good & getting good dick from her nigga",
    "example": "\" my baby gained that healthy relationship weight \"",
    "id": "v02ddujqnm",
    "available": "is available"
  },
  {
    "title": "washandwank.com",
    "meaning": "To pleasure yourself in the shower. It's convenient because it kills two birds with one stone, the buckling down and the clean up.",
    "example": "Friend: Hey you wanna go to taco bell?\rMe: Sorry, I gotta do the ol' wash and wank\rFriend: Can I join?\rMe: Yee",
    "id": "76z9yaoj3m",
    "available": "is taken"
  },
  {
    "title": "bonerbungee.com",
    "meaning": "Strapping a relentless boner down with the elastic waist band of your boxers.",
    "example": "Jess: Jesus Mike, would you do something about that boner? It's making all the Pi Phi's uncomfortable.Mike: I can't, miss perfect tits just walked by and I nearly got Boner Narcolepsy.Jess: Well strap it down with a Boner Bungee, or someone's going to call campus police.",
    "id": "w673dc17p0",
    "available": "is taken"
  },
  {
    "title": "noice.com",
    "meaning": "Legit Bomb af",
    "example": "Hot Cheettos are pretty noice",
    "id": "kmgvzhw8lm",
    "available": "is taken"
  },
  {
    "title": "dickini.com",
    "meaning": "Synonymous with \"man thong\". A combination of \"dick\" and \"bikini\".",
    "example": "Cindy: Wow, Steve does not have enough package to be rocking that dickini. Not a good move.",
    "id": "904n4f8wj6",
    "available": "is for sale"
  },
  {
    "title": "butttoe.com",
    "meaning": "Like camel toe except in the rear; when your clothes are too tight and can see your butt crack through clothing.",
    "example": "1. If you have a camel toe problem or have had one, it is highly likely you have or will experience Butt Toe in your lifetime as well.2. What size are your pants? Must not be the right size because you have butt toe.\r3. Those yoga pants make you have butt toe.",
    "id": "4092rupxqm",
    "available": "is available"
  },
  {
    "title": "backburnergirl.com",
    "meaning": "It's the girl who you would possibly like to date if you weren't already attached so you string her along by asking her to do platonic activities.",
    "example": "If Shelly breaks it off with me I always have Nancy, my back burner girl.",
    "id": "y6rpes15km",
    "available": "is available"
  },
  {
    "title": "badplug.com",
    "meaning": "When you thought you were charging your phone but you actually weren't",
    "example": "My phone still has no juice, prolly had a bad plug last night.",
    "id": "z65e5ayeg6",
    "available": "is taken"
  },
  {
    "title": "boobstracted.com",
    "meaning": "*Having a hard time as a male to look a woman in the eyes because of her distracting front torso\r*Having a hard time as a male to focus on ANYTHING because of a distracting female torso in sight",
    "example": "I didn't noticed the yellow car, because I was boobstracted by Caroline. Sorry, you were saying? I was totally boobstracted, apologies.",
    "id": "q6d3lb8rd0",
    "available": "is for sale"
  },
  {
    "title": "reverseshade.com",
    "meaning": "Acting in a casual or complimenting manner towards someone. (Opposite Of Throwing Shade)",
    "example": "I Have Dis Friend And Like I Wanna Be Close Friends Wit Her But She Is Legit #Highkey Gorgeous Like Damnn😁😍💙 Reverse Shade",
    "id": "90k21aej80",
    "available": "is taken"
  },
  {
    "title": "bonernarcolepsy.com",
    "meaning": "A boner so strong that it drains the blood from your brain and causes you to faint",
    "example": "We saw a nice piece of ass walk by and Tim fainted from Boner Narcolepsy. I had no idea he had that strong a dong.",
    "id": "y6ngofgz80",
    "available": "is taken"
  },
  {
    "title": "deskstaging.com",
    "meaning": "The practice of covering your desk with papers, completed work, and other important-looking papers to give the appearance that you are really busy when really you're surfing the net, watching YouTube vids and doing other non-work things.",
    "example": "\"My realtor taught me this trick of staging my house for sale so I tried it at work, I started desk staging so it looked like I was too busy to take on another task and voila, my boss bought it!\"",
    "id": "ome1kagx96",
    "available": "is taken"
  },
  {
    "title": "romantichate.com",
    "meaning": "Romantic hate is defined when you hate someone, but you have a connection with them. You are the person's enemy, but you are always with them and you can't look away from them.",
    "example": "Those two hate each other , but they can't look away from each other. They must romantically hate each other.Sam: I hate him, but I can't get away from him\rBob: You must romantically hate him.\rSam:Really?\rBob: Yep. Romantic hate is when you hate someone, but you can't get away from them.",
    "id": "zmjy1hgj8m",
    "available": "is available"
  },
  {
    "title": "ff.com",
    "meaning": "f&f - flirt and forget. used after a break up, when you want to forget about your ex by flirting with other people.",
    "example": "person 1 : hey dude. heard about the break up. you alright?\rperson 2 : yeah, man. i'll just f&f.",
    "id": "4m3dzaqxe0",
    "available": "is taken"
  },
  {
    "title": "liefi.com",
    "meaning": "When your phone or tablet indicates that you are connected to a wireless network, however you are still unable to load webpages or use any internet services with your device",
    "example": "Person 1: Can you get any wi-fi here?Person 2: No, it says I'm connected but it's really just lie-fi",
    "id": "90x3niqyl0",
    "available": "is taken"
  },
  {
    "title": "getgrown.com",
    "meaning": "To get better, develop, or improve.",
    "example": "Keep practising and you'll get grown in no time.",
    "id": "26lz8h93q0",
    "available": "is taken"
  },
  {
    "title": "flipflocks.com",
    "meaning": "flip-flocks - The heinous combination of flip-flops and socks.",
    "example": "Dad, please do not wear your Flip-flocks in public.",
    "id": "q6835a58pm",
    "available": "is taken"
  },
  {
    "title": "nochillzone.com",
    "meaning": "You ain't got no chill, like you don't take shit lightly. Your zone is always turnt. There is no turning down when you are in your zone.",
    "example": "Rose had no chill zone when it came to tacos",
    "id": "46p9wiyd90",
    "available": "is taken"
  },
  {
    "title": "googleproved.com",
    "meaning": "When your trying to prove someone wrong and immediately refer to Google to debunk there theory",
    "example": "I lived in Hawaii for years and I love to eat pokeactually its pronounced po -kay\r*confirms with Google * I google proved you wrong #sorrynotsorry",
    "id": "8mvejslon0",
    "available": "is taken"
  },
  {
    "title": "oclockflop.com",
    "meaning": "the sensation that happens after eating carbs for lunch",
    "example": "I need chocolate...I've got the 3 o'clock flop",
    "id": "7mo4vu41n0",
    "available": "is available"
  },
  {
    "title": "dickwap.com",
    "meaning": "the act of slapping someone in the face with a penis-like object",
    "example": "Friend: Dude, whats that mark on your face?\rDude: Oh yeah, i got dick-wapped last night",
    "id": "w61r1b1wr0",
    "available": "is for sale"
  },
  {
    "title": "refriend.com",
    "meaning": "To pass your old hoe to one of your friends.",
    "example": "No bro don't unfriend her, just refriend her to me, so I can smash.",
    "id": "20wjrhwgzm",
    "available": "is taken"
  },
  {
    "title": "girlfriendtax.com",
    "meaning": "The amount of fries taken by your female significant other, after you've already asked her if she was hungry but she insisted she didn't want anything.",
    "example": "Boyfriend: \"Babe, stop eating my fries, you said you didn't want any!\"\rGirlfriend: \"Girlfriend tax; I'm not going to eat all of it!\"",
    "id": "k6qr5t87lm",
    "available": "is taken"
  },
  {
    "title": "dickheading.com",
    "meaning": "Taking a dick pick angling the camera up towards ones face, covering your head with your dick head. Resulting in an image of a dick with arms.",
    "example": "\"Bro my dickheading game is on point today \"",
    "id": "36yx9cnow0",
    "available": "is taken"
  },
  {
    "title": "pundint.com",
    "meaning": "A common misspelling of the word \"pundit,\" usually made by people with a fourth-grade education. ",
    "example": "A political pundint says radical /hatefull things to continue getting attention from the media.",
    "id": "v02qdhjqn0",
    "available": "is taken"
  },
  {
    "title": "ambm.com",
    "meaning": "Morning (AM) bowel movement (BM). The first poop of the day, almost always taken immediately upon awakening in the morning.A \"beer dump\" is a type of AM BM, but not all AM BMs are beer dumps.",
    "example": "\"I can't even start my day with some coffee until I've had my AM BM.\"\"I didn't have time for my AM BM this morning so I've had to hold that sh*t in all f*cking morning.\"",
    "id": "20wjjtwgzm",
    "available": "is taken"
  },
  {
    "title": "onmymama.com",
    "meaning": "honest to god, I swear on my mother!",
    "example": "Look joe, on my mama five o rolled up and we broke camp like a mother fucker!!",
    "id": "k6qrli87lm",
    "available": "is taken"
  },
  {
    "title": "emojiilliterate.com",
    "meaning": "Someone who doesn't know how to read an emoji.",
    "example": "I sent Tyler an emoji and he didn't understand, so he asked me what it meant. He is clearly emoji illiterate, but I can teach him the meaning to all of them.",
    "id": "36yxzhnow0",
    "available": "is available"
  },
  {
    "title": "boysmell.com",
    "meaning": "Boys smell like basic laundry detergent, plain soap, a little bit of protein powder, and fresh rubber.",
    "example": "*Walks into boy's dorm/apartment*\r\"It has a strong boy smell in here.\"",
    "id": "v02q7tjqn0",
    "available": "is available"
  },
  {
    "title": "spwl.com",
    "meaning": "text talk acronym standing for 'stroking penis while laughing'",
    "example": "person 1: \"I opened my personal laptop at a company meeting today. I forgot that the battery died while watching a porno last night. It was ten seconds of slurping, spitting and gagging. It was my first day.\"person 2: \"spwl\"",
    "id": "76zyeioj30",
    "available": "is taken"
  },
  {
    "title": "adulting.com",
    "meaning": "Adulting (v): to do grown up things and hold responsibilities such as, a 9-5 job, a mortgage/rent, a car payment, or anything else that makes one think of grown ups.",
    "example": "Used in a sentence: Jane is adulting quite well today as she is on time for work promptly at 8am and appears well groomed.",
    "id": "w67jlh17p6",
    "available": "is taken"
  },
  {
    "title": "ivaginaryfriend.com",
    "meaning": "An imaginary female that a male lies about having sex with.",
    "example": "Mike was bragging about having sex with Lucinda, who we all know is his Ivaginary Friend.",
    "id": "kmgo3tw8l6",
    "available": "is taken"
  },
  {
    "title": "burritoing.com",
    "meaning": "Burritoing (Verb) - The act of wrapping yourself in multiple blankets, nearing, but not reaching, the point of suffocation.",
    "example": "Cam was burritoing while watching a movie! He was so comfy wrapped up in all the blankets!",
    "id": "904kei8wj6",
    "available": "is taken"
  },
  {
    "title": "coolin.com",
    "meaning": "another word for chillin.hanging outin the house doing you.",
    "example": "john: hey wassup what you been up to?Michael: nothing just been coolin with the homies",
    "id": "409n3hpxqm",
    "available": "is taken"
  },
  {
    "title": "boobcuddle.com",
    "meaning": "When one rests their head on breast while cuddling. Fondling may or may not happen.",
    "example": "Rodrick gave Jess a boob cuddle last night",
    "id": "y6rynt15km",
    "available": "is available"
  },
  {
    "title": "dustyballs.com",
    "meaning": "A hood term used to describe when a man has not had sexual intercourse for a prolonged period of time.",
    "example": "Guy: Dude I just fucked the hottest bitch last night!Other guy: Aw man that sounds amazing. I haven't banged anybody in months.Guy: Daaaaamn you got dusty balls boy!",
    "id": "z65rgiyegm",
    "available": "is available"
  },
  {
    "title": "deadbeatkids.com",
    "meaning": "Having children that just aren't worth supporting",
    "example": "\"Let the state take care of them, they're deadbeat kids\"",
    "id": "q6d7qb8rd6",
    "available": "is for sale"
  },
  {
    "title": "wedmate.com",
    "meaning": "In the wake of the recent legalization of LGBT marriage in the U.S. , this gender-neutral noun refers to a person about to get married very soon or recently did so, for either LGBTQ or straight people. (synonyms: bride, groom).",
    "example": "For this rehearsal, I need the wedmates to go stand right in front of the minister and hold hands.Yes, I am getting married next week...may I introduce you to my wedmate, Terry?Congratulations to our new wedmates!",
    "id": "90kk3tej80",
    "available": "is for sale"
  },
  {
    "title": "getyourballswet.com",
    "meaning": "The phrase get your balls wet is intended to indicate that one must go balls deep or balls out giving one's activity 100% effort",
    "example": "This task requires that you must get your balls wet",
    "id": "y6nqlcgz86",
    "available": "is available"
  },
  {
    "title": "emotionalwhore.com",
    "meaning": "A person who shares the most intimate details of their life/heartbreak/feelings with strangers because it's cheaper than mental healthcare, and not subject to the same bias or advice that the person could receive from someone closer to the situation.",
    "example": "Give me a drink, and I'm an emotional whore! (Give me good advice and I'll even pick up your tab!)",
    "id": "omegzcgx96",
    "available": "is for sale"
  },
  {
    "title": "dirtydickhands.com",
    "meaning": "When a guy finishes using a urinal and, zero fucks given, exits the bathroom without washing his hands.\rAbbreviation: DDH",
    "example": "I saw Bob walk out of the bathroom then high-five Tim with his dirty dick hands .",
    "id": "zmjdkhgj8m",
    "available": "is taken"
  },
  {
    "title": "finnayack.com",
    "meaning": "When in absolute disgust one says \"finna yack\" meaning, I'm going to puke. Could also express disagreement or physical illness.",
    "example": "Ex. Person 1: \"That Cheeto you ate was on the ground\"Person 2: \"ew finna yack bro\"",
    "id": "4m34psqxe0",
    "available": "is available"
  },
  {
    "title": ".com",
    "meaning": "It's supposed to be a coy internet smiley face, resembling something like a cat, cuteness in nature.I personally think it looks like a ballsack mouth.",
    "example": "Woman: Meow!! :3Man: I'm gonna teabag your ass! :3",
    "id": "90x9jsqyl0",
    "available": "is taken"
  },
  {
    "title": "flexitarian.com",
    "meaning": "An occasional meat eater. Not a vegetarian, maybe not even intentionally avoiding meat.",
    "example": "David didn't even know he was a flexitarian at first, but he learned he was because he didn't eat meat every day.",
    "id": "26lnwa93q0",
    "available": "is for sale"
  },
  {
    "title": "ganic.com",
    "meaning": "Short for organic meaning better than fresh. Also means extremely cool or dope.",
    "example": "Yo dude, those kicks are fresh!\rNah bruh, they're ganic!Did you see that shot?\rYea man, it was ganic!This salad looks extra ganic!",
    "id": "q68kqb58p6",
    "available": "is for sale"
  },
  {
    "title": "batteryoperatedboyfriendbob.com",
    "meaning": "A vibrator or sometimes a dildo. For when you don't have a steady male companion and/or when he can't get you off.",
    "example": "Person1: You been seeing anyone lately?\rPerson2: No, it's just been me and BOB or a while now.\rPerson1: Bob?\rPerson2: Yeah my battery operated boyfriend (bob).",
    "id": "46pxyhyd90",
    "available": "is available"
  },
  {
    "title": "coloncrockpot.com",
    "meaning": "When your large intestine has been holding back waste for more than 48 hours and your farts are the leading indicator of what is to come.",
    "example": "Anne: You haven't pooped in a while Craig, what's going on?\rCraig: Everything seems to be cooking in the Colon Crockpot and \"dinner\" will be served shortly in the spare bathroom!",
    "id": "8mvgyslonm",
    "available": "is available"
  },
  {
    "title": "babysauce.com",
    "meaning": "Cum, semen whatever you call it when you nut",
    "example": "This girl I'm messing with wanted some uggs. I told her before that happened she had to swallow all the baby sauce",
    "id": "7mo3qi41nm",
    "available": "is taken"
  },
  {
    "title": "intensefuckery.com",
    "meaning": "When you are tired/bored and sober, and fuck around too much and end up doing something you will regret",
    "example": "yo that was some Intense Fuckery when you licked your nipple the other day and sent it to us",
    "id": "w6175c1wr6",
    "available": "is taken"
  },
  {
    "title": "fancybitch.com",
    "meaning": "A classy, elegant, self-sufficient woman who carries herself with dignity and pride and takes no shit from any bitch, male or female.",
    "example": "Mila Kunis was an immigrant who came to America, with alomost nothing. She worked hard to achieve what she wanted in life and now she is a fancy bitch!",
    "id": "20w4jbwgzm",
    "available": "is taken"
  },
  {
    "title": "tbnr.com",
    "meaning": "The Best Never Rest",
    "example": "Some guy: DUDE I DIDNT SLEEP AT ALL LAST NIGHT!\rOther guy: why?\rSome guy: TBNR",
    "id": "k6qllc87lm",
    "available": "is taken"
  },
  {
    "title": "beatupversion.com",
    "meaning": "noun: Someone who is a lookalike, or doppelganger, for another person, but less attractive. While it usually refers to physical appearance, the term is versatile and can, in theory, also be applied to inferior versions of non-human things/animals or used to compare one individual negatively to another in terms unrelated to physical attractiveness.",
    "example": "Spencer Pratt is a beat-up version of Charlie Hunnam.Charlie Puth sings like a beat-up version of Sam Smith.Mello Yello is a beat-up version of Mountain Dew.",
    "id": "36yrzunow0",
    "available": "is available"
  },
  {
    "title": "dickweed.com",
    "meaning": "The process of grinding very loud/dank weed then spilling it all over your pants (presumable the crotch area) then attempting to pack the spilt weed into the bowl",
    "example": "\"Bro I just dickweed .\"",
    "id": "v02g7hjqnm",
    "available": "is for sale"
  },
  {
    "title": "frenchbite.com",
    "meaning": "In the middle of making out you gently bite the other person's nose, often licking it a bit while doing it.",
    "example": "I gave Shauna I french bite yesterday!",
    "id": "76z5efoj36",
    "available": "is for sale"
  },
  {
    "title": "bathofshame.com",
    "meaning": "Taking a bath after an embarrassing/undesirable sex act",
    "example": "Dude, after what I did to myself last night I needed to take a bath of shame.",
    "id": "w67dlc17p6",
    "available": "is available"
  },
  {
    "title": "boyfrienddick.com",
    "meaning": "A penis that is of reasonable size that one could receive on a daily basis. As opposed to vacation dick.",
    "example": "I hooked up with a guy last night who had boyfriend dick. It was perfect.vacation dick\rsize queen",
    "id": "kmg93fw8l6",
    "available": "is available"
  },
  {
    "title": "replychug.com",
    "meaning": "To send a Snapchat video of you/your friends chugging an alcoholic beverage, prompting your recipients to reply with a chug video of their own.",
    "example": "Take a video of me chugging this beer, so I can send it out for reply chugs.",
    "id": "9049ei8wjm",
    "available": "is taken"
  },
  {
    "title": "frumptydumpty.com",
    "meaning": "Someone who is extremely frumpy.",
    "example": "Frumpty Dumpty sat on a wall, Frumpty Dumpty had no style at all.",
    "id": "409v3hpxq6",
    "available": "is available"
  },
  {
    "title": "analtwitch.com",
    "meaning": "1:The involuntary spasming of muscles around the anus.\r2: a person so annoying and obnoxious that they can only be referred to as an \" anal twitch\".",
    "example": "\" that guy over there is such an anal twitch!\"",
    "id": "y6rjns15km",
    "available": "is available"
  },
  {
    "title": "homiefund.com",
    "meaning": "When you spot ur homie something like money, chronic, drank or whatever not expecting him to pay you back. Simply cause you know he's gonna spot you some time in the future.",
    "example": "Homie1: Damn this steak is 20 bucks! I only got 10.\rHomie2: I got you. Don't worry about it, just put it on the homie fund.",
    "id": "z65vgbyeg0",
    "available": "is taken"
  },
  {
    "title": "assliquid.com",
    "meaning": "When you've eaten something that has totally fucked up your stomach.\rThen when you shit its a liquidy substance called ass liquid",
    "example": "Yo I have no fucking idea what I ate but I've been pushing ass liquid for 3 days straight",
    "id": "q6d8qa8rdm",
    "available": "is taken"
  },
  {
    "title": "sockmarks.com",
    "meaning": "The indentations left on the calves or ankles as a result of wearing tight socks;",
    "example": "I'm heading to the gym after work today and I only brought shorts. Damn, I guess I won't be able to conceal my sock marks.",
    "id": "90k93tej86",
    "available": "is taken"
  },
  {
    "title": "freshairbreak.com",
    "meaning": "A way to say \"ciggarette break\" without your boss knowing that you're going to have a smoke. Especially useful in non-smoking environments. The term \"fresh air\" can also be used to mean \"ciggarette\" but is not typically necessary and doesn't sound right in most contexts.",
    "example": "Employee 1: I'm going out for a fresh air break\rBoss: Ok, just be back in 15\rEmployee 2: (whisper) He doesn't know you mean you're going for a smoke?\rEmployee 1: (whisper) No! That's the point!",
    "id": "y6ndltgz80",
    "available": "is available"
  },
  {
    "title": "halfdaytony.com",
    "meaning": "A person who starts a new job and quits after only half a day. Typically goes to lunch, never to return.",
    "example": "\"Where's the new guy? Didn't he go to lunch... like 2 hours ago?\"\r\"Uh ohh, he's not coming back is he? Don't tell me another one's done a half-day Tony?\"\r\"Fuck.\"",
    "id": "omeyzugx96",
    "available": "is taken"
  },
  {
    "title": "imdying.com",
    "meaning": "A term commonly used on the internet for when someone is laughing very hard or simply can't stop laughing.",
    "example": "Oh my god I'm dying, rip me. That was so fucking funny.",
    "id": "zmjqktgj80",
    "available": "is taken"
  },
  {
    "title": "huluandhandjobs.com",
    "meaning": "Like netflix and chill, and amazon and anal but with more sexual activity.",
    "example": "Sharkisha: Wanna come over for netflix and chill tonight?\rQuan: Nah..\rSkarkisha: How bout some Amazon and Anal?\rQuan : No sorry\rSkarkisha: Fine maybe some hulu and handjobs?\rQuan: Yes of course!",
    "id": "4m3vpiqxe0",
    "available": "is available"
  },
  {
    "title": "stonersparadise.com",
    "meaning": "any store with a lot of food",
    "example": "Damn let's go to stoner's paradise i'm getting the munchies.",
    "id": "90x2jiqylm",
    "available": "is taken"
  },
  {
    "title": "shithowdy.com",
    "meaning": "A greeting, primarily used in western states, expressing shock and amazement in association with the unexpected arrival of a former lover or spouse.",
    "example": "\"Is that----?  Shithowdy\"\r(Oh shit)\r(Shit)\r(Holy shit)\r(No shit)\r(Damn)",
    "id": "26lrwt93q6",
    "available": "is taken"
  },
  {
    "title": "slobbedherdown.com",
    "meaning": "A lot of passionate kisses.",
    "example": "He really slobbed her down.",
    "id": "q68vqb58p0",
    "available": "is available"
  },
  {
    "title": "babybeard.com",
    "meaning": "When a man attempts to grow a beard but his facial hair is so thin and inconsistent, it's as if it were a baby beard",
    "example": "When I told my man I liked facial hair, he decided to let it grow but all I see is a baby beard!",
    "id": "46pnyfyd9m",
    "available": "is taken"
  },
  {
    "title": "ladycork.com",
    "meaning": "an alternative term for a tampon.",
    "example": "I can't wait until the end of this week when I can stop wearing a lady cork and stop wearing panties.",
    "id": "8mv8yblon0",
    "available": "is taken"
  },
  {
    "title": "shitakki.com",
    "meaning": "Similar to the act of buckakki, but replacing cum with shit.",
    "example": "My girl made her famous chili for dinner and I gave her shitakki for dessert.",
    "id": "7mokqs41n6",
    "available": "is available"
  },
  {
    "title": "dickplease.com",
    "meaning": "Finally, a phrase for women to use with men that is just like the phrase \"bitch please\".",
    "example": "When Sally's man gave her shit about coming home late after being out with the girls, all she had to say was \"Dick please!\" before making a grilled cheese and passing out.",
    "id": "w61o5u1wr0",
    "available": "is taken"
  },
  {
    "title": "brogetit.com",
    "meaning": "When your bro says or does something dumb but you're willing to forget it... brogetit.",
    "example": "Bro: \"Hey man, sorry for puking in your Mom's hamper last night, thought I was in the bathroom.\"\rBroseph: \"No worries man, it happens. Brogetit.\"\rBro: \"Cool.\"",
    "id": "20wyjfwgzm",
    "available": "is for sale"
  },
  {
    "title": "ladysnores.com",
    "meaning": "When a lady dozes off and begins to snore so faintly it's almost difficult to know she's even sleeping.",
    "example": "John's Ho fell asleep on the couch again, but I don't mind because her lady snores are so soft.",
    "id": "k6qels87l6",
    "available": "is available"
  },
  {
    "title": "abakersshitton.com",
    "meaning": "When there is way more than a Baker's dozen, a shit ton, \"A Baker's Shit Ton\".",
    "example": "Dude A: \"Yo, we need a Shit Ton of donuts for this morning's wake and bake!\"\rDude B: \"Like a Baker's Dozen?\"\rDude A: \"Yes, only more like a Baker's Shit Ton!\"\rDude B: \"I get it brah, bitches gonna smile like donuts.\"",
    "id": "36yzzunowm",
    "available": "is available"
  },
  {
    "title": "typovirus.com",
    "meaning": "Malware obtained by incorrectly typing a web URL in the browser or accidentally clicking on the wrong link in search results",
    "example": "I totally mistyped the YouTube address in my browser yesterday . Now I have to take my laptop to the Geek Squad to get the typo virus removed.",
    "id": "v02v7ajqnm",
    "available": "is available"
  },
  {
    "title": "thotcrime.com",
    "meaning": "an instance of controversial or forbidden thot-like behavior, i.e. acting as outlandishly promiscuous or slutty as humanly possible",
    "example": "That hoe over there was engaged in so many sexual acts with various men that when her friend found out, she told her that she was guilty of thotcrime",
    "id": "76z7euoj30",
    "available": "is available"
  },
  {
    "title": "friendlyfade.com",
    "meaning": "A passive-aggressive method to 'break up' with a friend without being hurtful. Similar to ghosting, this method is NOT an abrupt process and can apply to just about anyone. Care should be taken when choosing this strategy:• Take longer and longer intervals to return phone calls, text messages, etc.. and avoid making commitments. For ex: take a week to return a voicemail or a few days for a text. As the weeks go by, the lag between all communications gradually increases.• Never answer the phone if you see that person's number on your caller ID. Wait at least a week to return the message (unless it's an emergency), preferably via text.• Avoid face-to-face meetings (like coffee or lunch) and make excuses to skip activities you both enjoyed previously (like going to the movies).The goal is to gently un-friend that person at a kind and gingerly pace. It can be a very effective method for those averse to conflict or part of tightly knit groups. Over time, your feelings may change, and you may want to rekindle the friendship. With this method, you haven't burned all your bridges.",
    "example": "After years of being told by her best friend that she needed to lose weight, Lizzie decided to do the friendly fade. She started by avoiding her phone calls, not replying right away to her texts, and making her invisible on her Facebook timeline.",
    "id": "w67vls17p6",
    "available": "is available"
  },
  {
    "title": "postporndepression.com",
    "meaning": "That moment after you finished watching some sick, fucked-up, porno and your just sitting there thinking \"What the hell is wrong with me?\" While you ponder life and shit.",
    "example": "Dude, I just watched some bondage beastiality orgy porn video last night and I immediately had post porn depression.",
    "id": "kmgz3aw8l0",
    "available": "is available"
  },
  {
    "title": "armcardio.com",
    "meaning": "Masturbation",
    "example": "Since his girlfriend broke up with him, he's really been getting in a lot of arm cardio.",
    "id": "904vec8wj0",
    "available": "is available"
  },
  {
    "title": "opooportunity.com",
    "meaning": "When one who has to defecate has an opportunity to relieve themselves after waiting for a period of time.",
    "example": "Brad had to shit for an hour but because he was at his girlfriend's parent's anniversary party, he couldn't find the right opooportunity until the old folks retired for the evening, then he let the floodgates open.",
    "id": "409k3tpxqm",
    "available": "is available"
  },
  {
    "title": "snakemeal.com",
    "meaning": "One extremely large meal consumed in a day as opposed to the standard three.",
    "example": "\"I generally don't wake up hungry, but when I do get around to eating it ends up becoming a snakemeal.\"",
    "id": "y6rknc15k0",
    "available": "is available"
  },
  {
    "title": "swampass.com",
    "meaning": "Some one who does not wipe there ass or has not tooken a shower recently and stinks like shit",
    "example": "My cousin lenny smells like swamp ass after playing battlefield for 5 hours straight.",
    "id": "z659gcyegm",
    "available": "is taken"
  },
  {
    "title": "electrichammer.com",
    "meaning": "When you touch someone or something with your erect penis and it releases static electricity.",
    "example": "I accidentally gave my spouse the electric hammer and now I can only pleasure them after rubbing my stocking feet against a carpeted floor.",
    "id": "q6dxqs8rd0",
    "available": "is taken"
  },
  {
    "title": "boytrapped.com",
    "meaning": "(adj.) Describes the sensation of realizing that there are too many boys around.",
    "example": "Jess: Why did you run out onto the porch?\rMichele: I couldn't take it in there. I was boytrapped.",
    "id": "90k73cej8m",
    "available": "is taken"
  },
  {
    "title": "fivesecondruleoftexting.com",
    "meaning": "The rule stating a DOUBLE TEXT is ok AS LONG AS the second text message is sent within 5 seconds of the first.",
    "example": "I double texted Shelly, but it was ok cuz I used the Five Second Rule of Texting.",
    "id": "y6n9ligz8m",
    "available": "is available"
  },
  {
    "title": "onyourknees.com",
    "meaning": "To get down on your knees and suck his cock! Or dick, penis, or whatever.",
    "example": "Get on your knees. bitch!",
    "id": "omelzugx90",
    "available": "is taken"
  },
  {
    "title": "assholebaby.com",
    "meaning": "When you become pregnant from having anal sex the baby is called an \"asshole baby\"",
    "example": "We didn't have condoms and thought anal would be safer, little Johnny is an asshole baby!",
    "id": "zmjzkagj80",
    "available": "is available"
  },
  {
    "title": "emailfluff.com",
    "meaning": "Stroking another one's ego to make yourself noticed by higher ranks in group email",
    "example": "That guy is email fluffing his way to a promotion",
    "id": "4m3gpaqxe0",
    "available": "is taken"
  },
  {
    "title": "kickingdicks.com",
    "meaning": "Doing nothing.\rNot doing anything useful.",
    "example": "This Iryna was just kicking dicks all day long instead of working.",
    "id": "90xljhqyl0",
    "available": "is taken"
  },
  {
    "title": "bootygasm.com",
    "meaning": "a climax of sexual excitement, characterized by feelings of pleasure and euphoria as a result of stimulation to the prostate.",
    "example": "Yeh, bro, my girl loves pegging me until I have multiple bootygasms!",
    "id": "26lgws93qm",
    "available": "is available"
  },
  {
    "title": "amradioandchill.com",
    "meaning": "A primitive version of \"Netflix and chill\", which older generations did and what some hipsters still do.",
    "example": "little kid: \"Grandpa, where did I come from?\"\rGrandpa: \"Well kid you're grandma and I made whoopee in the back of a station-wagon to the sound of sweet static that was part of AM radio and chill, which led to your daddy, which led to you!\"Guy: \"Hey we could Netflix and chill\"\rHipster girl: \"I'm more of an AM radio and chill kind of person\"\rGuy: \"If you say so, Daisy Buchanan...\"",
    "id": "q68dqf58p0",
    "available": "is available"
  },
  {
    "title": "dbi.com",
    "meaning": "Don't Bang ItAdvising someone not to have sexual relations with a person or object",
    "example": "Person: That mouse-trap has been eyeing me up, I think it likes me...\rSane friend: Dbi",
    "id": "46p5ybyd9m",
    "available": "is taken"
  },
  {
    "title": "procaffenating.com",
    "meaning": "(n.) The tendency not to start anything until you've had a cup of coffee.",
    "example": "I am procaffenating with my project starts until I am shaking and twitching.",
    "id": "8mv3ytlon6",
    "available": "is available"
  },
  {
    "title": "jeanjerking.com",
    "meaning": "The act of two individuals rubbing pelvic regions against each other in order to cause orgasm (implied while wearing denim trousers). Similar to dry-humping and \"OTPHJ\" (over-the-pants-hand-job).",
    "example": "It was casual Friday when I walked in the middle school bathroom only to find my history and Spanish teacher jeanjerking in the handicap stall. Good thing I didn't come in a few minutes later to see the full-on OTPHJ.",
    "id": "7morqi41nm",
    "available": "is taken"
  },
  {
    "title": "napahoe.com",
    "meaning": "A piece of ass asleep in your bed.",
    "example": "I awoke hungover and feeling horny, when to my surprise I rolled over and brushed up against a sleeping napahoe I'd miraculously wrangled home.",
    "id": "w61z5h1wrm",
    "available": "is taken"
  },
  {
    "title": "stresshold.com",
    "meaning": "a stress threshold; the most stress that can be tolerated in a given situation",
    "example": "\"Girl, I've gotta quit my job! My boss is always nagging me, and I've reached my stresshold!\"",
    "id": "20wxjfwgz6",
    "available": "is available"
  },
  {
    "title": "stopandgo.com",
    "meaning": "When you're watching porn and you don't wanna climax just yet, so you stop for a moment, and go again. Often is repeated multiple times.",
    "example": "I was watching a really hot video last night, so hot that I had to keep using the stop and go method!",
    "id": "k6qdlt87l0",
    "available": "is taken"
  },
  {
    "title": "snoozefeed.com",
    "meaning": "The act of browsing your newsfeed in lieu of getting out of bed",
    "example": "Noun: \"I was checking my snooze feed because it was too cold to get out of bed, then my boss fired me via text\"Verb: \"Anna likes snoozefeeding for 20 minutes when her alarm goes off at 6:45am every morning.\"",
    "id": "36y8zbnowm",
    "available": "is taken"
  },
  {
    "title": "lifi.com",
    "meaning": "When you see a free wi-fi connection, join the network but it makes you sign up to some bullshit or tries to charge you.",
    "example": "Hells yeah this place has free wifi.......\rNevermind, its just li-fi pretending to be free.",
    "id": "v0277bjqnm",
    "available": "is for sale"
  },
  {
    "title": "eddiction.com",
    "meaning": "An addiction to electronic devices such as laptops, smartphones, and tablets. Eddiction is characterized by the constant need to check your smartphone for the latest Facebook posts, Twitter updates, news, etc. People with eddiction prefer spending time browsing the Internet over social interaction.",
    "example": "Matt suffers from eddiction. He's always updating his Twitter and posting instagram pics instead of chilling with me, the big brother he never had.",
    "id": "76zpetoj30",
    "available": "is for sale"
  },
  {
    "title": "shebad.com",
    "meaning": "A hoe that is good at what she does.",
    "example": "\" ayyy ayyy she bad\"\" oh yea she bad\"",
    "id": "w675ls17pm",
    "available": "is taken"
  },
  {
    "title": "staturbated.com",
    "meaning": "To become sexually aroused by one score in a video game/sport/etc.",
    "example": "I just staturbated over that game of league we just had.",
    "id": "kmgp3uw8lm",
    "available": "is taken"
  },
  {
    "title": "oreolization.com",
    "meaning": "The realization that oreos are still in your kitchen.",
    "example": "Quebec got oreolization while he was sitting at his computer.",
    "id": "9044ec8wj0",
    "available": "is taken"
  },
  {
    "title": "afterpoop.com",
    "meaning": "The smell that's left inside a bathroom after someone else has taken a poop. This is an unpleasant smell (unless you like other people's poop smells), and definitely not a smell you'd like to shower in.",
    "example": "Roommate #1: Did you just go poop in there?\rRoommate #2: Yeah, man. Just had a huge cup of coffee and had to go!\rRoommate #1: Alright, I'll use the upstairs bathroom. I don't want to shower in your afterpoop.",
    "id": "409r3hpxq0",
    "available": "is available"
  },
  {
    "title": "honeydude.com",
    "meaning": "like a sugar daddy. without the age gap.",
    "example": "Why have a sugar daddy when you can have a honeydude ? They last longer.",
    "id": "y6rgnh15km",
    "available": "is for sale"
  },
  {
    "title": "bellybomb.com",
    "meaning": "A food that hits your stomach long after you've eaten it, meaning you can eat way too much of it. Usually makes you very sluggish after.",
    "example": "Guy: Dude, you coming?\rGuy 2: Nah... that hero was a belly bomb. Not gonna be moving for another few hours",
    "id": "z657ghyeg0",
    "available": "is taken"
  },
  {
    "title": "fakeitforthegram.com",
    "meaning": "When you fake a picture to get likes on Instagram",
    "example": "I saw a dope Ferrari so I took a picture and had to fake it for the gram.",
    "id": "q6dkqt8rdm",
    "available": "is available"
  },
  {
    "title": "paragraphtexter.com",
    "meaning": "Someone who types long responses to a text",
    "example": "\"Wow, Hannah just sent me a really long responce. She's a paragraph texter\"",
    "id": "90k83sej80",
    "available": "is available"
  },
  {
    "title": "imaxandclimax.com",
    "meaning": "Netflix and chill, but to the next level. It means you are going to climax with your partner while an IMAX is playing in the background. It's for adults and risk takers, while Netflix and chill is simply for children.",
    "example": "Person 1: \"Hey, wanna come back to my place and watch Netflix and chill?\"\rPerson 2: \"Nah, I prefer to IMAX and climax. It insures optimum pleasure.\"",
    "id": "y6nyltgz80",
    "available": "is available"
  },
  {
    "title": "handcestors.com",
    "meaning": "HANDCESTORS, all the ancestors never to be born due to male masturbation.",
    "example": "I wiped those handcestors off on a dirty sock.",
    "id": "omenztgx9m",
    "available": "is available"
  },
  {
    "title": "boyfriendcredit.com",
    "meaning": "When a boyfriend or a husband does something nice for their girlfriend/wife, this gives them an opportunity to do something fun without fear of nagging.",
    "example": "Friend-\"Hey man, are you sure it's cool with your girlfriend that you're out here fishing on a Sunday afternoon while she's at her aunt's birthday party?\"Me-\"Yeah it's cool. I bought her flowers the other day so I've got boyfriend credit.\"",
    "id": "zmjlktgj86",
    "available": "is taken"
  },
  {
    "title": "yuge.com",
    "meaning": "A variation of the word HUGE commonly used by Donald Trump.",
    "example": "Hey Don, are you building that tower across 5th Avenue?\rDonald Trump: Yes, it's going to be YUGE!!",
    "id": "4m32pcqxe6",
    "available": "is taken"
  },
  {
    "title": "blewupthebathroom.com",
    "meaning": "When lower gastrointestinal distress is relieved in the bathroom, and the resulting semi- to fully- liquefied remains and flatulence leaves a lingering odor long after the person has left the bathroom",
    "example": "I don't know what he ate, but man, he blew up the bathroom! You won't want to go in there for a while.",
    "id": "90xqjtqylm",
    "available": "is available"
  },
  {
    "title": "iciclefingers.com",
    "meaning": "When your fingers are so cold texting is almost impossible.",
    "example": "Guy: Hyey hoe are yiu doing?\rGuy 2: What?\rGuy: Sorry man I got icicle fingers",
    "id": "26lpwh93qm",
    "available": "is available"
  },
  {
    "title": "condomgame.com",
    "meaning": "Thisis a game that can have as many or as little amount of players as u want.  it is played in a supermarket.  u grab a box of condoms and follow and unsuspecting shopper.  while they arent looking u slip the condoms into their shopping.  Then u follow them to the checkout and see what happens.  You score a point if they dont notice and purchase them. but if they notice them and put them aside u get nothing.  a fun game to play.",
    "example": "Lachie won the condom game because the granny purchased them.",
    "id": "q689qb58pm",
    "available": "is for sale"
  },
  {
    "title": "onaseriousnote.com",
    "meaning": "Used in when a speaker is changing the conversation from a humorous note to a serious one. The speaker uses \"on a serious\" to warn his/her companion that he/she is going to shift the gear of the conversation to a serious note.",
    "example": "On a serious note, she is beautiful in her own way.",
    "id": "46pzyfyd9m",
    "available": "is taken"
  },
  {
    "title": "tanstafl.com",
    "meaning": "There Ain't No Such Thing as A Free Lunch.\r\rVery old slang, dating back to before ain't became a legitimate English contraction.\r\rI means that a prospect is too good to be true(TGTBT), in that you are being offered something for nothing.",
    "example": "Nate: Your eMail says Bill Gates will give you $250 for each person you send this to that sends it to someone else.\r\rUncle Dick: TANSTAFL.",
    "id": "8mv5yalon0",
    "available": "is taken"
  },
  {
    "title": "warningtap.com",
    "meaning": "The universal tap given (usually on a thigh), signaling an impending ejaculation.",
    "example": "He was such a gentalman. He give me a warning tap when I was on top.",
    "id": "7mo2qb41n6",
    "available": "is taken"
  },
  {
    "title": "craptrap.com",
    "meaning": "1. Purposely stinking up the toilet before your roommate or significant other needs to use the bathroom.\r2. Walking into the bathroom after forgetting you took a stinky dump just minutes earlier.",
    "example": "I was running late when rushed back into the bathroom to brush my teeth. I quickly realized my horrible mistake. I walked in on my own smelly craptrap.",
    "id": "w61v5i1wr6",
    "available": "is for sale"
  },
  {
    "title": "dickchips.com",
    "meaning": "dikchip\r-noun\rChips that have been contaminated by someone who puts their hand in the bag after going to the bathroom, WITHOUT washing their hands.",
    "example": "Stay away from the Cheetos, unless you like dick chips!",
    "id": "20wdjhwgzm",
    "available": "is available"
  },
  {
    "title": "kneecleavage.com",
    "meaning": "A pair of knees that when picture is taken could appear to be cleavage.",
    "example": "This morning my coffee looked fantastic on my knee cleavage.",
    "id": "k6q7lc87l0",
    "available": "is taken"
  },
  {
    "title": "onmymichelleobama.com",
    "meaning": "Used in Fifth Harmony's song “BO$$”, has a similar meaning as fleek but also involves having a healthy body and diet of vegetation.",
    "example": "Person 1: How's that diet going?\rPerson 2: Gurl, I'm on my Michelle Obama! I had some turnips and my body feels great!",
    "id": "36ynzfnowm",
    "available": "is available"
  },
  {
    "title": "nahbihh.com",
    "meaning": "No girl.\rAka, get the fuck out.",
    "example": "\"Can I come over tonight?\"\r\"Nah bihh, you not special.\"",
    "id": "v02y7hjqnm",
    "available": "is taken"
  },
  {
    "title": "arcticfarts.com",
    "meaning": "farts brought on by eating whale blubber in the dead of winter; you cannot escape them by going outdoors because its too cold",
    "example": "His arctic farts cleared the side of the igloo.",
    "id": "20wddswgzm",
    "available": "is available"
  },
  {
    "title": "powerballing.com",
    "meaning": "To gyrate ones testicles while copulating ",
    "example": "Last night I was totally powerballing your mom.",
    "id": "k6q7nh87l0",
    "available": "is taken"
  },
  {
    "title": "idfka.com",
    "meaning": "I dont fucking know anymore",
    "example": "Idfka man",
    "id": "36ynkbnowm",
    "available": "is for sale"
  },
  {
    "title": "friendshipcuddle.com",
    "meaning": "The akward cuddle between two friends who are not trying to go to far",
    "example": "Man she jus wanna friendship cuddle",
    "id": "v02y5tjqnm",
    "available": "is for sale"
  },
  {
    "title": "bitchplosion.com",
    "meaning": "an explosion of bitchiness\rwhen someone/something pushes you so far that you just bitchplode",
    "example": "\"Dude... I was just joking and then she just had a massiv bitchplosion\"",
    "id": "76zo1hoj3m",
    "available": "is taken"
  },
  {
    "title": "finnagetcrunk.com",
    "meaning": "Finna get crunk is when someone asks you if are ready to turn up/party or get lit.",
    "example": "Person 1: \"You guys finna get crunk?!\rPerson 2: \" hell yea finna get crunk! ✌🏽️\"",
    "id": "w67lnt17p0",
    "available": "is available"
  },
  {
    "title": "shitstreet.com",
    "meaning": "Where you are when everything has gone wrong!",
    "example": "Lost the big sale, and now we're up shit street!",
    "id": "kmg25hw8l0",
    "available": "is taken"
  },
  {
    "title": "beefytits.com",
    "meaning": "Manly tits or saggy man boobs",
    "example": "That fat guy over there has some beefy tits",
    "id": "904jlc8wj0",
    "available": "is taken"
  },
  {
    "title": "wowfuck.com",
    "meaning": "(noun): a state of mind carrying a degree of similarity to mindfuck; when one is so incredibly overwhelmed by positive emotion and/or refusal to believe in the concurrent situation that the only words traversing both their brain and mouth are 'wow' and 'fuck'.",
    "example": "He was unable to speak for the sheer amount of wowfuck clouding his brain as he found her in his arms.",
    "id": "409p9hpxq6",
    "available": "is taken"
  },
  {
    "title": ".com",
    "meaning": "What people say when they dun understand what the fuck ur saying",
    "example": "A: Hey, is quantum mechanices a form of elopitcly?\rB: ??",
    "id": "y6re9f15k0",
    "available": "is taken"
  },
  {
    "title": "stepfucker.com",
    "meaning": "somebody who is fucking your mom and is not your real dad. sometimes called \"Step-Douche\", \"Step-Ass\" and so on.",
    "example": "Alyssa: Why are you so sad?\rJess: My step-fucker just found me smoking grass.",
    "id": "z65qzfyeg6",
    "available": "is taken"
  },
  {
    "title": "netflixandjill.com",
    "meaning": "When you watch Netflix alone and jerk off.",
    "example": "As Ryan stared into his television screen he realized that this Netflix and Jill session would end more quickly than he anticipated.Toward the end of Drew's Netflix and Jill session he realized that he ruined a good pair of socks",
    "id": "q6dvpu8rd6",
    "available": "is available"
  },
  {
    "title": "fecallychallenged.com",
    "meaning": "A person suffering from severe constipation.",
    "example": "Doug has been fecally challenged ever since he started taking his psych meds.",
    "id": "90k4gbej8m",
    "available": "is available"
  },
  {
    "title": "instagrambae.com",
    "meaning": "someone who likes all your Instagram pictures and gives you shoutouts and acts like Yall a couple over instagram",
    "example": "Dang who this girl liking all ya pics on IG?That's my Instagram Bae",
    "id": "y6n52sgz86",
    "available": "is available"
  },
  {
    "title": "daddytalk.com",
    "meaning": "A girl calling her man daddy like \"Fuck me daddy\"",
    "example": "-\"I love when she calls me daddy\"\r-\"Oh, you mean daddy talk?\"",
    "id": "omeovagx90",
    "available": "is taken"
  },
  {
    "title": "foreveralone.com",
    "meaning": "Being Single",
    "example": "I Am Forever Alone.",
    "id": "zmjgjsgj8m",
    "available": "is taken"
  },
  {
    "title": "petextrian.com",
    "meaning": "n. One who texts while walking, usually unaware of their surroundings.",
    "example": "John spilled hot coffee all over himself when the petextrian ahead of him stopped short.",
    "id": "4m3ejcqxe6",
    "available": "is for sale"
  },
  {
    "title": "schlonged.com",
    "meaning": "To be cockslapped by a man with a large penis.",
    "example": "'Shit that teenage mum just got schlonged by that hobo!'",
    "id": "90xpzhqyl6",
    "available": "is taken"
  },
  {
    "title": "uglysleep.com",
    "meaning": "Acquired during the deepest stages of a much-needed restful night; when you're so sleep, you sleep through alarms, often with mouth ajar, face planted against the sheets.",
    "example": "I tried to wake you up in time for the bus but you were in a deep ugly sleep. I couldn't bring myself to interrupt",
    "id": "26l9xi93q6",
    "available": "is for sale"
  },
  {
    "title": "poormouthing.com",
    "meaning": "Someone who has money, but goes around complaining how they don't have enough cash to pay their bills or buy food,",
    "example": "she has a spit shined brand new lexus in the driveway, so i dont want to hear her poormouthing herself when its time to pay her rent.",
    "id": "q688yh58p6",
    "available": "is taken"
  },
  {
    "title": "ifuz.com",
    "meaning": "I'm down. I'm cool with that. I fucks with that.",
    "example": "\"Y'all like this party?\"\"Yeah I fuz\"",
    "id": "46pk9cyd9m",
    "available": "is taken"
  },
  {
    "title": "yelpspecial.com",
    "meaning": "What restaurant owners give to the special snowflake Yelp reviewers. Usually consists of a \"special\" surprise, including but not limited to boogers and cum.",
    "example": "\"Hey, did you see that chef over there?\"\r\"Yeah man, he was giving that critic the Yelp Special.\"",
    "id": "8mvlgblon6",
    "available": "is available"
  },
  {
    "title": "dickchicken.com",
    "meaning": "A game between two guys who pull out their dicks and walk towards each other. Both lose or win if dicks touch.Play when drunk!",
    "example": "Who wants to play dick chicken!",
    "id": "7modkf41n0",
    "available": "is taken"
  },
  {
    "title": "cheaterapp.com",
    "meaning": "An app such as Kik, Whatsapp or Snapchat that allows people to anonymously chat. They are often used by people cheating or playing games online.",
    "example": "He didn't give me his number, he wanted to talk through a cheater app. He is probably cheating on his woman.",
    "id": "w61kzi1wrm",
    "available": "is for sale"
  },
  {
    "title": "truuuu.com",
    "meaning": "Used by illiterate instagram commenters to express reaction or mutual agreement to a certain subject or topic.",
    "example": "Person 1: wen u go to the barber shop and you forget your money but dont tell the barber until after the cutPerson 2: omg lol truuuuuu 😂😂👌👌✋✋💯💯💯😂✋😂✋👌",
    "id": "20w8dcwgz0",
    "available": "is taken"
  },
  {
    "title": "conversationalremorse.com",
    "meaning": "The feeling you get after leaving a conversation, when you think of all things you should have said, witty, wise or informative.",
    "example": "Man i totally should have told her what not to do in her current situation. Im overhelmed by conversational remorse right now.",
    "id": "k6qnnf87l6",
    "available": "is available"
  },
  {
    "title": "sympathyboner.com",
    "meaning": "Something males (mostly) get when they attempt to console a female who has recently found out about an unfaithful mate.",
    "example": "Sarah: I can't believe he cheated on me. Uh, what's that?Daniel: It's a sympathy boner. Come get a hug.",
    "id": "36yvksnow6",
    "available": "is taken"
  },
  {
    "title": "amazonandanal.com",
    "meaning": "Like Netflix and chill but with butt stuff.",
    "example": "Girl: Netflix and chill?\rGuy: No\rGirl: Amazon and anal?",
    "id": "v02n5hjqn0",
    "available": "is available"
  },
  {
    "title": "loldirl.com",
    "meaning": "Laughed out loud, in real life. For when you actually, legitimately, do laugh out loud after reading something. Not the pity 'lol' you throw down just to be polite or because you don't know what the fuck else to say.",
    "example": "When I was reading your texts on the bus, I lol'd irl and everyone stared at me like I had mental issues.",
    "id": "76zn1aoj36",
    "available": "is available"
  },
  {
    "title": "feelinyourself.com",
    "meaning": "To have a sense of confidence; to be pleased with the way you look and show it through actions.",
    "example": "A:\"I look so good\"\rB:\"you need to chill. You are feelin' yourself way too much.",
    "id": "w67knc17pm",
    "available": "is available"
  },
  {
    "title": "preggophile.com",
    "meaning": "A person that finds pregnant women sexually stimulating. One that would be attracted to a preggo.",
    "example": "John has been flirting with Mindie a lot ever since she got pregnant; John's such a preggophile.",
    "id": "kmg35cw8l6",
    "available": "is taken"
  },
  {
    "title": "kanyenot.com",
    "meaning": "Can you not",
    "example": "Person 1: yo check out me new crocs, they fire !\rPerson 2: ... Kanye not",
    "id": "904rlu8wjm",
    "available": "is available"
  },
  {
    "title": "hypegirl.com",
    "meaning": "Ultimate turn up girl of the squad. Get's the party going.",
    "example": "Yo.. Dakota is our hype girl. She keeps it too real.",
    "id": "409e9spxqm",
    "available": "is taken"
  },
  {
    "title": "specialsnowflake.com",
    "meaning": "The Special Snowflake (Also referred to as one with the \"Special Snowflake Syndrome\" or \"SSS\") is a person who believes they are different and unique from everyone else because of something there are or do. This thing they are or do, most commonly is something is something many many other people are doing, E.G. Genderfluid, Therian (Otherkin), etc. Special Snowflakes almost always have a superiority complex.",
    "example": "Some Special Snowflakes are protesting at Target because they aren't allowed to wear their costumes inside.",
    "id": "y6r79c15km",
    "available": "is taken"
  },
  {
    "title": "drakeface.com",
    "meaning": "The face you make when you're a little more than just sad.",
    "example": "She told my boy he had crunchy hair, so he's been walking around the house with drake face all day. #drakeface",
    "id": "z655zfyeg6",
    "available": "is available"
  },
  {
    "title": "kingstoe.com",
    "meaning": "Kings toe is when the second toe is longer than the (great) or big toe",
    "example": "Oh ! look at his feet, he has the kings toe on both feet",
    "id": "q6dnpi8rdm",
    "available": "is for sale"
  },
  {
    "title": "theweirdpartofyoutube.com",
    "meaning": "The YouTube jungle. A desolate zone littered with video uploads generally taken down within two weeks due to strange and/or NSFW content. The users have unintelligible names and post videos that make no sense.",
    "example": "bob: So I was watching anime on YouTube and somehow found this girl wearing a skunk mask and ripping farts on a dude's face.\rjoe: oh shit, you were on the weird part of YouTube again.",
    "id": "90kpgaej8m",
    "available": "is available"
  },
  {
    "title": "angelstouch.com",
    "meaning": "When you are peeing or shitting and your dick touches the urinal / toilet where other dicks probably have been.",
    "example": "I was shitting comfortably when suddenly my dick feels cold like an angel's touch.",
    "id": "y6n12cgz80",
    "available": "is taken"
  },
  {
    "title": "whitepeopling.com",
    "meaning": "Used to describe certain activities that are popular within the Caucasian community that People of Color don't usually participate in.",
    "example": "Keith: \"Hey guys, would you like to go hiking and camping with me this weekend? Maybe do a little hang gliding if the wind conditions are right.\"Darren and Diego look at each another.Darren: \"Does he mean he wants us to go white peopling with him?\"Diego: \"I think so bruh.\"",
    "id": "omeevhgx9m",
    "available": "is taken"
  },
  {
    "title": "andthenifuckedheruptheass.com",
    "meaning": "What you say when you're in the middle of a story and realize no one's listening.",
    "example": "I'm sitting at the dinner table, telling my girlfriends family about how we met. As I'm getting to the funny part, i realize no one's listening, so i abruptly finish with \"and then i fucked her up the ass!\"",
    "id": "zmj8jbgj80",
    "available": "is available"
  },
  {
    "title": "didntdolist.com",
    "meaning": "When you get the great idea to start making ToDo lists at work, of which's items only a fraction get done. As the list grows after a few days, weeks, whatever, you begin to realize you've made a huge list of things you intended to do but never got done.",
    "example": "Every morning at work, I add more things I should do to my didn't do list, then go on an hour and a half coffee break to flirt with the girl downstairs and otherwise waste company time.",
    "id": "4m39jsqxem",
    "available": "is taken"
  },
  {
    "title": "sexsickness.com",
    "meaning": "The exhaustion and sick feeling you get when you have too much sex",
    "example": "Guy 1: Jamie fucked seven times in one day and then threw up.Guy 2: Sounds like major sex sickness",
    "id": "90xdziqyl6",
    "available": "is available"
  },
  {
    "title": "hoodedsoldier.com",
    "meaning": "A hooded soldier is a confident man who takes pride in his foreskin. A hooded solider knows the power and appreciates the function of his intact penis.",
    "example": "She keeps coming back for that hooded soldier.",
    "id": "26lvxa93qm",
    "available": "is taken"
  },
  {
    "title": "foh.com",
    "meaning": "Fuck Outta Here\rA shorter way to say Get the fuck outta here",
    "example": "Guess who I saw yesterday?\rWho?\rYour old ex. Calvin!\rFOH! Where you see that fool?",
    "id": "q68nyf58p6",
    "available": "is taken"
  },
  {
    "title": "starfish.com",
    "meaning": "When you get so high you are spread out and stuck to your bed like a starfish.",
    "example": "\"Haley got so high from that Lasagna bowl that she starfished in the car and didn't even make it to Taco Bell\" \"Gordon is always the first to Starfish\"",
    "id": "46p29byd9m",
    "available": "is taken"
  },
  {
    "title": "plumpgirls.com",
    "meaning": "Ladies that are over 380 and are very confident about their weight.",
    "example": "Did you see those nice plump girls over there at the club?",
    "id": "8mvrgblon6",
    "available": "is taken"
  },
  {
    "title": "luckfully.com",
    "meaning": "Adj/verb: thankfully lucky",
    "example": "Luckfully that cop pulled someone else over",
    "id": "7moykb41n0",
    "available": "is taken"
  },
  {
    "title": "phonegirlfriend.com",
    "meaning": "Girl you sext and share sexual pics and conversations with",
    "example": "I sat up with my phone girlfriend all night and now I have blueballs",
    "id": "w61gzi1wr6",
    "available": "is for sale"
  },
  {
    "title": "headphonezombie.com",
    "meaning": "When someone is wearing headphones and is completely unresponsive to the outside world. Headphone zombies often travel in packs, but rarely communicate or associate with one another. It is not yet determined whether they feed on brains or popular music, or both.",
    "example": "I drove through the University and nearly hit a pack of J-walking headphone zombies",
    "id": "20wqdhwgz0",
    "available": "is for sale"
  },
  {
    "title": "godsbra.com",
    "meaning": "Going bra less",
    "example": "\"She said she was wearing Gods Bra and then I saw her nipples\"1st guy: \" Those girls are having a Gods Bra party\"\r2nd guy: \"Let's crash it!\"",
    "id": "k6qzna87l6",
    "available": "is taken"
  },
  {
    "title": "shamefuck.com",
    "meaning": "The person you're compelled to fuck, even though they're not the hottest/sexiest/smartest or clever or remotely appealing to most people.",
    "example": "The guy is a pig. He's stupid and repulsive. I can't keep my hands off him. I don't know why I want him. He is my shamefuck.",
    "id": "36ykkhnowm",
    "available": "is available"
  },
  {
    "title": "sftme.com",
    "meaning": "Sorry For The Mass Email",
    "example": "SFTME everybody,Has anyone seen my red stapler? I left it somewhere in the office last Saturday.Thanks!\rMilton",
    "id": "v0245fjqnm",
    "available": "is taken"
  },
  {
    "title": "sftc.com",
    "meaning": "A more discrete, faster way of saying \"Straight For the Cock\"",
    "example": "Paige: Sarah, Did you go SFTC?\rSarah: You know it!",
    "id": "76z31hoj3m",
    "available": "is taken"
  },
  {
    "title": "sftn.com",
    "meaning": "Single for the night",
    "example": "\"Lets hit the club, I'm sftn.\"",
    "id": "w67pnh17p6",
    "available": "is taken"
  },
  {
    "title": "ashydick.com",
    "meaning": "A penis that endures no sexual intercourse for a long period of time (it does not get wet)",
    "example": "Man... It's been awhile. I'm getting an ashy dick",
    "id": "kmgw5hw8l0",
    "available": "is available"
  },
  {
    "title": "instalerking.com",
    "meaning": "Going more than 25 weeks deep into someone that you fantasize about's Instagram Page and not liking any pictures.",
    "example": "Gurl#1: i was insta-lerking Dequans page last night.\rGurl #2: Did you like any pictures?\rGurl #1: Hell no, i was 56 weeks deep into that page gurl!!!!",
    "id": "904eli8wj6",
    "available": "is available"
  },
  {
    "title": "onmyshit.com",
    "meaning": "Meaning that you're you. No mistakes and you are on guard. You take care of yourself.",
    "example": "Hey man, you okay? Yeah man, I'm on my shit.",
    "id": "409w9bpxqm",
    "available": "is available"
  },
  {
    "title": "triflingbitch.com",
    "meaning": "A backdoor girl. One who can't be trusted. A girl who is all about opportunity and doesn't care who gets hurt. Her feelings are never real and turned on and off based on \"what's in it for her\". As a friend, you can never confide in them, because if it suits them, they will betray you without a second thought. As a girlfriend, well let's say, you are in for an emotional roller coaster and she at the controls. But it won't be long before she finds what she thinks is a better ride and you will be conveniently shelved, to fuck with later. Dont bring her around any of your successful friends unless you are trying to get rid of her.",
    "example": "\"Wow, I just saw your boyfriend with Sarah, I thought she was your best friend? What a trifling bitch!\"",
    "id": "y6r19s15km",
    "available": "is available"
  },
  {
    "title": "whatarethose.com",
    "meaning": "an exclamation shouted by social media users everywhere when referring to someone without \"shoe game\". originated as a vine, and can sometimes be funny, but lots of lame people don't say it with enough force and end up looking extremely awkward.",
    "example": "kid: \"mom, I got one question for you.\"\rmom: \"oh alrigh-\"\rkid: \"what are those? .\" *points to moms loafers*",
    "id": "z653zuyegm",
    "available": "is taken"
  },
  {
    "title": "givemesomefacetime.com",
    "meaning": "A way of descretely telling someone you want oral sex.A nice way to tell someone to give you a blow job, to eat you out, or to get into the 69 position.",
    "example": "Guy: lets fuck.\rGirl: okay give me some facetime!",
    "id": "q6dlpt8rd0",
    "available": "is available"
  },
  {
    "title": "huluandcommitment.com",
    "meaning": "A play on the standard hookup phrase \"Netflix and chill,\" this update is for those looking to binge watch tv shows with another person while in a relationship.",
    "example": "Person A: hey, you wanna Netflix and chill?\rPerson B: I think we might be ready for Hulu and commitment ;)",
    "id": "90krgiej86",
    "available": "is available"
  },
  {
    "title": "hotlinebling.com",
    "meaning": "That little ass light on yo phone that lights up when a dude thirsty af at night wanting that good good",
    "example": "He hit me with that 1800 hotline bling",
    "id": "y6nj2fgz80",
    "available": "is for sale"
  },
  {
    "title": "ghostcheeks.com",
    "meaning": "Where you sit on a toilet seat and can still feel the warmth where the previous occupant was sitting.",
    "example": "I felt some ghost cheeks on the toilet last night...",
    "id": "omepvcgx96",
    "available": "is available"
  },
  {
    "title": "misrepresentative.com",
    "meaning": "1. A congressmen or representative who say they represent their people but rather pursue self interests\r2. An elected official who claims to believe one way but votes the opposite\r3. A politician who holds office who lied to his constituents just to get their votes and contributions\r4. A congressmen or representative who's campaign is paid for by a wealthy contributor(s) to fool the people that he is to represent into believing he has their best interests in mind when in fact he's doing the bidding of the wealthy contributor(s).",
    "example": "I voted for those dumbasses and they don't reflect my opinion at all. Instead of representatives they should be called misrepresentatives, he ain't no representative he's a misrepresentative.\"The wealthy Electric and Coal Corporations paid for your campaign congressman,\" said the lobbyist, \"you need to vote against that bill, even though you and I know it would be in the best interest of the people in your district to breathe clean air.\"",
    "id": "zmj4jagj8m",
    "available": "is taken"
  },
  {
    "title": "trapqueen.com",
    "meaning": "loyal, respectful, and wise women. both street smart & book smart. respectful to her family and, friends. loyal to her lover. she has style and admires, many haters but considers them fans.",
    "example": "My Girl Is A Trap Queen",
    "id": "4m3kjcqxe6",
    "available": "is taken"
  },
  {
    "title": "freefarting.com",
    "meaning": "Passing gas with blatant disregard for one's surroundings, environment or company. Free-farting is so natural that often the subject isn't even aware of doing so.",
    "example": "I had no idea I had been free-farting until I realized that the whole classroom was looking at me in disgust. freefartingfartembarrass",
    "id": "90xkzuqylm",
    "available": "is available"
  },
  {
    "title": "onioncheck.com",
    "meaning": "The act of checking the source of a ridiculous headline to see if it's real, or if it's from The Onion.",
    "example": "I've been doing more onion checks since Trump started running for office.",
    "id": "26ldxu93qm",
    "available": "is available"
  },
  {
    "title": "sleepswiping.com",
    "meaning": "When you accidentally like someone on tinder cause you dozed off for a minute while swiping",
    "example": "Oh damn, hope I don't get a match on that guy/girl, I was sleep swiping!",
    "id": "q68oyu58pm",
    "available": "is for sale"
  },
  {
    "title": "thisdude.com",
    "meaning": "A reference to any person who is oblivious to his or her own selfish and/or ridiculous behavior, usually said with an over-the-shoulder side-eye.",
    "example": "He threw up all over my shoes, then asked me for a ride? This dude....",
    "id": "46p89byd9m",
    "available": "is taken"
  },
  {
    "title": "lactivist.com",
    "meaning": "a woman who nurses her child in public as a protest against people uncomfortable with seeing breastfeeding.",
    "example": "Lactivists staged a nurse-in outside a restaurant to protest women being refused service after breastfeeding inside.",
    "id": "8mv9gclon6",
    "available": "is for sale"
  },
  {
    "title": "porkhole.com",
    "meaning": "a crude term for a womans vagina, or a mans anus. Also if there was a hole in your ham, you could use it in that sense too. ",
    "example": "\"i love the way your pork hole smells.\"",
    "id": "7moxks41nm",
    "available": "is for sale"
  },
  {
    "title": "trill.com",
    "meaning": "The correct definition of trill is: to be true to ones self and real with all.",
    "example": "I want to thank everyone who put they meaning of trill in this dictionary. Some of you are on point and some are way off\rThis word was formed in 1986 by Eric Charon. (aka Sir Trill.) He took the words true and real to describe his demeanor. He spelled it Treal. He began to use it in the streets of Port Arthur. The word got to UGK rapper Bun B thru a mutual friend of Bun B and Sir Trill. UGK Then released they first underground record called the Southern Way in 1992 which they spelled the word t-r-i-l-l. This became the new spelling that is used today",
    "id": "w619zt1wr0",
    "available": "is taken"
  },
  {
    "title": "whitelightermyth.com",
    "meaning": "The real history to the white lighter myth and why they are unlucky is based on four famous and revolutionary musicians of the second half of the 20th century.  Jim Morrison, Jimi Hendrex, Janis Joplin, and Kurt Cobain were all left-handed, all died at the age of 27, and all their autopsies reported that a white bic lighter was found in their pockets. This is why it is said that white lighters are unlucky.  So if you are 27 and left-handed, don’t use a white bic lighter, you will die.  ",
    "example": "Some people really flip out when there is white lighter in the room.\r\rThe white lighter myth is often related to smoking marijuana with a white bic lighter.  ",
    "id": "20w5dhwgz0",
    "available": "is for sale"
  },
  {
    "title": "gohamandcheese.com",
    "meaning": "go hard as a motherfucker when you eat",
    "example": "\"im so hungry im about to go ham and cheese in this bitch\"",
    "id": "k6qvnc87l0",
    "available": "is available"
  },
  {
    "title": "thatgoodgood.com",
    "meaning": "Having good pussy or dick",
    "example": "You got that good good( dick).Give me some of that good good.",
    "id": "36yekhnowm",
    "available": "is taken"
  },
  {
    "title": "cheekynandos.com",
    "meaning": "When you're out with the lads and you're having a look in JD and you might fancy the Curry Club at 'Spoons but then your mate Callum who's an absolute ledge and the Archbishop of Banterbury says \"Oi brevs let's have a cheeky Nandos instead\" and you'll think \"Top. Let's smash it.\"",
    "example": "Tool #1: Oi mate fancy a browse in River Island? Just seen a solid 10 bird outsideTool #2: Na mate I'm off for a Cheeky Nandos instead",
    "id": "v0255sjqn0",
    "available": "is taken"
  },
  {
    "title": "rekt.com",
    "meaning": "When someone gets completely destroyed.",
    "example": "\"Ella got rekt\"\r\"Oh my days, Ella got annihilated! #Rekt\"",
    "id": "6zl11soj3m",
    "available": "is taken"
  },
  {
    "title": "cbt.com",
    "meaning": "CBT stands for \"Cock and Ball Torture\". Torture can be inflicted by: Slapping, Squeezing, Pinching, Weights/Parachutes. The testicles can stand great pain but caution should be taken.\r\rIn some cases, \"Torture\" is considered \"Play\". The testicles are simply tugged on or stretched out.\r\rMost men find handling, stroking and squeezing gently is a pleasurable sensation. Some enjoy using ball stretchers to achieve a longer sac.",
    "example": "Girl: \"His balls are so long! They slap against my ass all the time, I love it.\"",
    "id": "67nens17pm",
    "available": "is taken"
  },
  {
    "title": "pedostache.com",
    "meaning": "A mustache that a pedofile would have. It is unkempt and awkwardly unmanly. Often there is barely even any hair there and it looks like a sad attempt of a pre-puberty teen to have facial hair. Imagine Napoleon Dynamite's brother's stache but worse.",
    "example": "Johnny: \"Hey, do you like the new mustache I'm growing?!\"\rNathan: \"Eww, no!! Shave that pedo stache off!!\"\rRobert: \"Yea, John, shave that shit off; I have more hair on my ass than you do above your lip!!\"",
    "id": "mgrk5bw8l6",
    "available": "is available"
  },
  {
    "title": "petparents.com",
    "meaning": "A couple who treat their dogs, cats or other animals as if they were children. Many of these couples are childless and the animals provide a substitute for babies.",
    "example": "My neighbors are constantly fussing over their two golden retrievers. They always talk about how they must take them on play dates with other dogs and feed them special dog food for their birthdays. That sounds like typical pet parents. pets, canine crazy, feline fanatic, animal lovers, pet-obsessed, dogs, cats, feline, canine",
    "id": "041xlf8wj0",
    "available": "is taken"
  },
  {
    "title": "autoerect.com",
    "meaning": "When text is auto-corrected into something sexual.",
    "example": "\"I'm excited to be eating dick tonight!\" *duck I mean duck what an auto erect",
    "id": "09839cpxqm",
    "available": "is for sale"
  },
  {
    "title": "handufactured.com",
    "meaning": "Handcrafted, handmade",
    "example": "Manufacturing is coming back to the U.S. but the products are more handufactured than mass produced.",
    "id": "6rnq9f15k0",
    "available": "is taken"
  },
  {
    "title": "hatelike.com",
    "meaning": "When you like something on a social network site (such as Facebook) in a sarcastic way. Generally something you don't like at all and the other person has no idea.",
    "example": "CP: \"Hanging out with my best friend Heather at the mall\"Ugh, Heather is such a bitch. Definitely going to hate-like that status.",
    "id": "65lxzhyegm",
    "available": "is taken"
  },
  {
    "title": "trendbomber.com",
    "meaning": "When someone tries to become apart of a trend that they do not belong in. Posing to apart of a cultural trend that they have no business being apart of.",
    "example": "A 90 year old woman who shops at forever 21 is a trend bomber.",
    "id": "6ddzpc8rd6",
    "available": "is taken"
  },
  {
    "title": "crashyoursquad.com",
    "meaning": "When someone is new, or hasn't found their group yet, a group lets them hang with them until they make friends.",
    "example": "New Kid: Hey can I hang with you guys?Squad Leader: Sure, and we made plans for later if you wanna hang\rNew Kid: Thanks for letting me crash your squad, dude.",
    "id": "0kd1guej8m",
    "available": "is available"
  },
  {
    "title": "drainthepoison.com",
    "meaning": "An idiom for masturbation. Typically used for males who are \"backed up\" that can't get their mind off of sex and therefore cannot focus.",
    "example": "Dude I can't think straight right now, all these females in leggings are messing with my head. I need to go home and drain the poison\".",
    "id": "6no72ugz8m",
    "available": "is available"
  },
  {
    "title": "lactcident.com",
    "meaning": "Accidental explosive diarrhea caused by consuming a dairy product by a lactose intolerant person.",
    "example": "- Yo Bob, where did you go? We searched everywhere for you at the party.\r- I had to change my pants man, had a little lactcident after downing two White Russians.",
    "id": "me7jvsgx96",
    "available": "is available"
  },
  {
    "title": "helpatreegrow.com",
    "meaning": "Person that pisses on a tree because there is no bathroom around and tries to act like it is benefiting the earth",
    "example": "Friend 1: Yo, I need to help a tree grow\rFriend 2: That sounds like a nice thing to do\rFriend 1: Yup!",
    "id": "mj3rjbgj86",
    "available": "is available"
  },
  {
    "title": "snapchatslapped.com",
    "meaning": "\"Snapchat Slapped\" The act of waking a person up by slapping them in the face with your phone while taking a video using snapchat.",
    "example": "My coworkers a douche he snapchat slapped me while on break the other day.",
    "id": "m351jiqxe6",
    "available": "is available"
  },
  {
    "title": "intercoarse.com",
    "meaning": "Like rough anal, but referring to any type of sex which is rough.",
    "example": "John's girlfriend's really into intercoarse, and she has scars to show from past experience.",
    "id": "0xvrzsqyl6",
    "available": "is taken"
  },
  {
    "title": "jeanjam.com",
    "meaning": "When jeans are way too tight on your junk. Limits mobility, decreases circulation, and potentially lowers sperm count.",
    "example": "Tim: \"These new jeans I just got are really cramming my junk when I try to move, Mike.\"\rMike: \"Sounds like you are getting jean jammed.\"",
    "id": "6l3qxc93q6",
    "available": "is available"
  },
  {
    "title": "netflixandchillforone.com",
    "meaning": "A euphemism for masturbation. Typically used by a single man or woman who has no sexual partners, save for Netflix.",
    "example": "Katie: \"Netflix and chill for one tonight I think\"\rChris: \"Make sure you take off those fake nails, don't want to snag anything\"",
    "id": "68leyh58pm",
    "available": "is available"
  },
  {
    "title": "restingassholeface.com",
    "meaning": "A person, usually a boy, who naturally looks mean when his face is expressionless, without meaning to.",
    "example": "Nah, he's just got a resting asshole face, he's actually really cool",
    "id": "6peo9hyd9m",
    "available": "is for sale"
  },
  {
    "title": "moreissuesthanvogue.com",
    "meaning": "When you imply that your amount of issues (problems) are greater than the amount of issues (magazine articles) the famous magazine company, Vogue has.",
    "example": "Girl: \"ugh there's so much homework and errands\"\rBoy: \"wow, you must have more issues than vogue\"\rGirl: \"I know right!\"",
    "id": "mvo4gclon6",
    "available": "is taken"
  },
  {
    "title": "maintenancepoop.com",
    "meaning": "The act of visiting the bathroom with the intention to only urinate, but instead relieve a little poop as well as a means to prolong the time between your next bathroom visit.",
    "example": "I sat down on the toilet to take a piss on my lunch break, but I thought a maintenance poop would be a good idea since I have a meeting coming up.",
    "id": "mogoka41n0",
    "available": "is available"
  },
  {
    "title": "throwingpillows.com",
    "meaning": "Having a weak punch",
    "example": "It's play fighting we only be throwing pillows",
    "id": "61xnza1wr0",
    "available": "is available"
  },
  {
    "title": "coolgirl.com",
    "meaning": "A girl who is not a girlfriend. Shares interests with, hangs with, and (optionally) sleeps with a man she is interested in. Inevitably, she becomes a 'cool girl' and becomes ineligible for girlfriend status. Is often beleived to be lesbian on first glance.",
    "example": "Guy 1: Sam likes Halo? You serious? Damn, you're lucky to have a girlfriend like that.\rGuy 2: She's not my girlfriend. She's just a cool girl.",
    "id": "0wkedawgz0",
    "available": "is taken"
  },
  {
    "title": "mediashower.com",
    "meaning": "When a celebrity or a new person gets WAY too much spotlight. This can cause a snobbish side to surface, and their friends or aquaintances to notice them acting differently. Otherwise, this causes the \"showered\" person to feel shy or be surrounded by people by simply going outside their house, making them annoyed.",
    "example": "After Jack's new speech on world matters, he got a media shower and became a different person; one his friends didn't know anymore.\r\rOnce Beth won the spelling bee, her media shower forced her to skip school for the next week.",
    "id": "6qo3nh87lm",
    "available": "is taken"
  },
  {
    "title": "hottish.com",
    "meaning": "Somewhat hot. Although cannot be classified as \"hot\", one who is hottish is not completely ugly either.",
    "example": "That chick's not bad bro. She's hottish. I'm gonna go say what's up.",
    "id": "6y5wkhnowm",
    "available": "is for sale"
  },
  {
    "title": "scativism.com",
    "meaning": "Shitting on peoples property as a form of protest.",
    "example": "I met a guy who regularly shat in the 3. hole on the local golf course as as a sign of his discontent with the burgois. He called it scativism.",
    "id": "021l5cjqnm",
    "available": "is available"
  },
  {
    "title": "donaldtrump.com",
    "meaning": "Living proof that money can't buy good hair.",
    "example": "In fact, money CAN buy good hair.  Why his money has not, well, that's anyone's guess.",
    "id": "0wkkecwgz0",
    "available": "is taken"
  },
  {
    "title": "arthoe.com",
    "meaning": "a hoe who is mysterious and chill and like hippyish and good at art",
    "example": "damn, I wish I was an art hoe like her",
    "id": "6qooot87lm",
    "available": "is taken"
  },
  {
    "title": "sfw.com",
    "meaning": "So Fucking What",
    "example": "I got a 10 cent raise #SFW.",
    "id": "6y553tnowm",
    "available": "is taken"
  },
  {
    "title": "stiffmeds.com",
    "meaning": "Stiff Meds are taken to correct erectile dysfunction.\rAlso referred to as Stiff Meds or Hard Meds.\r\r",
    "example": "Stiff Meds include Viagra, Levitra, and Cialis.",
    "id": "0211rhjqnm",
    "available": "is taken"
  },
  {
    "title": "genderninja.com",
    "meaning": "a person who's gender is indecipherable",
    "example": "Person 1: Is that a dude or a chick?\r\rPerson 2: I dunno. I haven't seen a gender ninja like that since the days of Hansen. ",
    "id": "6zllwtoj3m",
    "available": "is available"
  },
  {
    "title": "confidentturtle.com",
    "meaning": "When one sticks their neck out so far as to avoid double chins and exude the confidence of a turtle that comes out of its shell.",
    "example": "She used the confident turtle to replace duck face in photos.",
    "id": "67nn9t17pm",
    "available": "is taken"
  },
  {
    "title": "sadpancakes.com",
    "meaning": "1. In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.2. Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.3. Pour Syrup to divert attention to the fact that your wife is cheating on you with your adopted british grandson and ruining your life.",
    "example": "I make sad pancakes every time Meggen cheats on me with Declan.",
    "id": "mgrrgsw8l6",
    "available": "is taken"
  },
  {
    "title": "dnb.com",
    "meaning": "a \"Do Nothing Bitch\". A girl who wants to be all pretty and fancy, just to have someone take care of her.",
    "example": "\"Don't waste your time on her, she's a DNB\"",
    "id": "0411gt8wj0",
    "available": "is taken"
  },
  {
    "title": "netforget.com",
    "meaning": "Net Forget is a person who frequently goes on a website to do something, but completely forgets his/her original intention due to the overwhelming amount of information on the internet.",
    "example": "I was on Wikipedia the other day, trying to look up Jay-Z, but I'm such a Net Forget, I ended up looking at cat pictures.",
    "id": "0988dupxqm",
    "available": "is taken"
  },
  {
    "title": "urethrafranklin.com",
    "meaning": "1. Any sexual act involving penetration/stimulation of the urethra.2. Another name for one's urethra.",
    "example": "1. Last night, Jane gave me a Urethra Franklin and I have no idea why I agreed to that.2. Ever since I hooked up with that one brunette chick, my Urethra Franklin has burned when I pee.",
    "id": "6rnn4i15k0",
    "available": "is for sale"
  },
  {
    "title": "nameshame.com",
    "meaning": "The point at which it's too late to ask for someone's name because you spent so much time around them that you should already know it.",
    "example": "I have total name shame. I've been working for a month with this guy and still don't know his name.",
    "id": "65lldayegm",
    "available": "is for sale"
  },
  {
    "title": "selfiecidal.com",
    "meaning": "Someone who takes selfies in dangerous situations or circumstances.",
    "example": "I can't believe Dave took a selfie whilst climbing up a cliff!!...He must be Selfiecidal!",
    "id": "6ddd9c8rd6",
    "available": "is available"
  },
  {
    "title": "shitlocks.com",
    "meaning": "Dred locks that look shitty on someone.",
    "example": "Nigga those ain't dredlocks, they SHITLOCKS!",
    "id": "0kddquej8m",
    "available": "is available"
  },
  {
    "title": "leftlaneloser.com",
    "meaning": "A person who impedes the flow of traffic by staying in the left lane. This person is either driving slower than everybody on the road, driving the same speed as the person to their right, or simply driving 1 mph faster than the person to their right. In all cases, they are ignoring the responsibility that comes with driving in the \"hammer lane\".",
    "example": "Driver drives in left left despite seeing the long line of cars behind them but refuses to move over to the slow lane because it isn't safe to change lanes while talking on the cellphone. This driver is a Left Lane Loser.",
    "id": "6noo4fgz8m",
    "available": "is taken"
  },
  {
    "title": "bestfriendwhore.com",
    "meaning": "That one person who refers to everyone as their \"best friend\" when it's convenient. Not to be confused with bestfriend whore",
    "example": "Cindy (to Janice): Hey, best friend! Do you have a pencil I can borrow?\rShaniqua: Bitch, you said I was your best friend.\rJanice: Cindy's such a best friend whore.",
    "id": "me77xsgx96",
    "available": "is available"
  },
  {
    "title": "roadbone.com",
    "meaning": "the occurunce of an unwanted erection during a ride in a car, truck boat, airplane, etc. usually occurs on long trips.",
    "example": "dude, i hope she doesnt see my road bone. I've had it since we left town and i cant get rid of it!",
    "id": "mj33pugj86",
    "available": "is taken"
  },
  {
    "title": "kidult.com",
    "meaning": "A so-called grown-up who doesn't want to grow up (or at least act like an adult) and would instead prefer so-called \"children's\" stuff for entertainment, like cartoons, toys, comic books, Disney movies, etc. He or she also enjoys colorful \"kiddie\" snacks like breakfast cereal and Spaghetti-O's and dresses like a teenager or perhaps younger. May or may not be great parents as well as being able to take on adult responsibilities. Not necessarily too immature at least in the public. Not to to be confused with geeks or nerds either, of course! \r\rAlso known as \"Peter Pan\", \"young at heart\", and \"kid at heart\".",
    "example": "I'm almost 35 and I love Neopets, Archie comics, children's books, etc. So this makes me a kidult, heh. \r\r",
    "id": "m355dhqxe6",
    "available": "is for sale"
  },
  {
    "title": "pornhangover.com",
    "meaning": "I word used to describe when a person jacks off to much to porn and cant do anything for a few hours.",
    "example": "I was having such a bad porn hangover last night that i couldnt go out.",
    "id": "0xvv9sqyl6",
    "available": "is taken"
  },
  {
    "title": "investmentbanger.com",
    "meaning": "n. someone who specialises in dating seemingly unattractive people that later blossom into fitties.",
    "example": "\"Did you see Dave's missus, she's a 9/10\". \"She used to be such a munter, though. He's such an investment banger.\"",
    "id": "6l33rh93q6",
    "available": "is available"
  },
  {
    "title": "applepicking.com",
    "meaning": "When someone steals Apple Products such as iPhones, iPads, iPod Touches, and other stuff created by Apple.",
    "example": "Person 1: Some guy was Apple Picking his iPhone.\rPerson 2: I still have my iPad on my backpack to avoid that Apple Picker.\rPerson 1: I think that guy wanted an iPhone so bad.\rPerson 2: I hope I don't get robbed...",
    "id": "68llda58pm",
    "available": "is for sale"
  },
  {
    "title": "anchorbaby.com",
    "meaning": "What your girlfriend hopes to achieve by \"forgetting\" to taker her pill, thus guaranteeing that you'll have to spend the rest of your now ruined life with her... or that you'll have to run from the law forever to avoid child support.",
    "example": "I caught my girlfriend flushing her pill and poking holes in all the condoms... I think she wants an anchor baby.",
    "id": "6peeziyd9m",
    "available": "is for sale"
  },
  {
    "title": "deeznuts.com",
    "meaning": "1) A sarcastic expression used to denote annoyance or frustration.\r2) A term used when you just dont give a fuck\r3) Look, my dick and balls are bigger than yours.",
    "example": "\"Hey let me borrow your car.\"\r\"Why don't you borrow deez nuts.\"",
    "id": "mvoolulon6",
    "available": "is for sale"
  },
  {
    "title": "shitticket.com",
    "meaning": "(n.) a single section of bathroom tissue.",
    "example": "\"That guy keeps pissing on the floor in our bathroom and leaving his shit tickets in our trash can. Who the fuck does that; takes a shit and throws their disgusting shit tickets in the trash after? That's pretty fucked up.\"",
    "id": "moggyf41n0",
    "available": "is for sale"
  },
  {
    "title": "ratchrat.com",
    "meaning": "A ratchet ass club rat",
    "example": "Nene's clubbing routine for Thursday, Friday, and Saturday include going to Origin, the Grand, Bootie SF, and when everyone else wants to go home, she rounds up the troops to head to The End Up.Wow, what a ratchrat.Dude, i know.",
    "id": "61xx9i1wr0",
    "available": "is available"
  },
  {
    "title": "phonegroping.com",
    "meaning": "That moment when you lose your phone and you immediately freak and start groping your self to find it.",
    "example": "Male: Hey can you call someone for me?\rFemale; Sure. *looks for phone* Crap! Where's my phone?! *starts to grope self*\rMale: Did you start Phone Groping your self?\rFemale: Yes.\rMale: That's hot.",
    "id": "0wkwebwgz0",
    "available": "is available"
  },
  {
    "title": "fartingglances.com",
    "meaning": "When a small group or crowed suddenly realizes that someone has emitted a silent but nasty fart and they all look among themselves for facial expressions or body language that might pinpoint the perpertrator.",
    "example": "The group by the bar was festive, but suddenly all was quite, and everyone was looking among themselves with farting glances.",
    "id": "6qokoa87lm",
    "available": "is available"
  },
  {
    "title": "emojitennis.com",
    "meaning": "Texting nothing but emojis back and forth between a friend or partner. Can sometimes be for humour or usually because you're bored.",
    "example": "Boy: let's play emoji tennis\rGirl: ok\rBoy: 🍑\rGirl: 😐\rBoy: 😍😘❓\rGirl: 😘😉\rBoy: 😊😉",
    "id": "6y533anowm",
    "available": "is for sale"
  },
  {
    "title": "bishwhet.com",
    "meaning": "a polite way of saying bitch what, specially to someone who has annoyed you.\rAlso can be used as an annoying term on Vine.\rCan also be used purely for fun.",
    "example": "Kaylee-\"Fast and furious is terrible.\"\rDarfur & Jenn- \"Bish whet\"Darcie-\"Kaylee has a boyfriend\"\rJenn-\"Bish whet\"",
    "id": "021erujqnm",
    "available": "is for sale"
  },
  {
    "title": "serviceabro.com",
    "meaning": "The act of performing an oral sexual deed to a male.",
    "example": "Where is Brendan?\rI think he is out on call to service a bro",
    "id": "6zlqwaoj3m",
    "available": "is taken"
  },
  {
    "title": "thesaurusrex.com",
    "meaning": "A person who uses a word program or internet thesaurus in order to make their papers or written works appear smarter by replacing common words with larger or uncommon words.",
    "example": "The phrontistery is a Thesaurus Rex's wet dream.  \r\r\"Since when does Bismark use the word jackanapes?\"\r\"Since he became a Thesaurus Rex.\"",
    "id": "67nr9a17pm",
    "available": "is taken"
  },
  {
    "title": "netflixandchill.com",
    "meaning": "It means that you are going to go over to your partners house and fuck with Netflix in the background.",
    "example": "\"Yeah we just watched Netflix and chilled.\"\r\"Damn nigga how deep?\"\r\"Four knuckles deep\"",
    "id": "mgr5ghw8l6",
    "available": "is taken"
  },
  {
    "title": "fullfoiegras.com",
    "meaning": "The process of eating a huge amount of food very quickly, stuffing oneself to the point of making one feel as if he/she is a duck force-fed to grow its liver for harvest",
    "example": "A: I'm so baked, I'm going full foie gras on that pizza as soon as it gets here.\r(30 second pause)\rB: You baked a pizza?\r(30 second pause)\rA: What? No, I ordered it from Domino's.(30 second pause)\rB: Domino's sells pizza with foie gras? That's some fancy shit.\rA: Wait. What? Never mind.",
    "id": "0413ga8wj0",
    "available": "is available"
  },
  {
    "title": "futurenanigans.com",
    "meaning": "Shenanigans that will happen in the future",
    "example": "A: Yeah, I totally am going out with this girl\rB: I call futurenanigans\rA: Aw",
    "id": "0981dapxqm",
    "available": "is available"
  },
  {
    "title": "alphabet.com",
    "meaning": "The act of using the alphabet to bring a woman considerable pleasure during cunnilingus.",
    "example": "Trace all the letters of the alphabet when going down on a woman, the method known wide and far by many, to give her the best oral sex of her life.",
    "id": "6rno4c15k0",
    "available": "is taken"
  },
  {
    "title": "onseen.com",
    "meaning": "When you text somebody and they read it but don't text back",
    "example": "°\"Bryan guess who i was texting last night\"°\"who\"°\"shanice but she left me on seen after i asked her for head\"",
    "id": "65lgdfyegm",
    "available": "is taken"
  },
  {
    "title": "doapicasso.com",
    "meaning": "When you have taken so many drugs your mouth is at the other side of your face to your eyes",
    "example": "I'm going to do a picasso tonight, my face will be a picture.",
    "id": "6dd19b8rd6",
    "available": "is available"
  },
  {
    "title": "stallbrother.com",
    "meaning": "A person who enters and occupies a public restroom stall adjacent to a stall that is already occupied despite the fact that there were other stalls available that would have allowed a buffer, negatively affecting the enjoyment of your activity. An offense similar to occupying the middle urinal.",
    "example": "I went to take a dump at the mall and had the whole bathroom to myself! Then just as I get ready to go, some asshole walks in and takes the stall next to me. I said 'Dude, can you take the next one down? I don't want to be stall brothers'.",
    "id": "0kdyqsej8m",
    "available": "is available"
  },
  {
    "title": "pouringthemilkfirst.com",
    "meaning": "In cereal, there is two different ways to make it. Pouring the cereal, or the milk first in the bowl. People generally pour in the cereal first. \"Pouring the milk first\" is considered wrong. People who pour the milk first, shouldn't be trusted.",
    "example": "I had my friend over, and for breakfast he was \"pouring the milk first.\" I will never see him the same way again.",
    "id": "6now4tgz8m",
    "available": "is available"
  },
  {
    "title": "emergenturd.com",
    "meaning": "A poop that comes on so suddenly that one fears they may not be able to make it to the toilet.",
    "example": "\"I'm glad I got to the bathroom when I did, I've got a major emergenturd.\"",
    "id": "me7kxhgx96",
    "available": "is taken"
  },
  {
    "title": "pedolicious.com",
    "meaning": "Someone or something that exubes an aura of pedophilia, such as a creepy old man with candy or an older van with tinted windows.",
    "example": "Watch out for the neighbor, he is sooooo pedolicious. Dude drives a pedovan and everything.",
    "id": "mj35psgj86",
    "available": "is taken"
  },
  {
    "title": "margraine.com",
    "meaning": "Brain freeze caused from rapidly slurping down a frozen margarita beverage.",
    "example": "My girlfriend gets a wicked margraine when she tries to drink her frozen margarita too fast to get high.",
    "id": "m35xdfqxe6",
    "available": "is available"
  },
  {
    "title": "cockroachblocked.com",
    "meaning": "When you find a cockroach in your apartment right before going to bed and your girlfriend is too freaked out to have sex.",
    "example": "\"I swear to god, those damn cockroaches only show up on nights when I'm going to get some. Cockroach blocked again.\"",
    "id": "0xve9hqyl6",
    "available": "is available"
  },
  {
    "title": "brocobama.com",
    "meaning": "What Obama calls his broccoli",
    "example": "Thanks Michelle for making me some Broc Obama and Cheese",
    "id": "6l32ru93q6",
    "available": "is available"
  },
  {
    "title": "presidentialflashcards.com",
    "meaning": "(n.)Cash money, dollar bills, dough, moolah, bread.",
    "example": "That kid just asked me to help him with some presidential flashcards",
    "id": "68lrdf58pm",
    "available": "is available"
  },
  {
    "title": "shirtcocking.com",
    "meaning": "Men who go about their day with a shirt on, but no pants or underwear.\r\r\"Cocking\" can be used with other terms. Example: Cowl Cocking, when a man wears only a super heros cowl, much like Batmans cowl, but no pants or underwear.",
    "example": "Look at that dude, he's totally shirt cocking.",
    "id": "6pegzcyd9m",
    "available": "is taken"
  },
  {
    "title": "prewake.com",
    "meaning": "a party, held in honor of an ill individual expected to die soon, often a family member",
    "example": "My mother in law has lung cancer so we held a pre-wake with all her family members from around the country.",
    "id": "mvovlslon6",
    "available": "is taken"
  },
  {
    "title": "nomophobia.com",
    "meaning": "Fear of being away from a mobile phone.",
    "example": "That guy has serious nomophobia.",
    "id": "mog7yt41n0",
    "available": "is taken"
  },
  {
    "title": "planicking.com",
    "meaning": "Verb: The act of last minute screaming planning action that does not divert panic",
    "example": "she began planicking as the blue line edged across her pregnancy test.",
    "id": "61xq9c1wr0",
    "available": "is taken"
  },
  {
    "title": "dayhazed.com",
    "meaning": "Blazin' it in the daytime.",
    "example": "Hey bro, wanna roll a fat one and get day hazed?",
    "id": "0wk3ehwgz0",
    "available": "is available"
  },
  {
    "title": "sleeponlife.com",
    "meaning": "Let life go by or pass on by",
    "example": "\"You haven't heard this song? Everybody know this song, bro you sleep on life.\"",
    "id": "6qo4of87lm",
    "available": "is available"
  },
  {
    "title": "lipboxing.com",
    "meaning": "Talking shit over social media (twitter,Instagram) or talking shit to somebody else without the person they are taking about knowing.",
    "example": "Boy-William stay talkin shit on ig\rGirl-he lip boxing",
    "id": "6y523inowm",
    "available": "is for sale"
  },
  {
    "title": "bathroomstalling.com",
    "meaning": "Waiting to leave the bathroom as to avoid any contact with people in in stalls next to you.",
    "example": "\"Dude I did some Bathroom Stalling because The gut next to me ripped a big one. I couldn't stand to look him in the eye.\"",
    "id": "021rrijqnm",
    "available": "is for sale"
  },
  {
    "title": "gettinglazy.com",
    "meaning": "Getting lazy is the act of just laying on the ground after being slammed or a hard fall. Most commonly used amongst skaters, bmx riders, and other extreme sports.",
    "example": "Dalton: \"hey tyler Whats jake doing on the ground?\"\rTyler: \"he's just getting lazy, he tried dropping in on the fifteen foot halfpipe for the first time and slammed.\"",
    "id": "6zlzwfoj3m",
    "available": "is taken"
  },
  {
    "title": "takeawildfuckingguess.com",
    "meaning": "Remark used when someone asks a question about something especially when it's really stupid.",
    "example": "Dumbass: What's wrong?\r*Looks around the destroyed city*\rGuy: What's wrong? Take a wild fucking guess.",
    "id": "67nx9f17pm",
    "available": "is available"
  },
  {
    "title": "onwho.com",
    "meaning": "To swear on a person you hold in high regard. Usually a deceased friend or relative.",
    "example": "Friend 1: \"I already fucked Bob\"\rFriend 2: \"You wellin, On who??\"",
    "id": "mgr1guw8l6",
    "available": "is taken"
  },
  {
    "title": "bodybymattel.com",
    "meaning": "Female that is more plastic than human.",
    "example": "\"Nothing on that gal is more than 5 years old. My daughter has Barbie dolls older than that. I wonder if she's stamped with a Body by Mattel\" logo. \" See fauxen",
    "id": "041lgs8wj0",
    "available": "is available"
  },
  {
    "title": "textsoaked.com",
    "meaning": "A relationship based solely on text messages to the extent that in-person interaction is awkward. Common in online dating situations.",
    "example": "We texted everyday for two weeks, she was flirty and funny, we got along great, but we tried meeting in person we were all text soaked. It was weird and awkward trying to talk",
    "id": "098jdfpxqm",
    "available": "is for sale"
  },
  {
    "title": "dotwatching.com",
    "meaning": "Verb. The desperately intense observation of your smart phone screen message thread, as you wait in hope for a reply from someone you are romantically engaged with.",
    "example": "I spent Saturday night Dot watching again, what did you do?",
    "id": "6rnv4b15k0",
    "available": "is taken"
  },
  {
    "title": "puncherschance.com",
    "meaning": "It's a boxing term. It means that though you may be outclassed by your opponent, if you land a good punch, you can win.",
    "example": "Bob was down in the polls, but if he did well in the debate, he'd have puncher's chance of winning the election.",
    "id": "65lkdtyegm",
    "available": "is taken"
  },
  {
    "title": "aandr.com",
    "meaning": "Assault and Robbery or Against persons and Robbery is category of crime. It's a lingual abbreviation used by police or law enforcement.",
    "example": "- \" I had a four man team for a big grab and lost one to smokies. I came looking to replace him. If you're still a badass!\r- \" I don't do A and R, man. No fucking bank job.\"",
    "id": "6ddq9i8rd6",
    "available": "is taken"
  },
  {
    "title": "faceremorse.com",
    "meaning": "The moment after posting something inflammatory or militant on Facebook that you immediately regret. No matter how quickly it is deleted, people have screenshots.",
    "example": "\"Did you see her post about last night?\"\r\"No, she must have deleted it in a fit of Faceremorse\"\r\"Don't worry, here's a screenshot\"",
    "id": "0kd5qhej8m",
    "available": "is available"
  },
  {
    "title": "imbatmansyndrome.com",
    "meaning": "When Batman fans try to rationalize that Batman would beat any other super hero because he is Batman and nothing more, when realistically any other super hero would strangle Batman with his own asshole.",
    "example": "\"Batman would totally beat super man cause he would like totally have a back up plan, even with his powers.\"\robviously suffers from \"I'm Batman syndrome\"",
    "id": "6noz4agz8m",
    "available": "is available"
  },
  {
    "title": "eyecabbage.com",
    "meaning": "the complete opposite of eye candy",
    "example": "\"the boys nice!\"\"shoosht mate thats eye cabbage\"",
    "id": "me75xcgx96",
    "available": "is available"
  },
  {
    "title": "genderfriend.com",
    "meaning": "the gender-free way to call your BF/GF",
    "example": "hey how's your new gender-friend ;-)?",
    "id": "mj31psgj86",
    "available": "is taken"
  },
  {
    "title": "mormonfirstbase.com",
    "meaning": "Engaging in hand to hand contact. In other words, holding hands.",
    "example": "I walked in on Doug trying to get to mormon first base with a girl, while viewing a non-rated R movie.",
    "id": "m35ldtqxe6",
    "available": "is available"
  },
  {
    "title": "arcticfever.com",
    "meaning": "when you are attracted to white girls only",
    "example": "Young-chan, do you like Asian girls? No, I have arctic fever.",
    "id": "0xvy9uqyl6",
    "available": "is taken"
  },
  {
    "title": "putmeinthecar.com",
    "meaning": "Asking your homie to hook you up with his girlfriends best friend.",
    "example": "\"Aye bruh what's up with Tina homegirl...\"PUT ME IN THE CAR\"",
    "id": "6l3yru93q6",
    "available": "is available"
  },
  {
    "title": "youdontpourmycereal.com",
    "meaning": "You don't know me, you don't know what I do, you haven't lived my life, you don't know my struggles nor trials and tribulations",
    "example": "Random THOT: You got me fucked up, bitch you don't pour my cereal!\rJames: How'd you know I'd do that?\rErin: I know you, I pour yo cereal!!!",
    "id": "68l1dt58pm",
    "available": "is available"
  },
  {
    "title": "jennycrackdiet.com",
    "meaning": "the eating habits of a methamphetamine/crack user",
    "example": "Have you seen Jane lately, she is looking very healthy now that she is off the Jennycrack Diet.'Are you hungry, would u like something to eat there is more than enough here. or have u started that jennycrack diet again?'",
    "id": "6pe4zbyd9m",
    "available": "is available"
  },
  {
    "title": "grillporn.com",
    "meaning": "catalogs made up of outdoor barbecue cookers and smokers mailed to men just before Fourth of July and Father's Day",
    "example": "Wow, I've got to show Mike this grill porn",
    "id": "mvoklulon6",
    "available": "is taken"
  },
  {
    "title": "sausagefears.com",
    "meaning": "a term to describe the actions of straight men who are afraid of showing any physical or emotional bond to the men they are friends with. This is akin to saying \"no homo,\" and is a result of toxic masculinity and homophobia",
    "example": "\"Why is Derek afraid of hugging Jonathan?\" \"He's got mad sausage fears, bro.\"",
    "id": "moglya41n0",
    "available": "is available"
  },
  {
    "title": "redpilled.com",
    "meaning": "enlightened; aware of the nature of the universe. Is a reference to The Matrix (blue pill or red pill)",
    "example": "\"Wow, our philosophy professor is red pilled.\"",
    "id": "61xl9b1wr0",
    "available": "is for sale"
  },
  {
    "title": "eyebrowpubes.com",
    "meaning": "on your eyebrow, the long curly hairs that protrude beyond the flat straight hairs",
    "example": "\"Hey, checkout her savage brow bush! She has eyebrow pubes!\"\r\"Jeez better let her know before someone calls her a funt-cace\"",
    "id": "0wk9euwgz0",
    "available": "is available"
  },
  {
    "title": "stagefourclinger.com",
    "meaning": "When a girl sleeps with a guy once and he moves in and you can never be rid of him",
    "example": "He's such a stage four clinger, we hooked up once and now he's been at my place for 2 months.",
    "id": "6qoyoa87lm",
    "available": "is taken"
  },
  {
    "title": "richrolling.com",
    "meaning": "Verb: the act of showing one's most ornate materials (i.e. Cars, jewels, clothes, weave, new nails) once said person comes into money, expected or unexpected.",
    "example": "Damn, Lexo been rich rolling like a mutha since she hit that lotto!",
    "id": "6y5o3cnowm",
    "available": "is taken"
  },
  {
    "title": "snaphoe.com",
    "meaning": "Pay per view stripper who uses snapchats snapcash feature to make money.",
    "example": "Kris: dam gurl how you make your money\rJenny: I'm a snaphoe",
    "id": "0212rcjqnm",
    "available": "is taken"
  },
  {
    "title": "nopunintended.com",
    "meaning": "Pun intended. (and now acknowledged)",
    "example": "Jack: \"At least the farmer made it back to his roots. No pun intended.\"Jill: \"There's no chance that pun was unintentional.\"Jack: \"Yeah, I know. I just instantly feel like an annoying asshole.\"Jill: \"Good, you should.\"",
    "id": "6zlwwtoj3m",
    "available": "is taken"
  },
  {
    "title": "goosecheese.com",
    "meaning": "The female version of duck butter.",
    "example": "Guy: We ain't having sex right now. I haven't showered once on this camping trip.\rGirl: Don't worry about it, my goose cheese will even the score.",
    "id": "67n19b17pm",
    "available": "is for sale"
  },
  {
    "title": "glitteraf.com",
    "meaning": "when you look perfect and no one can tell you otherwise.",
    "example": "\"I wear gold on my eyelids because i'm glitter af.\"\rquote used from a video",
    "id": "mgr4gsw8l6",
    "available": "is available"
  },
  {
    "title": "narcisexual.com",
    "meaning": "Narcisexual, rooting to the word of Narcissist (loving yourself), means you are only sexually attracted to yourself. (Also see Narciromantic)",
    "example": "\"I think he's Narcisexual. He's never slept with anyone and he said he masturbates all the time.\"",
    "id": "0417gh8wj0",
    "available": "is taken"
  },
  {
    "title": "hashtalk.com",
    "meaning": "When hashtags are spoken out loud.",
    "example": "Example of someone hashtalking: \"They accepted my application! hashtag-boom. hashtag-slay!\"",
    "id": "0989dbpxqm",
    "available": "is for sale"
  },
  {
    "title": "transoccupational.com",
    "meaning": "When you relate more to an occupation not your own.",
    "example": "Batman isn't a vigilante, he's just transoccupational.",
    "id": "6rn24u15k0",
    "available": "is available"
  },
  {
    "title": "bullballs.com",
    "meaning": "a man that has massive balls that hang low, similar to a bull.",
    "example": "I can tell he has Bull balls cuz his package is HUGE!!",
    "id": "65ljdayegm",
    "available": "is taken"
  },
  {
    "title": "speciesdysphoria.com",
    "meaning": "a feeling that one is in the body of the wrong species",
    "example": "Alyssa: I told the shrink that I feel like a wild animal trapped in a human body, and she said it sounds like classic species dysphoria.\rJacques: I know I was meant to be a dolphin. Why did I end up a sexy human instead?? Species dysphoria sucks.\rJerry: If only I'd been born a bird, I wouldn't have to spend so much money on flying, parachuting, hang-gliding, sky-diving and base-jumping. Damned species dysphoria.",
    "id": "6ddr9c8rd6",
    "available": "is available"
  },
  {
    "title": "foodmonitor.com",
    "meaning": "The person who nitpicks and judges everyone's food choices at the dinner table.",
    "example": "Food Monitor: You can't eat those french fries, those have 1600 calories, they are bad for you. Similar to the hall monitor when you were at school.",
    "id": "0kd3quej8m",
    "available": "is taken"
  },
  {
    "title": "whathappenednext.com",
    "meaning": "Click bait to get you to go to the story.",
    "example": "He decapitated his entire family, including his grandparents, but what happened next will truly shock you.",
    "id": "6no34tgz8m",
    "available": "is taken"
  },
  {
    "title": "shitorgetoffthepot.com",
    "meaning": "Do what you ment to do and do it fast, or just drop it.",
    "example": "Shit or get off the fucking pot man, you have to get one item not 5 fucking items.",
    "id": "me74xbgx96",
    "available": "is for sale"
  },
  {
    "title": "sphinctertrembles.com",
    "meaning": "Fear of relaxing the sphincter after a few days without a poo",
    "example": "Had my morning coffee with my partner this morning and got a case of the sphincter trembles, sat there smiling with fear of how this would play out.",
    "id": "mj3wphgj86",
    "available": "is available"
  },
  {
    "title": "preditation.com",
    "meaning": "The word Sarah Palin uses when she means to say predation.",
    "example": "I refudiate the claim preditation is not a word.",
    "id": "m35zdaqxe6",
    "available": "is taken"
  },
  {
    "title": "spitemarriage.com",
    "meaning": "A marriage motivated primarily by a desire to hurt or get even with someone else.",
    "example": "\"She soon found out that her spite marriage to Bob was a big mistake. You see, Tom didn't care -- in fact he congratulated them both with the utmost sincerity.\"",
    "id": "0xvo9sqyl6",
    "available": "is available"
  },
  {
    "title": "preclapulation.com",
    "meaning": "Clapping before you even know what you're clapping for.",
    "example": "When Walter was the only one clapping at the show, it was obvious that he was suffering from preclapulation.",
    "id": "6l31rs93q6",
    "available": "is available"
  },
  {
    "title": "furofthecatthatscratchedme.com",
    "meaning": "smoking some marijuana to cure the effects of having smoked too much the night before.",
    "example": "I feel better now that i have had some fur of the cat that scratched me.",
    "id": "68ljda58pm",
    "available": "is taken"
  },
  {
    "title": "shitthefuckyeah.com",
    "meaning": "Exclamation for when something is just too cool for any other phrase.",
    "example": "\"I just got us tickets to the ... show.\"\"Shit the Fuck Yeah!\"",
    "id": "6pedziyd9m",
    "available": "is available"
  },
  {
    "title": "insipiosexual.com",
    "meaning": "From Latin \"insipiens\" (opposite of \"sapiens\") and \"sexualis\" (sexual), meaning \"attracted primarily to fools.\"",
    "example": "Often assumed to be heterosexual, Laura Bush is actually insipiosexual. George was just the one she fell in love with.",
    "id": "mvo1lslon6",
    "available": "is taken"
  },
  {
    "title": "trustfail.com",
    "meaning": "A poorly executed trust fall, i.e. you do not catch the person who is dropping back in to your arms.",
    "example": "Kendall was all set with this team building exercise until Barry was gabbing to Corbin and not paying attention, resulting in Kendall falling back to not get caught by Barry - trust fail.",
    "id": "mog1yf41n0",
    "available": "is taken"
  },
  {
    "title": "cinderfella.com",
    "meaning": "A man who must be home by midnight for any one of a variety of reasons or he will face serious consequences",
    "example": "Dan: Dude its 1145, I gotta get out of here and take my medicine or I'll pass out.Mike: You are such a Cinderfella",
    "id": "61xy9i1wr0",
    "available": "is taken"
  },
  {
    "title": "gradbod.com",
    "meaning": "similar to dad bod, but only achieved by binge drinking while studying all year. No kids necessary.",
    "example": "Chicks totally dig grad bod cause they think it's dad bod.",
    "id": "0wkneswgz0",
    "available": "is for sale"
  },
  {
    "title": "lookinfriday.com",
    "meaning": "When you're dressed in your Friday best ready to hit the bars and pick up some chicks. Lookin fly as a mother fucker.",
    "example": "Person A: Man do you think I'm dressed well enough for the party?Person B: Sheeeeit, you lookin' Friday as hell.",
    "id": "6qo9of87lm",
    "available": "is for sale"
  },
  {
    "title": "necrophobia.com",
    "meaning": "Of which one has an abnormal fear of dying; A persistent fear of dying or the process of dying.",
    "example": "\"Man, you have necrophobia if you cant stay home alone.\"",
    "id": "6y5y3snowm",
    "available": "is taken"
  },
  {
    "title": "facebookmachine.com",
    "meaning": "A computer primarily designed to browse sites like Facebook instead of doing proper work on.",
    "example": "The new Macbook is a $1000 Facebook Machine.",
    "id": "021xrfjqnm",
    "available": "is available"
  }
]
