[
  {
    "title": "twittatorship.com",
    "meaning": "A dictatorship that is attempted through late night Twitter decrees, that have no legal leverage .",
    "example": "Trump seems to think he can run the country by Twittatorship.",
    "id": "nw61ns4m4k",
    "available": "is taken"
  },
  {
    "title": "pissgate.com",
    "meaning": "The scandal in which there may or may not be a tape of the President getting pissed on by Russian prostitutes",
    "example": "I cant believe the President is caught up in this pissgate",
    "id": "j20wkt40vg",
    "available": "is taken"
  },
  {
    "title": "pullatrump.com",
    "meaning": "To blatantly keep asserting a lie, despite the overwhelming and obvious facts to the contrary.",
    "example": "Real Estate Salesman tried to pull a Trump, as he stood next to me on the empty lot, he kept insisting that the building located on the lot was currently renting for 100k a month.",
    "id": "1k6qkcj62r",
    "available": "is for sale"
  },
  {
    "title": "burner.com",
    "meaning": "A throwaway prepaid cellphone, typically used by dealers. Used until the minutes are up, then thrown away so they cannot be tapped.",
    "example": "'There is burners all over the street.'",
    "id": "g36y2u8m1q",
    "available": "is taken"
  },
  {
    "title": "zuckerversary.com",
    "meaning": "When you celebrate a year of friendship on Facebook.",
    "example": "Jim: Hey Steve, we've been friends for six years on Facebook. Happy zuckerversary!",
    "id": "zv022fo013",
    "available": "is available"
  },
  {
    "title": "saunabomb.com",
    "meaning": "Running into a sauna naked and pooping on the heat source",
    "example": "I was having a relaxing schvitz when Trump totally sauna bombed and blamed it on Obama.",
    "id": "l76z2ie6dy",
    "available": "is available"
  },
  {
    "title": "mooch.com",
    "meaning": "Someone who wants something for free .. someone who takes and takes but doesn't give back.",
    "example": "Matt is the biggest MOOCH ive ever seen",
    "id": "xw67ghj6ke",
    "available": "is taken"
  },
  {
    "title": "cannabusiness.com",
    "meaning": "The fine art of selling weed.",
    "example": "\"hey Aaron\"\r\r\"ey\"\r\r\"soo i uhh... heard you were in the business.\"\r\r\"what?\"\r\r\"the cannabusiness?\"",
    "id": "ykmg8ar0x3",
    "available": "is taken"
  },
  {
    "title": "talkingbrown.com",
    "meaning": "talking shit, bullshitting, lying",
    "example": "Will you ever stop talking brown Martina",
    "id": "8904pbq031",
    "available": "is available"
  },
  {
    "title": "sleepmode.com",
    "meaning": "To temporarily shut off the thinking part of your brain and focus only at the task at hand, such as eating, playing video games, watching television, or exercising.",
    "example": "Husband: \"..........\" (Eats dinner while running sleep mode)Wife: \"Whatcha thinking about?\"Husband: \"..........Nothing.\" (Continues eating as he enters sleep mode again)",
    "id": "5409zsvmox",
    "available": "is taken"
  },
  {
    "title": "magicstairs.com",
    "meaning": "Another term for escalator.",
    "example": "The elevator is too slow; I'll take the magic stairs.",
    "id": "dy6r8tz017",
    "available": "is taken"
  },
  {
    "title": "shelffriend.com",
    "meaning": "When you become an option. You are not first pick of friends. When your friend starts dating someone and you are put up on a shelf until they have no other people to hang with.",
    "example": "I don't need you anymore, I'm dating somebody. So I'll put you up on the shelf until I have a need for you. You are my shelf friend.",
    "id": "gz65oc3mop",
    "available": "is for sale"
  },
  {
    "title": "verbalhandcuffs.com",
    "meaning": "When someone won't stop talking (usually about a subject you have no interest in). The talker has verbally forced you to stand there there and listen, even though you have given many clues that you have checked out. Examples: vacant stares, looking at your watch, checking your phone, answering in short one word phrases.",
    "example": "Girl 1 :So then I realized my cat really likes Meow Mix more than Frisky's but only if I mix it with Fancy Feast.Girl 2: (Stares blankly)Girl 1: Unless of course it's Chicken Livers from 9 Lives, Snowball loves that. It's her favorite.Girl 2: Uh-huh.Girl 1: Of course on her birthday I give her the good stuff, real tuna!Girl 2: (Thinks fuck me, verbal handcuffs)",
    "id": "rq6dyux6lp",
    "available": "is taken"
  },
  {
    "title": "gladimirputin.com",
    "meaning": "1. When Vladimir Putin smiles in a meme-worthy manner. (Name)2. Feeling glad or smug. (Slang)Antonym: Sadimir Putin",
    "example": "Gladimir Putin memes were all over my feed after the election.When Dick found out his girlfriend wasn't pregnant, he was super Gladimir Putin.",
    "id": "k90kzfl02j",
    "available": "is available"
  },
  {
    "title": "teethpaste.com",
    "meaning": "A special form of tooth paste designed to work on multiple teeth simultaneously.",
    "example": "This teeth paste is awesome! Gone are the days of tirelessly scrubbing one tooth at a time.",
    "id": "xy6nxirmvp",
    "available": "is taken"
  },
  {
    "title": "milkshakeduck.com",
    "meaning": "Someone who gains sudden fame for something nice and positive, only to soon after be revealed as a deeply flawed character with terrible opinions and/or a shady past, often involving corrosive social/political ideologies, which quickly tarnishes their fame and the good will people momentarily had towards them.",
    "example": "\"The whole internet loves Milkshake Duck, a lovely duck that drinks milkshakes! *5 seconds later* We regret to inform you the duck is racist\" -@pixelatedboat via Twitter",
    "id": "nomeqhnmel",
    "available": "is taken"
  },
  {
    "title": "whenihavetime.com",
    "meaning": "I'm never gonna do it",
    "example": "Person: can you do the dishes?\rPerson2: when I have time",
    "id": "5zmjyawm3w",
    "available": "is taken"
  },
  {
    "title": "bonadude.com",
    "meaning": "A modern legal term, _Bona Dude_ means \"in good dude\" in a cross of Legal Latin and Modern English. The term stresses the entirely \"good dude\" nature of the person to whom it refers. A \"bona dude\" is sincere and earnest about being a good dude.First used by @SCOTUSblog on Twitter, 2017 June 26.",
    "example": "The Supreme Court of the United States lifts injunction against travel ban, except with respect to individuals with _bona dude_ relationship to the US.",
    "id": "x4m34bj02v",
    "available": "is taken"
  },
  {
    "title": "broflake.com",
    "meaning": "Member of the alt-right who proudly shouts their free-speech warrior credentials but lose their minds when a fellow member is critcized.",
    "example": "I see a mass of Dave Rubin's broflakes have had Contrapoint's video kicked off YouTube.",
    "id": "790x2s2m21",
    "available": "is taken"
  },
  {
    "title": "ticketstopolicemansball.com",
    "meaning": "Defination:To pay off a cop. a bribe, A \"Shakedown\",\r.a solicatation for a payoff by an official, agent, officer, pretend or real. c.t.",
    "example": "ex: \"Theres a $500.OO fine for That!\",\r\"Or, you could buy a coupl'a -tickets to Policeman's Ball\" , \"50 bucks each, 2-3 should do\"\r( No, there was no 'Real' Ball/Dance). c.t",
    "id": "j26lgt8m4p",
    "available": "is available"
  },
  {
    "title": "fartoholic.com",
    "meaning": "Someone who is addicted to their own fart smell, and so farts as often as possible.",
    "example": "'Stan, you're a real fartoholic'\r'So?'\r'You stink.'",
    "id": "jq689ckmk3",
    "available": "is available"
  }
]
